[{"id": "2002.01045", "submitter": "Mikhail Volkov", "authors": "Hanan Shabana and Mikhail Volkov", "title": "Careful synchronization of partial deterministic finite automata", "comments": "34 pages, 13 figures. This is an extended version of arXiv:1903.10549", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We approach the task of computing a carefully synchronizing word of optimum\nlength for a given partial deterministic automaton, encoding the problem as an\ninstance of SAT and invoking a SAT solver. Our experiments demonstrate that\nthis approach gives satisfactory results for automata with up to 100 states\neven if very modest computational resources are used. We compare our results\nwith the ones obtained by the first author for exact synchronization, which is\nanother version of synchronization studied in the literature, and draw some\ntheoretical conclusions.\n", "versions": [{"version": "v1", "created": "Mon, 3 Feb 2020 23:09:05 GMT"}, {"version": "v2", "created": "Sun, 17 May 2020 19:32:50 GMT"}], "update_date": "2020-05-19", "authors_parsed": [["Shabana", "Hanan", ""], ["Volkov", "Mikhail", ""]]}, {"id": "2002.01214", "submitter": "Karl-Heinz Zimmermann", "authors": "Karl-Heinz Zimmermann, Merve Nur Cakir", "title": "On Stochastic Automata over Monoids", "comments": "29 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastic automata over monoids as input sets are studied. The\nwell-definedness of these automata requires an extension postulate that\nreplaces the inherent universal property of free monoids. As a generalization\nof Turakainen's result, it will be shown that the generalized automata over\nmonoids have the same acceptance power as their stochastic counterparts. The\nkey to homomorphisms is a commuting property between the monoid homomorphism of\ninput states and the monoid homomorphism of transition matrices. Closure\nproperties of the languages accepted by stochastic automata over monoids are\ninvestigated. matrices. Closure properties of the languages accepted by\nstochastic automata over monoids are investigated.\n", "versions": [{"version": "v1", "created": "Tue, 4 Feb 2020 10:30:49 GMT"}], "update_date": "2020-02-05", "authors_parsed": [["Zimmermann", "Karl-Heinz", ""], ["Cakir", "Merve Nur", ""]]}, {"id": "2002.01969", "submitter": "Mohamadreza Ahmadi", "authors": "Mohamadreza Ahmadi, Arun A. Viswanathan, Michel D. Ingham, Kymie Tan,\n  and Aaron D. Ames", "title": "Partially Observable Games for Secure Autonomy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.CR cs.FL cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Technology development efforts in autonomy and cyber-defense have been\nevolving independently of each other, over the past decade. In this paper, we\nreport our ongoing effort to integrate these two presently distinct areas into\na single framework. To this end, we propose the two-player partially observable\nstochastic game formalism to capture both high-level autonomous mission\nplanning under uncertainty and adversarial decision making subject to imperfect\ninformation. We show that synthesizing sub-optimal strategies for such games is\npossible under finite-memory assumptions for both the autonomous decision maker\nand the cyber-adversary. We then describe an experimental testbed to evaluate\nthe efficacy of the proposed framework.\n", "versions": [{"version": "v1", "created": "Wed, 5 Feb 2020 19:31:56 GMT"}], "update_date": "2020-02-07", "authors_parsed": [["Ahmadi", "Mohamadreza", ""], ["Viswanathan", "Arun A.", ""], ["Ingham", "Michel D.", ""], ["Tan", "Kymie", ""], ["Ames", "Aaron D.", ""]]}, {"id": "2002.02376", "submitter": "Roberto Amadini", "authors": "Roberto Amadini", "title": "A Survey on String Constraint Solving", "comments": "Under consideration for \"ACM Computing Surveys\" journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  String constraint solving refers to solving combinatorial problems involving\nconstraints over string variables. String solving approaches have become\npopular over the last years given the massive use of strings in different\napplication domains like formal analysis, automated testing, database query\nprocessing, and cybersecurity. This paper reports a comprehensive survey on\nstring constraint solving by exploring the large number of approaches that have\nbeen proposed over the last decades to solve string constraints.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2020 01:05:38 GMT"}, {"version": "v2", "created": "Fri, 7 Feb 2020 01:26:11 GMT"}, {"version": "v3", "created": "Tue, 11 Feb 2020 23:40:17 GMT"}, {"version": "v4", "created": "Sun, 1 Mar 2020 22:04:34 GMT"}, {"version": "v5", "created": "Fri, 13 Nov 2020 16:51:38 GMT"}, {"version": "v6", "created": "Wed, 25 Nov 2020 09:55:27 GMT"}, {"version": "v7", "created": "Wed, 7 Apr 2021 07:25:52 GMT"}, {"version": "v8", "created": "Wed, 30 Jun 2021 08:34:27 GMT"}], "update_date": "2021-07-01", "authors_parsed": [["Amadini", "Roberto", ""]]}, {"id": "2002.02512", "submitter": "Herman Geuvers", "authors": "Herman Geuvers and Bart Jacobs", "title": "Relating Apartness and Bisimulation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A bisimulation for a coalgebra of a functor on the category of sets can be\ndescribed via a coalgebra in the category of relations, of a lifted functor. A\nfinal coalgebra then gives rise to the coinduction principle, which states that\ntwo bisimilar elements are equal. For polynomial functors, this leads to\nwell-known descriptions. In the present paper we look at the dual notion of\n\"apartness\". Intuitively, two elements are apart if there is a positive way to\ndistinguish them. Phrased differently: two elements are apart if and only if\nthey are not bisimilar. Since apartness is an inductive notion, described by a\nleast fixed point, we can give a proof system, to derive that two elements are\napart. This proof system has derivation rules and two elements are apart if and\nonly if there is a finite derivation (using the rules) of this fact.\n  We study apartness versus bisimulation in two separate ways. First, for weak\nforms of bisimulation on labelled transition systems, where silent (tau) steps\nare included, we define an apartness notion that corresponds to weak\nbisimulation and another apartness that corresponds to branching bisimulation.\nThe rules for apartness can be used to show that two states of a labelled\ntransition system are not branching bismilar. To support the apartness view on\nlabelled transition systems, we cast a number of well-known properties of\nbranching bisimulation in terms of branching apartness and prove them. Next, we\nalso study the more general categorical situation and show that indeed,\napartness is the dual of bisimilarity in a precise categorical sense: apartness\nis an initial algebra and gives rise to an induction principle. In this\nanalogy, we include the powerset functor, which gives a semantics to\nnon-deterministic choice in process-theory.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2020 20:58:48 GMT"}, {"version": "v2", "created": "Thu, 23 Jul 2020 16:23:47 GMT"}, {"version": "v3", "created": "Fri, 24 Jul 2020 08:02:45 GMT"}, {"version": "v4", "created": "Thu, 7 Jan 2021 16:46:53 GMT"}, {"version": "v5", "created": "Tue, 1 Jun 2021 12:40:07 GMT"}, {"version": "v6", "created": "Thu, 29 Jul 2021 14:33:09 GMT"}], "update_date": "2021-07-30", "authors_parsed": [["Geuvers", "Herman", ""], ["Jacobs", "Bart", ""]]}, {"id": "2002.02731", "submitter": "Jeffrey Shallit", "authors": "Trevor Clokie, Thomas F. Lidbetter, Antonio Molina Lovett, Jeffrey\n  Shallit, Leon Witzman", "title": "Computational Aspects of Sturdy and Flimsy Numbers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM cs.FL math.CO math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Following Stolarsky, we say that a natural number n is flimsy in base b if\nsome positive multiple of n has smaller digit sum in base b than n does;\notherwise it is sturdy. We develop algorithmic methods for the study of sturdy\nand flimsy numbers.\n  We provide some criteria for determining whether a number is sturdy. Focusing\non the case of base b = 2, we study the computational problem of checking\nwhether a given number is sturdy, giving several algorithms for the problem. We\nfind two additional, previously unknown sturdy primes. We develop a method for\ndetermining which numbers with a fixed number of 0's in binary are flimsy.\nFinally, we develop a method that allows us to estimate the number of k-flimsy\nnumbers with n bits, and we provide explicit results for k = 3 and k = 5. Our\nresults demonstrate the utility (and fun) of creating algorithms for number\ntheory problems, based on methods of automata theory.\n", "versions": [{"version": "v1", "created": "Fri, 7 Feb 2020 12:17:41 GMT"}], "update_date": "2020-02-10", "authors_parsed": [["Clokie", "Trevor", ""], ["Lidbetter", "Thomas F.", ""], ["Lovett", "Antonio Molina", ""], ["Shallit", "Jeffrey", ""], ["Witzman", "Leon", ""]]}, {"id": "2002.02760", "submitter": "Martin Koelbl", "authors": "Martin Koelbl (1) and Stefan Leue (1) and Thomas Wies (2) ((1)\n  University of Konstanz, (2) New York University)", "title": "TarTar: A Timed Automata Repair Tool", "comments": "15 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We present TarTar, an automatic repair analysis tool that, given a timed\ndiagnostic trace (TDT) obtained during the model checking of a timed automaton\nmodel, suggests possible syntactic repairs of the analyzed model. The suggested\nrepairs include modified values for clock bounds in location invariants and\ntransition guards, adding or removing clock resets, etc. The proposed repairs\nare guaranteed to eliminate executability of the given TDT, while preserving\nthe overall functional behavior of the system. We give insights into the design\nand architecture of TarTar, and show that it can successfully repair 69% of the\nseeded errors in system models taken from a diverse suite of case studies.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jan 2020 18:52:17 GMT"}, {"version": "v2", "created": "Tue, 12 May 2020 09:40:58 GMT"}], "update_date": "2020-05-13", "authors_parsed": [["Koelbl", "Martin", ""], ["Leue", "Stefan", ""], ["Wies", "Thomas", ""]]}, {"id": "2002.03191", "submitter": "Dana Fisman", "authors": "Dana Angluin and Dana Fisman", "title": "Polynomial time algorithms for inclusion and equivalence of\n  deterministic omega acceptors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The class of omega languages recognized by deterministic parity acceptors\n(DPAs) or deterministic Muller acceptors (DMAs) is exactly the regular omega\nlanguages. The inclusion problem is the following: given two acceptors A1 and\nA2, determine whether the language recognized by A1 is a subset of the language\nrecognized by A2, and if not, return an ultimately periodic omega word accepted\nby A1 but not A2. We describe polynomial time algorithms to solve this problem\nfor two DPAs and for two DMAs. Corollaries include polynomial time algorithms\nto solve the equivalence problem for DPAs and DMAs, and also the inclusion and\nequivalence problems for deterministic Buechi and coBuechi acceptors.\n", "versions": [{"version": "v1", "created": "Sat, 8 Feb 2020 15:45:03 GMT"}, {"version": "v2", "created": "Mon, 17 Feb 2020 07:05:35 GMT"}, {"version": "v3", "created": "Sat, 9 May 2020 09:40:38 GMT"}], "update_date": "2020-05-12", "authors_parsed": [["Angluin", "Dana", ""], ["Fisman", "Dana", ""]]}, {"id": "2002.03664", "submitter": "Olivier Serre", "authors": "Rapha\\\"el Berthon, Nathana\\\"el Fijalkow, Emmanuel Filiot, Shibashis\n  Guha, Bastien Maubert, Aniello Murano, Laureline Pinault, Sophie Pinchinat,\n  Sasha Rubin, Olivier Serre", "title": "Alternating Tree Automata with Qualitative Semantics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study alternating automata with qualitative semantics over infinite binary\ntrees: alternation means that two opposing players construct a decoration of\nthe input tree called a run, and the qualitative semantics says that a run of\nthe automaton is accepting if almost all branches of the run are accepting. In\nthis paper we prove a positive and a negative result for the emptiness problem\nof alternating automata with qualitative semantics.\n  The positive result is the decidability of the emptiness problem for the case\nof B\\\"uchi acceptance condition. An interesting aspect of our approach is that\nwe do not extend the classical solution for solving the emptiness problem of\nalternating automata, which first constructs an equivalent non-deterministic\nautomaton. Instead, we directly construct an emptiness game making use of\nimperfect information.\n  The negative result is the undecidability of the emptiness problem for the\ncase of co-B\\\"uchi acceptance condition. This result has two direct\nconsequences: the undecidability of monadic second-order logic extended with\nthe qualitative path-measure quantifier, and the undecidability of the\nemptiness problem for alternating tree automata with non-zero semantics, a\nrecently introduced probabilistic model of alternating tree automata.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2020 11:31:08 GMT"}, {"version": "v2", "created": "Mon, 7 Dec 2020 16:17:42 GMT"}], "update_date": "2020-12-08", "authors_parsed": [["Berthon", "Raphaël", ""], ["Fijalkow", "Nathanaël", ""], ["Filiot", "Emmanuel", ""], ["Guha", "Shibashis", ""], ["Maubert", "Bastien", ""], ["Murano", "Aniello", ""], ["Pinault", "Laureline", ""], ["Pinchinat", "Sophie", ""], ["Rubin", "Sasha", ""], ["Serre", "Olivier", ""]]}, {"id": "2002.04012", "submitter": "Pierre-\\'Etienne Meunier", "authors": "Pierre-\\'Etienne Meunier, Damien Regnault, Damien Woods", "title": "The program-size complexity of self-assembled paths", "comments": "Accepted to STOC2020 - the 52nd Annual ACM Symposium on Theory of\n  Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.CG cs.FL nlin.AO nlin.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove a Pumping Lemma for the noncooperative abstract Tile Assembly Model,\na model central to the theory of algorithmic self-assembly since the beginning\nof the field. This theory suggests, and our result proves, that small\ndifferences in the nature of adhesive bindings between abstract square\nmolecules gives rise to vastly different expressive capabilities.\n  In the cooperative abstract Tile Assembly Model, square tiles attach to each\nother using multi-sided cooperation of one, two or more sides. This precise\ncontrol of tile binding is directly exploited for algorithmic tasks including\ngrowth of specified shapes using very few tile types, as well as simulation of\nTuring machines and even self-simulation of self-assembly systems. But are\ncooperative bindings required for these computational tasks? The definitionally\nsimpler noncooperative (or Temperature 1) model has poor control over local\nbinding events: tiles stick if they bind on at least one side. This has led to\nthe conjecture that it is impossible for it to exhibit precisely controlled\ngrowth of computationally-defined shapes.\n  Here, we prove such an impossibility result. We show that any planar\nnoncooperative system that attempts to grow large algorithmically-controlled\ntile-efficient assemblies must also grow infinite non-algorithmic (pumped)\nstructures with a simple closed-form description, or else suffer blocking of\nintended algorithmic structures. Our result holds for both directed and\nnondirected systems, and gives an explicit upper bound of\n$(8|T|)^{4|T|+1}(5|\\sigma| + 6)$, where $|T|$ is the size of the tileset and\n$|\\sigma|$ is the size of the seed assembly, beyond which any path of tiles is\npumpable or blockable.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2020 18:38:43 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Meunier", "Pierre-Étienne", ""], ["Regnault", "Damien", ""], ["Woods", "Damien", ""]]}, {"id": "2002.04396", "submitter": "Barbara Re", "authors": "Flavio Corradini, Andrea Morichetta, Andrea Polini, Barbara Re,\n  Francesco Tiezzi", "title": "Collaboration vs. choreography conformance in BPMN", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 16, Issue 4 (October\n  27, 2020) lmcs:6861", "doi": "10.23638/LMCS-16(4:7)2020", "report-no": null, "categories": "cs.SE cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The BPMN 2.0 standard is a widely used semi-formal notation to model\ndistributed information systems from different perspectives. The standard makes\navailable a set of diagrams to represent such perspectives. Choreography\ndiagrams represent global constraints concerning the interactions among system\ncomponents without exposing their internal structure. Collaboration diagrams\ninstead permit to depict the internal behaviour of a component, also referred\nas process, when integrated with others so to represent a possible\nimplementation of the distributed system.\n  This paper proposes a design methodology and a formal framework for checking\nconformance of choreographies against collaborations. In particular, the paper\npresents a direct formal operational semantics for both BPMN choreography and\ncollaboration diagrams. Conformance aspects are proposed through two relations\ndefined on top of the defined semantics. The approach benefits from the\navailability of a tool we have developed, named C4, that permits to experiment\nthe theoretical framework in practical contexts. The objective here is to make\nthe exploited formal methods transparent to system designers, thus fostering a\nwider adoption by practitioners.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2020 10:31:57 GMT"}, {"version": "v2", "created": "Wed, 12 Feb 2020 10:53:37 GMT"}, {"version": "v3", "created": "Mon, 22 Jun 2020 20:23:49 GMT"}, {"version": "v4", "created": "Sun, 13 Sep 2020 22:07:18 GMT"}, {"version": "v5", "created": "Mon, 28 Sep 2020 08:28:16 GMT"}, {"version": "v6", "created": "Thu, 1 Oct 2020 16:29:10 GMT"}, {"version": "v7", "created": "Mon, 26 Oct 2020 13:26:09 GMT"}], "update_date": "2021-02-10", "authors_parsed": [["Corradini", "Flavio", ""], ["Morichetta", "Andrea", ""], ["Polini", "Andrea", ""], ["Re", "Barbara", ""], ["Tiezzi", "Francesco", ""]]}, {"id": "2002.04841", "submitter": "Harro Wimmel", "authors": "Uli Schlachter and Harro Wimmel", "title": "Optimal Label Splitting for Embedding an LTS into an arbitrary Petri Net\n  Reachability Graph is NP-complete", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a given labelled transition system (LTS), synthesis is the task to find\nan unlabelled Petri net with an isomorphic reachability graph. Even when just\ndemanding an embedding into a reachability graph instead of an isomorphism, a\nsolution is not guaranteed. In such a case, label splitting is an option, i.e.\nrelabelling edges of the LTS such that differently labelled edges remain\ndifferent. With an appropriate label splitting, we can always obtain a solution\nfor the synthesis or embedding problem. Using the label splitting, we can\nconstruct a labelled Petri net with the intended bahaviour (e.g. embedding the\ngiven LTS in its reachability graph). As the labelled Petri net can have a\nlarge number of transitions, an optimisation may be desired, limiting the\nnumber of labels produced by the label splitting. We show that such a\nlimitation will turn the problem from being solvable in polynomial time into an\nNP-complete problem.\n", "versions": [{"version": "v1", "created": "Wed, 12 Feb 2020 08:28:32 GMT"}], "update_date": "2020-02-20", "authors_parsed": [["Schlachter", "Uli", ""], ["Wimmel", "Harro", ""]]}, {"id": "2002.05075", "submitter": "Daniel Hausmann", "authors": "Daniel Hausmann and Lutz Schr\\\"oder", "title": "NP Reasoning in the Monotone $\\mu$-Calculus", "comments": "Longer version of IJCAR 2020 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Satisfiability checking for monotone modal logic is known to be (only)\nNP-complete. We show that this remains true when the logic is extended with\naconjunctive and alternation-free fixpoint operators as well as the universal\nmodality; the resulting logic -- the aconjunctive alternation-free monotone\n$\\mu$-calculus with the universal modality -- contains both concurrent\npropositional dynamic logic (CPDL) and the alternation-free fragment of game\nlogic as fragments. We obtain our result from a characterization of\nsatisfiability by means of B\\\"uchi games with polynomially many Eloise nodes.\n", "versions": [{"version": "v1", "created": "Wed, 12 Feb 2020 16:28:59 GMT"}, {"version": "v2", "created": "Mon, 4 May 2020 02:04:38 GMT"}], "update_date": "2020-05-05", "authors_parsed": [["Hausmann", "Daniel", ""], ["Schröder", "Lutz", ""]]}, {"id": "2002.05950", "submitter": "Sparsa Roychowdhury", "authors": "S. Akshay, Paul Gastin, S Krishna, Sparsa Roychowdhury", "title": "Revisiting Underapproximate Reachability for Multipushdown Systems", "comments": "52 pages, Conference TACAS 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Boolean programs with multiple recursive threads can be captured as pushdown\nautomata with multiple stacks. This model is Turing complete, and hence, one is\noften interested in analyzing a restricted class that still captures useful\nbehaviors. In this paper, we propose a new class of bounded under\napproximations for multi-pushdown systems, which subsumes most existing\nclasses. We develop an efficient algorithm for solving the under-approximate\nreachability problem, which is based on efficient fix-point computations. We\nimplement it in our tool BHIM and illustrate its applicability by generating a\nset of relevant benchmarks and examining its performance. As an additional\ntakeaway, BHIM solves the binary reachability problem in pushdown automata. To\nshow the versatility of our approach, we then extend our algorithm to the timed\nsetting and provide the first implementation that can handle timed\nmulti-pushdown automata with closed guards.\n", "versions": [{"version": "v1", "created": "Fri, 14 Feb 2020 10:18:29 GMT"}, {"version": "v2", "created": "Tue, 5 May 2020 14:44:30 GMT"}], "update_date": "2020-05-06", "authors_parsed": [["Akshay", "S.", ""], ["Gastin", "Paul", ""], ["Krishna", "S", ""], ["Roychowdhury", "Sparsa", ""]]}, {"id": "2002.06465", "submitter": "Ezio Bartocci", "authors": "Ezio Bartocci, Thomas Ferr\\`ere, Thomas A. Henzinger, Dejan Nickovic\n  and Ana Oliveira da Costa", "title": "Information-Flow Interfaces", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Contract-based design is a promising methodology for taming the complexity of\ndeveloping sophisticated systems. A formal contract distinguishes between\nassumptions, which are constraints that the designer of a component puts on the\nenvironments in which the component can be used safely, and guarantees, which\nare promises that the designer asks from the team that implements the\ncomponent. A theory of formal contracts can be formalized as an interface\ntheory, which supports the composition and refinement of both assumptions and\nguarantees. Although there is a rich landscape of contract-based design methods\nthat address functional and extra-functional properties, we present the first\ninterface theory that is designed for ensuring system-wide security properties,\nthus paving the way for a science of safety and security co-engineering. Our\nframework provides a refinement relation and a composition operation that\nsupport both incremental design and independent implementability. We develop\nour theory for both stateless and stateful interfaces. We illustrate the\napplicability of our framework with an example inspired from the automotive\ndomain. Finally, we provide three plausible trace semantics to stateful\ninformation-flow interfaces and we show that only two correspond to temporal\nlogics for specifying hyperproperties, while the third defines a new class of\nhyperproperties that lies between the other two classes.\n", "versions": [{"version": "v1", "created": "Sat, 15 Feb 2020 22:49:34 GMT"}, {"version": "v2", "created": "Tue, 18 Feb 2020 04:19:25 GMT"}, {"version": "v3", "created": "Thu, 7 May 2020 20:53:25 GMT"}], "update_date": "2020-05-11", "authors_parsed": [["Bartocci", "Ezio", ""], ["Ferrère", "Thomas", ""], ["Henzinger", "Thomas A.", ""], ["Nickovic", "Dejan", ""], ["da Costa", "Ana Oliveira", ""]]}, {"id": "2002.06737", "submitter": "Zhe Chen", "authors": "Zhe Chen, Yunyun Chen, Robert M. Hierons and Yifan Wu", "title": "Four-valued monitorability of $\\omega$-regular languages", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Runtime Verification (RV) is a lightweight formal technique in which program\nor system execution is monitored and analyzed, to check whether certain\nproperties are satisfied or violated after a finite number of steps. The use of\nRV has led to interest in deciding whether a property is monitorable: whether\nit is always possible for the satisfaction or violation of the property to be\ndetermined after a finite future continuation. However, classical two-valued\nmonitorability suffers from two inherent limitations. First, a property can\nonly be evaluated as monitorable or non-monitorable; no information is\navailable regarding whether only one verdict (satisfaction or violation) can be\ndetected. Second, monitorability is defined at the language-level and does not\ntell us whether satisfaction or violation can be detected starting from the\ncurrent monitor state during system execution.\n  To address these limitations, this paper proposes a new notion of four-valued\nmonitorability for $\\omega$-languages and applies it at the state-level.\nFour-valued monitorability is more informative than two-valued monitorability\nas a property can be evaluated as a four-valued result, denoting that only\nsatisfaction, only violation, or both are active for a monitorable property. We\ncan also compute state-level weak monitorability, i.e., whether satisfaction or\nviolation can be detected starting from a given state in a monitor, which\nenables state-level optimizations of monitoring algorithms. Based on a new\nsix-valued semantics, we propose procedures for computing four-valued\nmonitorability of $\\omega$-regular languages, both at the language-level and at\nthe state-level. We have developed a new tool that implements the proposed\nprocedure for computing monitorability of LTL formulas.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2020 01:54:27 GMT"}, {"version": "v2", "created": "Tue, 12 May 2020 03:44:09 GMT"}], "update_date": "2020-05-13", "authors_parsed": [["Chen", "Zhe", ""], ["Chen", "Yunyun", ""], ["Hierons", "Robert M.", ""], ["Wu", "Yifan", ""]]}, {"id": "2002.06799", "submitter": "Steven Kommrusch", "authors": "Steve Kommrusch, Th\\'eo Barollet, Louis-No\\\"el Pouchet", "title": "Equivalence of Dataflow Graphs via Rewrite Rules Using a\n  Graph-to-Sequence Neural Model", "comments": "20 pages including references and appendices, 10 figures, updated to\n  include acknowledgement", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.FL stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we target the problem of provably computing the equivalence\nbetween two programs represented as dataflow graphs. To this end, we formalize\nthe problem of equivalence between two programs as finding a set of\nsemantics-preserving rewrite rules from one into the other, such that after the\nrewrite the two programs are structurally identical, and therefore trivially\nequivalent. We then develop the first graph-to-sequence neural network system\nfor program equivalence, trained to produce such rewrite sequences from a\ncarefully crafted automatic example generation algorithm. We extensively\nevaluate our system on a rich multi-type linear algebra expression language,\nusing arbitrary combinations of 100+ graph-rewriting axioms of equivalence. Our\nsystem outputs via inference a correct rewrite sequence for 96% of the 10,000\nprogram pairs isolated for testing, using 30-term programs. And in all cases,\nthe validity of the sequence produced and therefore the provable assertion of\nprogram equivalence is computable, in negligible time.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2020 06:43:00 GMT"}, {"version": "v2", "created": "Thu, 3 Jun 2021 21:40:34 GMT"}], "update_date": "2021-06-07", "authors_parsed": [["Kommrusch", "Steve", ""], ["Barollet", "Théo", ""], ["Pouchet", "Louis-Noël", ""]]}, {"id": "2002.07025", "submitter": "Abhishek Kulkarni", "authors": "Jie Fu, Abhishek N. Kulkarni, Huan Luo, Nandi O. Leslie and Charles A.\n  Kamhoua", "title": "Secure-by-synthesis network with active deception and temporal logic\n  specifications", "comments": "16 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is concerned with the synthesis of strategies in network systems\nwith active cyber deception. Active deception in a network employs decoy\nsystems and other defenses to conduct defensive planning against the intrusion\nof malicious attackers who have been confirmed by sensing systems. In this\nsetting, the defender's objective is to ensure the satisfaction of security\nproperties specified in temporal logic formulas. We formulate the problem of\ndeceptive planning with decoy systems and other defenses as a two-player games\nwith asymmetrical information and Boolean payoffs in temporal logic. We use\nlevel-2 hypergame with temporal logic objectives to capture the\nincomplete/incorrect knowledge of the attacker about the network system as a\npayoff misperception. The true payoff function is private information of the\ndefender. Then, we extend the solution concepts of $omega$-regular games to\nanalyze the attacker's rational strategy given her incomplete information. By\ngeneralizing the solution of level-2 hypergame in the normal form to extensive\nform, we extend the solutions of games with safe temporal logic objectives to\ndecide whether the defender can ensure security properties to be satisfied with\nprobability one, given any possible strategy that is perceived to be rational\nby the attacker. Further, we use the solution of games with co-safe\n(reachability) temporal logic objectives to determine whether the defender can\nengage the attacker, by directing the attacker to a high-fidelity honeypot. The\neffectiveness of the proposed synthesis methods is illustrated with synthetic\nnetwork systems with honeypots.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2020 16:09:42 GMT"}], "update_date": "2020-02-18", "authors_parsed": [["Fu", "Jie", ""], ["Kulkarni", "Abhishek N.", ""], ["Luo", "Huan", ""], ["Leslie", "Nandi O.", ""], ["Kamhoua", "Charles A.", ""]]}, {"id": "2002.07045", "submitter": "Abhishek Kulkarni", "authors": "Abhishek N. Kulkarni and Jie Fu", "title": "Synthesis of Deceptive Strategies in Reachability Games with Action\n  Misperception", "comments": "7 pages, 4 figures, submitted to IJCAI 2020", "journal-ref": null, "doi": "10.24963/ijcai.2020/31", "report-no": null, "categories": "cs.GT cs.FL", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We consider a class of two-player turn-based zero-sum games on graphs with\nreachability objectives, known as reachability games, where the objective of\nPlayer 1 (P1) is to reach a set of goal states, and that of Player 2 (P2) is to\nprevent this. In particular, we consider the case where the players have\nasymmetric information about each other's action capabilities: P2 starts with\nan incomplete information (misperception) about P1's action set, and updates\nthe misperception when P1 uses an action previously unknown to P2. When P1 is\nmade aware of P2's misperception, the key question is whether P1 can control\nP2's perception so as to deceive P2 into selecting actions to P1's advantage?\nWe show that there might exist a deceptive winning strategy for P1 that ensures\nP1's objective is achieved with probability one from a state otherwise losing\nfor P1, had the information being symmetric and complete. We present three key\nresults: First, we introduce a dynamic hypergame model to capture the\nreachability game with evolving misperception of P2. Second, we present a\nfixed-point algorithm to compute the Deceptive Almost-Sure Winning (DASW)\nregion and DASW strategy. Finally, we show that DASW strategy is at least as\npowerful as Almost-Sure Winning (ASW) strategy in the game in which P1 does not\naccount for P2's misperception. We illustrate our algorithm using a robot\nmotion planning in an adversarial environment.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2020 16:37:59 GMT"}], "update_date": "2020-07-16", "authors_parsed": [["Kulkarni", "Abhishek N.", ""], ["Fu", "Jie", ""]]}, {"id": "2002.07049", "submitter": "Filip Mazowiecki Sheriff", "authors": "Alejandro Grez, Filip Mazowiecki, Micha{\\l} Pilipczuk, Gabriele Puppis\n  and Cristian Riveros", "title": "The monitoring problem for timed automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a variant of the classical membership problem in automata theory,\nwhich consists of deciding whether a given input word is accepted by a given\nautomaton. We do so under a different perspective, that is, we consider a\ndynamic version of the problem, called monitoring problem, where the automaton\nis fixed and the input is revealed as in a stream, one symbol at a time\nfollowing the natural order on positions. The goal here is to design a dynamic\ndata structure that can be queried about whether the word consisting of symbols\nrevealed so far is accepted by the automaton, and that can be efficiently\nupdated when the next symbol is revealed. We provide complexity bounds for this\nmonitoring problem, by considering timed automata that process symbols\ninterleaved with timestamps. The main contribution is that monitoring of a\none-clock timed automaton, with all its components but the clock constants\nfixed, can be done in amortised constant time per input symbol.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2020 16:39:47 GMT"}], "update_date": "2020-02-18", "authors_parsed": [["Grez", "Alejandro", ""], ["Mazowiecki", "Filip", ""], ["Pilipczuk", "Michał", ""], ["Puppis", "Gabriele", ""], ["Riveros", "Cristian", ""]]}, {"id": "2002.07256", "submitter": "Jason Bell", "authors": "Jason P. Bell", "title": "The upper density of an automatic set is rational", "comments": "16 pages. This version corrects the proof of Lemma 3.1 in addition to\n  making other changes", "journal-ref": "Journal de Th\\'eorie des Nombres de Bordeaux Vol. 32, No. 2\n  (2020), 585--604", "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a natural number $k\\ge 2$ and a $k$-automatic set $S$ of natural\nnumbers, we show that the lower density and upper density of $S$ are\nrecursively computable rational numbers and we provide an algorithm for\ncomputing these quantities. In addition, we show that for every natural number\n$k\\ge 2$ and every pair of rational numbers $(\\alpha,\\beta)$ with\n$0<\\alpha<\\beta<1$ or with $(\\alpha,\\beta)\\in \\{(0,0),(1,1)\\}$ there is a\n$k$-automatic subset of the natural numbers whose lower density and upper\ndensity are $\\alpha$ and $\\beta$ respectively, and we show that these are\nprecisely the values that can occur as the lower and upper densities of an\nautomatic set.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2020 21:27:45 GMT"}, {"version": "v2", "created": "Mon, 12 Apr 2021 14:28:19 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Bell", "Jason P.", ""]]}, {"id": "2002.07274", "submitter": "Dhananjay Raju", "authors": "Dhananjay Raju, R\\\"udiger Ehlers and Ufuk Topcu", "title": "Playing Against Opponents With Limited Memory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study \\emph{partial-information} two-player turn-based games on graphs\nwith omega-regular objectives, when the partial-information player has\n\\emph{limited memory}. Such games are a natural formalization for reactive\nsynthesis when the environment player is not genuinely adversarial to the\nsystem player. The environment player has goals of its own, but the exact goal\nof the environment player is unknown to the system player. We prove that the\nproblem of determining the existence of a winning strategy for the system\nplayer is PSPACE-hard for reachability, safety, and parity objectives.\nMoreover, when the environment player is memoryless, the problem is\nPSPACE-complete. However, it is simpler to decide if the environment player has\na winning strategy; it is only NP-complete. Additionally, we construct a game\nwhere the the partial-information player needs at least $\\mathcal{O}(\\sqrt{n})$\nbits of memory to retain winning strategies in a game of size $\\mathcal{O}(n)$.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2020 21:58:10 GMT"}], "update_date": "2020-02-19", "authors_parsed": [["Raju", "Dhananjay", ""], ["Ehlers", "Rüdiger", ""], ["Topcu", "Ufuk", ""]]}, {"id": "2002.07278", "submitter": "Denis Kuperberg", "authors": "Udi Boker, Denis Kuperberg, Karoliina Lehtinen, Micha{\\l} Skrzypczak", "title": "On Succinctness and Recognisability of Alternating Good-for-Games\n  Automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study alternating good-for-games (GFG) automata, i.e., alternating\nautomata where both conjunctive and disjunctive choices can be resolved in an\nonline manner, without knowledge of the suffix of the input word still to be\nread. We show that they can be exponentially more succinct than both their\nnondeterministic and universal counterparts. Furthermore, we lift many results\nfrom nondeterministic parity GFG automata to alternating ones: a single\nexponential determinisation procedure, an Exptime upper bound to the GFGness\nproblem, a PTime algorithm for the GFGness problem of weak automata, and a\nreduction from a positive solution to the $G_2$ conjecture to a PTime algorithm\nfor the GFGness problem of parity automata with a fixed index. The $G_2$\nconjecture states that a nondeterministic parity automaton A is GFG if and only\nif a token game, known as the $G_2$ game, played on A is won by the first\nplayer. So far, it had only been proved for B\\\"uchi automata; we provide\nfurther evidence for it by proving it for coB\\\"uchi automata. We also study the\ncomplexity of deciding \"half-GFGness\", a property specific to alternating\nautomata that only requires nondeterministic choices to be resolved in an\nonline manner. We show that this problem is strictly more difficult than\nGFGness check, already for alternating automata on finite words.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2020 22:07:32 GMT"}], "update_date": "2020-02-19", "authors_parsed": [["Boker", "Udi", ""], ["Kuperberg", "Denis", ""], ["Lehtinen", "Karoliina", ""], ["Skrzypczak", "Michał", ""]]}, {"id": "2002.07545", "submitter": "EPTCS", "authors": "B\\'eatrice B\\'erard (Sorbonne Universit\\'e, CNRS, LIP6, Paris,\n  France), Benedikt Bollig (CNRS & LSV, ENS Paris-Saclay, Universit\\'e\n  Paris-Saclay, France), Patricia Bouyer (CNRS & LSV, ENS Paris-Saclay,\n  Universit\\'e Paris-Saclay, France), Matthias F\\\"ugger (CNRS & LSV, ENS\n  Paris-Saclay, Universit\\'e Paris-Saclay, Inria, France), Nathalie Sznajder\n  (Sorbonne Universit\\'e, CNRS, LIP6, Paris, France)", "title": "Synthesis in Presence of Dynamic Links", "comments": "In Proceedings GandALF 2020, arXiv:2009.09360", "journal-ref": "EPTCS 326, 2020, pp. 33-49", "doi": "10.4204/EPTCS.326.3", "report-no": null, "categories": "cs.FL cs.DC cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of distributed synthesis is to automatically generate a\ndistributed algorithm, given a target communication network and a specification\nof the algorithm's correct behavior.\n  Previous work has focused on static networks with an a priori fixed message\nsize. This approach has two shortcomings: Recent work in distributed computing\nis shifting towards dynamically changing communication networks rather than\nstatic ones, and an important class of distributed algorithms are so-called\nfull-information protocols, where nodes piggy-pack previously received messages\nonto current messages.\n  In this work, we consider the synthesis problem for a system of two nodes\ncommunicating in rounds over a dynamic link whose message size is not bounded.\nGiven a network model, i.e., a set of link directions, in each round of the\nexecution, the adversary choses a link from the network model, restricted only\nby the specification, and delivers messages according to the current link's\ndirections. Motivated by communication buses with direct acknowledge\nmechanisms, we further assume that nodes are aware of which messages have been\ndelivered.\n  We show that the synthesis problem is decidable for a network model if and\nonly if it does not contain the empty link that dismisses both nodes' messages.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 13:21:24 GMT"}, {"version": "v2", "created": "Wed, 23 Sep 2020 01:24:22 GMT"}], "update_date": "2020-09-24", "authors_parsed": [["Bérard", "Béatrice", "", "Sorbonne Université, CNRS, LIP6, Paris,\n  France"], ["Bollig", "Benedikt", "", "CNRS & LSV, ENS Paris-Saclay, Université\n  Paris-Saclay, France"], ["Bouyer", "Patricia", "", "CNRS & LSV, ENS Paris-Saclay,\n  Université Paris-Saclay, France"], ["Függer", "Matthias", "", "CNRS & LSV, ENS\n  Paris-Saclay, Université Paris-Saclay, Inria, France"], ["Sznajder", "Nathalie", "", "Sorbonne Université, CNRS, LIP6, Paris, France"]]}, {"id": "2002.07558", "submitter": "Denis Kuperberg", "authors": "Denis Kuperberg, Jan Martens", "title": "Regular resynchronizability of origin transducers is undecidable", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study the relation of containment up to unknown regular resynchronization\nbetween two-way non-deterministic transducers. We show that it constitutes a\npreorder, and that the corresponding equivalence relation is properly\nintermediate between origin equivalence and classical equivalence. We give a\nsyntactical characterization for containment of two transducers up to\nresynchronization, and use it to show that this containment relation is\nundecidable already for one-way non-deterministic transducers, and for simple\nclasses of resynchronizations. This answers the open problem stated in recent\nworks, asking whether this relation is decidable for two-way non-deterministic\ntransducers.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 13:51:49 GMT"}, {"version": "v2", "created": "Mon, 4 May 2020 19:07:04 GMT"}, {"version": "v3", "created": "Wed, 1 Jul 2020 14:13:19 GMT"}], "update_date": "2020-07-02", "authors_parsed": [["Kuperberg", "Denis", ""], ["Martens", "Jan", ""]]}, {"id": "2002.07562", "submitter": "Rance Cleaveland", "authors": "Rance Cleaveland", "title": "Better Automata through Process Algebra", "comments": "17 pages 3 figures, submitted to Logical Methods in Computer Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper shows how the use of Structural Operational Semantics (SOS) in the\nstyle popularized by the process-algebra community can lead to a more succinct\nand useful construction for building finite automata from regular expressions.\nSuch constructions have been known for decades, and form the basis for the\nproofs of one direction of Kleene's Theorem. The purpose of the new\nconstruction is, on the one hand, to show students how small automata can be\nconstructed, without the need for empty transitions, and on the other hand to\nshow how the construction method admits closure proofs of regular languages\nwith respect to other operators as well. These results, while not theoretically\nsurprising, point to an additional influence of process-algebraic research: in\naddition to providing fundamental insights into the nature of concurrent\ncomputation, it also sheds new light on old, well-known constructions in\nautomata theory.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 13:53:40 GMT"}], "update_date": "2020-02-19", "authors_parsed": [["Cleaveland", "Rance", ""]]}, {"id": "2002.07574", "submitter": "Alan Logan", "authors": "Laura Ciobanu, Alan D. Logan", "title": "The Post Correspondence Problem and equalisers for certain free group\n  and monoid morphisms", "comments": "16 pages, final version incorporating referees comments", "journal-ref": "47th International Colloquium on Automata, Languages, and\n  Programming (ICALP 2020), volume 168, pp. 120:1-120:16", "doi": "10.4230/LIPIcs.ICALP.2020.120", "report-no": null, "categories": "math.GR cs.DM cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A marked free monoid morphism is a morphism for which the image of each\ngenerator starts with a different letter, and immersions are the analogous maps\nin free groups. We show that the (simultaneous) PCP is decidable for immersions\nof free groups, and provide an algorithm to compute bases for the sets, called\nequalisers, on which the immersions take the same values. We also answer a\nquestion of Stallings about the rank of the equaliser.\n  Analogous results are proven for marked morphisms of free monoids.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 14:17:21 GMT"}, {"version": "v2", "created": "Thu, 10 Sep 2020 15:22:18 GMT"}], "update_date": "2020-09-11", "authors_parsed": [["Ciobanu", "Laura", ""], ["Logan", "Alan D.", ""]]}, {"id": "2002.07659", "submitter": "Jan Studen\\'y", "authors": "Yi-Jun Chang, Jan Studen\\'y, Jukka Suomela", "title": "Distributed graph problems through an automata-theoretic lens", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The locality of a graph problem is the smallest distance $T$ such that each\nnode can choose its own part of the solution based on its radius-$T$\nneighborhood. In many settings, a graph problem can be solved efficiently with\na distributed or parallel algorithm if and only if it has a small locality.\n  In this work we seek to automate the study of solvability and locality: given\nthe description of a graph problem $\\Pi$, we would like to determine if $\\Pi$\nis solvable and what is the asymptotic locality of $\\Pi$ as a function of the\nsize of the graph. Put otherwise, we seek to automatically synthesize efficient\ndistributed and parallel algorithms for solving $\\Pi$.\n  We focus on locally checkable graph problems; these are problems in which a\nsolution is globally feasible if it looks feasible in all constant-radius\nneighborhoods. Prior work on such problems has brought primarily bad news:\nquestions related to locality are undecidable in general, and even if we focus\non the case of labeled paths and cycles, determining locality is\n$\\mathsf{PSPACE}$-hard (Balliu et al., PODC 2019).\n  We complement prior negative results with efficient algorithms for the cases\nof unlabeled paths and cycles and, as an extension, for rooted trees. We\nintroduce a new automata-theoretic perspective for studying locally checkable\ngraph problems. We represent a locally checkable problem $\\Pi$ as a\nnondeterministic finite automaton $\\mathcal{M}$ over a unary alphabet. We\nidentify polynomial-time-computable properties of the automaton $\\mathcal{M}$\nthat near-completely capture the solvability and locality of $\\Pi$ in cycles\nand paths, with the exception of one specific case that is\n$\\mbox{co-$\\mathsf{NP}$}$-complete.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 15:47:08 GMT"}, {"version": "v2", "created": "Wed, 9 Sep 2020 19:06:38 GMT"}], "update_date": "2020-09-11", "authors_parsed": [["Chang", "Yi-Jun", ""], ["Studený", "Jan", ""], ["Suomela", "Jukka", ""]]}, {"id": "2002.07660", "submitter": "Paul Bell", "authors": "Paul C. Bell and Pavel Semukhin", "title": "Decidability of cutpoint isolation for probabilistic finite automata on\n  letter-bounded inputs", "comments": "17 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show the surprising result that the cutpoint isolation problem is\ndecidable for Probabilistic Finite Automata (PFA) where input words are taken\nfrom a letter-bounded context-free language. A context-free language\n$\\mathcal{L}$ is letter-bounded when $\\mathcal{L} \\subseteq a_1^*a_2^* \\cdots\na_\\ell^*$ for some finite $\\ell > 0$ where each letter is distinct. A cutpoint\nis isolated when it cannot be approached arbitrarily closely. The decidability\nof this problem is in marked contrast to the situation for the (strict)\nemptiness problem for PFA which is undecidable under the even more severe\nrestrictions of PFA with polynomial ambiguity, commutative matrices and input\nover a letter-bounded language as well as to the injectivity problem which is\nundecidable for PFA over letter-bounded languages. We provide a constructive\nnondeterministic algorithm to solve the cutpoint isolation problem, which holds\neven when the PFA is exponentially ambiguous. We also show that the problem is\nat least NP-hard and use our decision procedure to solve several related\nproblems.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 15:47:14 GMT"}, {"version": "v2", "created": "Thu, 14 May 2020 09:58:42 GMT"}], "update_date": "2020-05-15", "authors_parsed": [["Bell", "Paul C.", ""], ["Semukhin", "Pavel", ""]]}, {"id": "2002.08203", "submitter": "L\\'eo Exibard", "authors": "L\\'eo Exibard, Emmanuel Filiot, Pierre-Alain Reynier", "title": "On Computability of Data Word Functions Defined by Transducers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, we investigate the problem of synthesizing computable\nfunctions of infinite words over an infinite alphabet (data omega-words). The\nnotion of computability is defined through Turing machines with infinite inputs\nwhich can produce the corresponding infinite outputs in the limit. We use\nnon-deterministic transducers equipped with registers, an extension of register\nautomata with outputs, to specify functions. Such transducers may not define\nfunctions but more generally relations of data omega-words, and we show that it\nis PSpace-complete to test whether a given transducer defines a function. Then,\ngiven a function defined by some register transducer, we show that it is\ndecidable (and again, PSpace-complete) whether such function is computable. As\nfor the known finite alphabet case, we show that computability and continuity\ncoincide for functions defined by register transducers, and show how to decide\ncontinuity. We also define a subclass for which those problems are solvable in\npolynomial time.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2020 14:17:24 GMT"}], "update_date": "2020-02-20", "authors_parsed": [["Exibard", "Léo", ""], ["Filiot", "Emmanuel", ""], ["Reynier", "Pierre-Alain", ""]]}, {"id": "2002.08236", "submitter": "Florian Lehner", "authors": "Florian Lehner and Christian Lindorfer", "title": "Comparing consecutive letter counts in multiple context-free languages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Context-free grammars are not able to model cross-serial dependencies in\nnatural languages. To overcome this issue, Seki et al. introduced a\ngeneralization called $m$-multiple context-free grammars ($m$-MCFGs), which\ndeal with $m$-tuples of strings. We show that $m$-MCFGs are capable of\ncomparing the number of consecutive occurrences of at most $2m$ different\nletters. In particular, the language $\\{a_1^{n_1} a_2^{n_2} \\dots\na_{k}^{n_{2m+1}} \\mid n_1 \\geq n_2 \\geq \\dots \\geq n_{2m+1} \\geq 0\\}$ is\n$(m+1)$-multiple context-free, but not $m$-multiple context-free.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2020 15:26:53 GMT"}, {"version": "v2", "created": "Mon, 23 Nov 2020 09:14:14 GMT"}, {"version": "v3", "created": "Tue, 16 Mar 2021 14:43:02 GMT"}], "update_date": "2021-03-17", "authors_parsed": [["Lehner", "Florian", ""], ["Lindorfer", "Christian", ""]]}, {"id": "2002.08630", "submitter": "Filip Mazowiecki Sheriff", "authors": "Micha\\\"el Cadilhac, Filip Mazowiecki, Charles Paperman, Micha{\\l}\n  Pilipczuk and G\\'eraud S\\'enizergues", "title": "On polynomial recursive sequences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the expressive power of polynomial recursive sequences, a nonlinear\nextension of the well-known class of linear recursive sequences. These\nsequences arise naturally in the study of nonlinear extensions of weighted\nautomata, where (non)expressiveness results translate to class separations. A\ntypical example of a polynomial recursive sequence is b_n=n!. Our main result\nis that the sequence u_n=n^n is not polynomial recursive.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 09:12:29 GMT"}], "update_date": "2020-02-21", "authors_parsed": [["Cadilhac", "Michaël", ""], ["Mazowiecki", "Filip", ""], ["Paperman", "Charles", ""], ["Pilipczuk", "Michał", ""], ["Sénizergues", "Géraud", ""]]}, {"id": "2002.08633", "submitter": "Abhranil Chatterjee", "authors": "V. Arvind and Abhranil Chatterjee and Rajit Datta and Partha\n  Mukhopadhyay", "title": "Equivalence Testing of Weighted Automata over Partially Commutative\n  Monoids", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We study \\emph{multiplicity equivalence} testing of automata over partially\ncommutative monoids (pc monoids) and show efficient algorithms in special\ncases, exploiting the structure of the underlying non-commutation graph of the\nmonoid.\n  Specifically, if the clique cover number of the non-commutation graph (the\nminimum number of cliques covering the graph) of the pc monoid is a constant,\nwe obtain a deterministic quasi-polynomial time algorithm. As a consequence, we\nalso obtain the first deterministic quasi-polynomial time algorithms for\nmultiplicity equivalence testing of $k$-tape automata and for equivalence\ntesting of deterministic $k$-tape automata for constant $k$. Prior to this, a\nrandomized polynomial-time algorithm for the above problems was shown by\nWorrell [ICALP 2013].\n  We also consider pc monoids for which the non-commutation graphs have cover\nconsisting of at most $k$ cliques and star graphs for any constant $k$. We\nobtain randomized polynomial-time algorithm for multiplicity equivalence\ntesting of automata over such monoids.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 09:27:09 GMT"}, {"version": "v2", "created": "Sun, 31 May 2020 14:34:54 GMT"}], "update_date": "2020-06-02", "authors_parsed": [["Arvind", "V.", ""], ["Chatterjee", "Abhranil", ""], ["Datta", "Rajit", ""], ["Mukhopadhyay", "Partha", ""]]}, {"id": "2002.08646", "submitter": "Christian Herrera", "authors": "Christian Herrera", "title": "From Stateless to Stateful Priorities: Technical Report", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the notion of stateful priorities for imposing precise\nrestrictions on system actions, in order to meet safety constraints. By using\nstateful priorities we are able to exclusively restrict erroneous system\nbehavior as specified by the constraint, whereas safe system behavior remains\nunrestricted. Given a system modeled as a network of discrete automata and an\nerror constraint, we present algorithms which use those inputs to synthesize\nstateful priorities. We present as well a network transformation which uses\nsynthesized priorities for blocking all system actions leading to the input\nerror. Our experiments with three real-world examples demonstrate the\napplicability of our approach.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 10:03:34 GMT"}], "update_date": "2020-02-21", "authors_parsed": [["Herrera", "Christian", ""]]}, {"id": "2002.08754", "submitter": "Ramon Janssen", "authors": "Ramon Janssen", "title": "Combining Partial Specifications using Alternating Interface Automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To model real-world software systems, modelling paradigms should support a\nform of compositionality. In interface theory and model-based testing with\ninputs and outputs, conjunctive operators have been introduced: the behaviour\nallowed by composed specification s1 $\\wedge$ s2 is the behaviour allowed by\nboth partial models s1 and s2. The models at hand are non-deterministic\ninterface automata, but the interaction between non-determinism and conjunction\nis not yet well understood. On the other hand, in the theory of alternating\nautomata, conjunction and non-determinism are core aspects. Alternating\nautomata have not been considered in the context of inputs and outputs, making\nthem less suitable for modelling software interfaces. In this paper, we combine\nthe two modelling paradigms to define alternating interface automata (AIA). We\nequip these automata with an observational, trace-based semantics, and define\ntesters, to establish correctness of black-box interfaces with respect to an\nAIA specification.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 14:34:23 GMT"}], "update_date": "2020-02-21", "authors_parsed": [["Janssen", "Ramon", ""]]}, {"id": "2002.08828", "submitter": "Johannes Doleschal", "authors": "Johannes Doleschal, Noa Bratman, Benny Kimelfeld, Wim Martens", "title": "The Complexity of Aggregates over Extractions by Regular Expressions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regular expressions with capture variables, also known as \"regex formulas,\"\nextract relations of spans (intervals identified by their start and end\nindices) from text. Based on these Fagin et al. introduced regular document\nspanners which are the closure of regex formulas under Relational Algebra. In\nthis work, we study the computational complexity of querying text by aggregate\nfunctions, like sum, average or quantiles, on top of regular document spanners.\nTo this end, we formally define aggregate functions over regular document\nspanners and analyze the computational complexity of exact and approximative\ncomputation of the aggregates. To be precise, we show that in a restricted case\nall aggregates can be computed in polynomial time. In general, however, even\nthough exact computation is intractable, some aggregates can still be\napproximated with fully polynomial-time randomized approximation schemes\n(FPRAS).\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 16:07:18 GMT"}, {"version": "v2", "created": "Thu, 9 Apr 2020 13:21:38 GMT"}], "update_date": "2020-04-10", "authors_parsed": [["Doleschal", "Johannes", ""], ["Bratman", "Noa", ""], ["Kimelfeld", "Benny", ""], ["Martens", "Wim", ""]]}, {"id": "2002.09307", "submitter": "Amina Doumane", "authors": "Miko{\\l}aj Boja\\'nczyk and Amina Doumane", "title": "First-order tree-to-tree functions", "comments": "43 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  We study tree-to-tree transformations that can be defined in first-order\nlogic or monadic second-order logic. We prove a decomposition theorem, which\nshows that every transformation can be obtained from prime transformations,\nsuch as tree-to-tree homomorphisms or pre-order traversal, by using combinators\nsuch as function composition.\n", "versions": [{"version": "v1", "created": "Fri, 21 Feb 2020 14:02:21 GMT"}], "update_date": "2020-02-24", "authors_parsed": [["Bojańczyk", "Mikołaj", ""], ["Doumane", "Amina", ""]]}, {"id": "2002.09393", "submitter": "Georg Zetzsche", "authors": "Miko{\\l}aj Boja\\'nczyk, Edon Kelmendi, Rafa{\\l} Stefa\\'nski, and Georg\n  Zetzsche", "title": "Extensions of $\\omega$-Regular Languages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We consider extensions of monadic second order logic over $\\omega$-words,\nwhich are obtained by adding one language that is not $\\omega$-regular. We show\nthat if the added language $L$ has a neutral letter, then the resulting logic\nis necessarily undecidable. A corollary is that the $\\omega$-regular languages\nare the only decidable Boolean-closed full trio over $\\omega$-words.\n", "versions": [{"version": "v1", "created": "Fri, 21 Feb 2020 16:22:24 GMT"}], "update_date": "2020-02-24", "authors_parsed": [["Bojańczyk", "Mikołaj", ""], ["Kelmendi", "Edon", ""], ["Stefański", "Rafał", ""], ["Zetzsche", "Georg", ""]]}, {"id": "2002.09509", "submitter": "Jakub Byszewski", "authors": "Jakub Byszewski and Jakub Konieczny and Clemens M\\\"ullner", "title": "Gowers norms for automatic sequences", "comments": "51 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.FL math.CO math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that any automatic sequence can be separated into a structured part\nand a Gowers uniform part in a way that is considerably more efficient than\nguaranteed by the Arithmetic Regularity Lemma. For sequences produced by\nstrongly connected and prolongable automata, the structured part is rationally\nalmost periodic, while for general sequences the description is marginally more\ncomplicated. In particular, we show that all automatic sequences orthogonal to\nperiodic sequences are Gowers uniform. As an application, we obtain for any $l\n\\geq 2$ and any automatic set $A \\subset \\mathbb{N}_0$ lower bounds on the\nnumber of $l$-term arithmetic progressions - contained in $A$ - with a given\ndifference. The analogous result is false for general subsets of $\\mathbb{N}_0$\nand progressions of length $\\geq 5$.\n", "versions": [{"version": "v1", "created": "Fri, 21 Feb 2020 19:11:17 GMT"}, {"version": "v2", "created": "Fri, 14 May 2021 15:32:09 GMT"}], "update_date": "2021-05-17", "authors_parsed": [["Byszewski", "Jakub", ""], ["Konieczny", "Jakub", ""], ["Müllner", "Clemens", ""]]}, {"id": "2002.09877", "submitter": "Sarai Sheinvald", "authors": "Borzoo Bonakdarpour and Sarai Sheinvald", "title": "Automata for Hyperlanguages", "comments": "12 pages of main paper and another 10 pages appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Hyperproperties lift conventional trace properties from a set of execution\ntraces to a set of sets of execution traces. Hyperproperties have been shown to\nbe a powerful formalism for expressing and reasoning about information-flow\nsecurity policies and important properties of cyber-physical systems such as\nsensitivity and robustness, as well as consistency conditions in distributed\ncomputing such as linearizability. Although there is an extensive body of work\non automata-based representation of trace properties, we currently lack such\ncharacterization for hyperproperties. We introduce hyperautomata for em\nhyperlanguages, which are languages over sets of words. Essentially,\nhyperautomata allow running multiple quantified words over an automaton. We\npropose a specific type of hyperautomata called nondeterministic finite\nhyperautomata (NFH), which accept regular hyperlanguages. We demonstrate the\nability of regular hyperlanguages to express hyperproperties for finite traces.\nWe then explore the fundamental properties of NFH and show their closure under\nthe Boolean operations. We show that while nonemptiness is undecidable in\ngeneral, it is decidable for several fragments of NFH. We further show the\ndecidability of the membership problem for finite sets and regular languages\nfor NFH, as well as the containment problem for several fragments of NFH.\nFinally, we introduce learning algorithms based on Angluin's L-star algorithm\nfor the fragments NFH in which the quantification is either strictly universal\nor strictly existential.\n", "versions": [{"version": "v1", "created": "Sun, 23 Feb 2020 09:52:20 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Bonakdarpour", "Borzoo", ""], ["Sheinvald", "Sarai", ""]]}, {"id": "2002.09942", "submitter": "Olivier Serre", "authors": "Arnaud Carayol and Olivier Serre", "title": "How Good Is a Strategy in a Game With Nature?", "comments": null, "journal-ref": "ACM Transactions on Computational Logic, Vol. 21, No 3, Article\n  21, pp. 1-39, February 2020", "doi": "10.1145/3377137", "report-no": null, "categories": "cs.FL cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider games with two antagonistic players --- \\'Elo\\\"ise (modelling a\nprogram) and Ab\\'elard (modelling a byzantine environment) --- and a third,\nunpredictable and uncontrollable player, that we call Nature. Motivated by the\nfact that the usual probabilistic semantics very quickly leads to\nundecidability when considering either infinite game graphs or\nimperfect-information, we propose two alternative semantics that leads to\ndecidability where the probabilistic one fails: one based on counting and one\nbased on topology.\n", "versions": [{"version": "v1", "created": "Sun, 23 Feb 2020 17:18:16 GMT"}], "update_date": "2020-10-14", "authors_parsed": [["Carayol", "Arnaud", ""], ["Serre", "Olivier", ""]]}, {"id": "2002.10303", "submitter": "Giovanna D'Agostino", "authors": "Jarno Alanko and Giovanna D'Agostino and Alberto Policriti and Nicola\n  Prezza", "title": "Wheeler Languages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recently introduced class of Wheeler graphs, inspired by the\nBurrows-Wheeler Transform (BWT) of a given string, admits an efficient index\ndata structure for searching for subpaths with a given path label, and lifts\nthe applicability of the Burrows-Wheeler transform from strings to languages.\nIn this paper we study the regular languages accepted by automata having a\nWheeler graph as transition function, and prove results on determination,\nMyhill_Nerode characterization, decidability, and closure properties for this\nclass of languages.\n", "versions": [{"version": "v1", "created": "Mon, 24 Feb 2020 15:20:33 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Alanko", "Jarno", ""], ["D'Agostino", "Giovanna", ""], ["Policriti", "Alberto", ""], ["Prezza", "Nicola", ""]]}, {"id": "2002.10783", "submitter": "Marco Muniz", "authors": "Anne Ejsing, Martin Jensen, Marco Mu\\~niz, Jacob N{\\o}rhave, and Lars\n  Rechter", "title": "Near Optimal Task Graph Scheduling with Priced Timed Automata and Priced\n  Timed Markov Decision Processes", "comments": "Technical report for near optimal task graph scheduling using Uppaal\n  Cora and Uppaal Stratego", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Task graph scheduling is a relevant problem in computer science with\napplication to diverse real world domains. Task graph scheduling suffers from a\ncombinatorial explosion and thus finding optimal schedulers is a difficult\ntask.\n  In this paper we present a methodology for computing near-optimal preemptive\nand non-preemptive schedulers for task graphs. The task graph scheduling\nproblem is reduced to location reachability via the fastest path in Priced\nTimed Automata (PTA) and Priced Timed Markov Decision Processes (PTMDP).\nAdditionally, we explore the effect of using chains to reduce the computation\ntime for finding schedules.\n  We have implemented our models in UPPAAL CORA and UPPAAL STRATEGO. We conduct\nan exhaustive experimental evaluation where we compare our resulting schedules\nwith the best-known schedules of a state of the art tool. A significant number\nof our resulting schedules are shown to be shorter than or equal to the\nbest-known schedules.\n", "versions": [{"version": "v1", "created": "Tue, 25 Feb 2020 10:37:22 GMT"}], "update_date": "2020-02-26", "authors_parsed": [["Ejsing", "Anne", ""], ["Jensen", "Martin", ""], ["Muñiz", "Marco", ""], ["Nørhave", "Jacob", ""], ["Rechter", "Lars", ""]]}, {"id": "2002.11510", "submitter": "Amar Isli", "authors": "Amar Isli", "title": "Buchi automata augmented with spatial constraints: simulating an\n  alternating with a nondeterministic and deciding the emptiness problem for\n  the latter", "comments": "See footnote 1 on the first page of the paper. arXiv admin note:\n  substantial text overlap with arXiv:cs/0307040", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of this work is to thoroughly investigate Buchi automata augmented\nwith spatial constraints. The input trees of such an automaton are infinite\nk-ary Sigma-trees, with the nodes standing for time points, and Sigma\nincluding, additionally to its uses in classical k-ary Sigma-trees, the\ndescription of the snapshot of an n-object spatial scene of interest. The\nconstraints, from an RCC8-like spatial Relation Algebra (RA) x, are used to\nimpose spatial constraints on objects of the spatial scene, eventually at\ndifferent nodes of the input trees. We show that a Buchi alternating automaton\naugmented with spatial constraints can be simulated with a classical Buchi\nnondeterministic automaton of the same type, augmented with spatial\nconstraints. We then provide a nondeterministic doubly depth-first polynomial\nspace algorithm for the emptiness problem of the latter automaton. Our main\nmotivation came from another work, also submitted to this conference, which\ndefines a spatio-temporalisation of the well-known family ALC(D) of description\nlogics with a concrete domain: together, the two works provide an effective\nsolution to the satisfiability problem of a concept of the\nspatio-temporalisation with respect to a weakly cyclic TBox.\n", "versions": [{"version": "v1", "created": "Sat, 22 Feb 2020 16:25:29 GMT"}], "update_date": "2020-02-27", "authors_parsed": [["Isli", "Amar", ""]]}, {"id": "2002.12760", "submitter": "Amar Isli", "authors": "Amar Isli", "title": "A spatio-temporalisation of ALC(D) and its translation into alternating\n  automata augmented with spatial constraints", "comments": "See footnote 1 on the first page of the paper. arXiv admin note:\n  substantial text overlap with arXiv:cs/0307040 and text overlap with\n  arXiv:2002.11510", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of this work is to provide a family of qualitative theories for\nspatial change in general, and for motion of spatial scenes in particular. To\nachieve this, we consider a spatio-temporalisation MTALC(Dx), of the well-known\nALC(D) family of Description Logics (DLs) with a concrete domain: the MTALC(Dx)\nconcepts are interpreted over infinite k-ary Sigma-trees, with the nodes\nstanding for time points, and Sigma including, additionally to its uses in\nclassical k-ary Sigma-trees, the description of the snapshot of an n-object\nspatial scene of interest; the roles split into m+n immediate-successor\n(accessibility) relations, which are serial, irreflexive and antisymmetric, and\nof which m are general, not necessarily functional, the other n functional; the\nconcrete domain Dx is generated by an RCC8-like spatial Relation Algebra (RA)\nx, and is used to guide the change by imposing spatial constraints on objects\nof the \"followed\" spatial scene, eventually at different time points of the\ninput trees. In order to capture the expressiveness of most modal temporal\nlogics encountered in the literature, we introduce weakly cyclic Terminological\nBoxes (TBoxes) of MTALC(Dx), whose axioms capture the decreasing property of\nmodal temporal operators. We show the important result that satisfiability of\nan MTALC(Dx) concept with respect to a weakly cyclic TBox can be reduced to the\nemptiness problem of a Buchi weak alternating automaton augmented with spatial\nconstraints. In another work, complementary to this one, also submitted to this\nconference, we thoroughly investigate Buchi automata augmented with spatial\nconstraints, and provide, in particular, a translation of an alternating into a\nnondeterministic, and an effective decision procedure for the emptiness problem\nof the latter.\n", "versions": [{"version": "v1", "created": "Sat, 22 Feb 2020 17:20:16 GMT"}], "update_date": "2020-03-02", "authors_parsed": [["Isli", "Amar", ""]]}]