[{"id": "0705.0043", "submitter": "Christian Goulding", "authors": "Savas Dayanik, Christian Goulding, H. Vincent Poor", "title": "Joint Detection and Identification of an Unobservable Change in the\n  Distribution of a Random Sequence", "comments": "Appeared in the Proceedings of the 41st Annual Conference on\n  Information Sciences and Systems, John Hopkins University, March 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  This paper examines the joint problem of detection and identification of a\nsudden and unobservable change in the probability distribution function (pdf)\nof a sequence of independent and identically distributed (i.i.d.) random\nvariables to one of finitely many alternative pdf's. The objective is quick\ndetection of the change and accurate inference of the ensuing pdf. Following a\nBayesian approach, a new sequential decision strategy for this problem is\nrevealed and is proven optimal. Geometrical properties of this strategy are\ndemonstrated via numerical examples.\n", "versions": [{"version": "v1", "created": "Mon, 30 Apr 2007 23:59:09 GMT"}], "update_date": "2009-04-16", "authors_parsed": [["Dayanik", "Savas", ""], ["Goulding", "Christian", ""], ["Poor", "H. Vincent", ""]]}, {"id": "0705.0044", "submitter": "Shashi Kiran Chilappagari", "authors": "Shashi Kiran Chilappagari and Bane Vasic", "title": "Reliable Memories Built from Unreliable Components Based on Expander\n  Graphs", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper, memories built from components subject to transient faults are\nconsidered. A fault-tolerant memory architecture based on low-density\nparity-check codes is proposed and the existence of reliable memories for the\nadversarial failure model is proved. The proof relies on the expansion property\nof the underlying Tanner graph of the code. An equivalence between the\nTaylor-Kuznetsov (TK) scheme and Gallager B algorithm is established and the\nresults are extended to the independent failure model. It is also shown that\nthe proposed memory architecture has lower redundancy compared to the TK\nscheme. The results are illustrated with specific numerical examples.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2007 00:07:46 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Chilappagari", "Shashi Kiran", ""], ["Vasic", "Bane", ""]]}, {"id": "0705.0081", "submitter": "Yeow Meng Chee", "authors": "Yeow Meng Chee, San Ling", "title": "Constructions of q-Ary Constant-Weight Codes", "comments": "12 pages", "journal-ref": "IEEE Transactions on Information Theory, Vol. 53, No. 1, January\n  2007, pp. 135-146", "doi": "10.1109/TIT.2006.887499", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  This paper introduces a new combinatorial construction for q-ary\nconstant-weight codes which yields several families of optimal codes and\nasymptotically optimal codes. The construction reveals intimate connection\nbetween q-ary constant-weight codes and sets of pairwise disjoint combinatorial\ndesigns of various types.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2007 07:16:43 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Chee", "Yeow Meng", ""], ["Ling", "San", ""]]}, {"id": "0705.0085", "submitter": "{\\O}yvind Ytrehus", "authors": "Angela I. Barbero Diez and Oyvind Ytrehus", "title": "An efficient centralized binary multicast network coding algorithm for\n  any cyclic network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  We give an algorithm for finding network encoding and decoding equations for\nerror-free multicasting networks with multiple sources and sinks. The algorithm\ngiven is efficient (polynomial complexity) and works on any kind of network\n(acyclic, link cyclic, flow cyclic, or even in the presence of knots). The key\nidea will be the appropriate use of the delay (both natural and additional)\nduring the encoding. The resulting code will always work with finite delay with\nbinary encoding coefficients.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2007 08:03:18 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Diez", "Angela I. Barbero", ""], ["Ytrehus", "Oyvind", ""]]}, {"id": "0705.0123", "submitter": "Mustafa Cenk Gursoy", "authors": "Mustafa Cenk Gursoy", "title": "An Energy Efficiency Perspective on Training for Fading Channels", "comments": "To appear in the Proc. of the 2007 IEEE International Symposium on\n  Information Theory", "journal-ref": null, "doi": "10.1109/ISIT.2007.4557387", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper, the bit energy requirements of training-based transmission\nover block Rayleigh fading channels are studied. Pilot signals are employed to\nobtain the minimum mean-square-error (MMSE) estimate of the channel fading\ncoefficients. Energy efficiency is analyzed in the worst case scenario where\nthe channel estimate is assumed to be perfect and the error in the estimate is\nconsidered as another source of additive Gaussian noise. It is shown that bit\nenergy requirement grows without bound as the snr goes to zero, and the minimum\nbit energy is achieved at a nonzero snr value below which one should not\noperate. The effect of the block length on both the minimum bit energy and the\nsnr value at which the minimum is achieved is investigated. Flash training\nschemes are analyzed and shown to improve the energy efficiency in the low-snr\nregime. Energy efficiency analysis is also carried out when peak power\nconstraints are imposed on pilot signals.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2007 15:27:41 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Gursoy", "Mustafa Cenk", ""]]}, {"id": "0705.0124", "submitter": "Mustafa Cenk Gursoy", "authors": "Mustafa Cenk Gursoy", "title": "On the Low-SNR Capacity of Phase-Shift Keying with Hard-Decision\n  Detection", "comments": "To appear in the Proc. of the 2007 IEEE International Symposium on\n  Information Theory", "journal-ref": null, "doi": "10.1109/ISIT.2007.4557221", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  The low-snr capacity of M-ary PSK transmission over both the additive white\nGaussian noise (AWGN) and fading channels is analyzed when hard-decision\ndetection is employed at the receiver. Closed-form expressions for the first\nand second derivatives of the capacity at zero snr are obtained. The\nspectral-efficiency/bit-energy tradeoff in the low-snr regime is analyzed by\nfinding the wideband slope and the bit energy required at zero spectral\nefficiency. Practical design guidelines are drawn from the\ninformation-theoretic analysis. The fading channel analysis is conducted for\nboth coherent and noncoherent cases, and the performance penalty in the\nlow-power regime for not knowing the channel is identified.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2007 15:38:30 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Gursoy", "Mustafa Cenk", ""]]}, {"id": "0705.0128", "submitter": "Mustafa Cenk Gursoy", "authors": "Sami Akin, Mustafa Cenk Gursoy", "title": "Training Optimization for Gauss-Markov Rayleigh Fading Channels", "comments": "To appear in the Proc. of the 2007 IEEE International Conference on\n  Communications", "journal-ref": null, "doi": "10.1109/ICC.2007.994", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper, pilot-assisted transmission over Gauss-Markov Rayleigh fading\nchannels is considered. A simple scenario, where a single pilot signal is\ntransmitted every T symbols and T-1 data symbols are transmitted in between the\npilots, is studied. First, it is assumed that binary phase-shift keying (BPSK)\nmodulation is employed at the transmitter. With this assumption, the training\nperiod, and data and training power allocation are jointly optimized by\nmaximizing an achievable rate expression. Achievable rates and energy-per-bit\nrequirements are computed using the optimal training parameters. Secondly, a\ncapacity lower bound is obtained by considering the error in the estimate as\nanother source of additive Gaussian noise, and the training parameters are\noptimized by maximizing this lower bound.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2007 16:04:39 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Akin", "Sami", ""], ["Gursoy", "Mustafa Cenk", ""]]}, {"id": "0705.0130", "submitter": "Mustafa Cenk Gursoy", "authors": "Qingyun Wang, Mustafa Cenk Gursoy", "title": "Performance Analysis for Multichannel Reception of OOFSK Signaling", "comments": "Proc. of the 2007 IEEE Wireless Communications and Networking\n  Conference", "journal-ref": null, "doi": "10.1109/WCNC.2007.444", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper, the error performance of on-off frequency shift keying (OOFSK)\nmodulation over fading channels is analyzed when the receiver is equipped with\nmultiple antennas. The analysis is conducted in two cases: the coherent\nscenario where the fading is perfectly known at the receiver, and the\nnoncoherent scenario where neither the receiver nor the transmitter knows the\nfading coefficients. For both cases, the maximum a posteriori probability (MAP)\ndetection rule is derived and analytical probability of error expressions are\nobtained. The effect of fading correlation among the receiver antennas is also\nstudied. Simulation results indicate that for sufficiently low duty cycle\nvalues, lower probability of error values with respect to FSK signaling are\nachieved. Equivalently, when compared to FSK modulation, OOFSK with low duty\ncycle requires less energy to achieve the same probability of error, which\nrenders this modulation a more energy efficient transmission technique.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2007 16:11:28 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Wang", "Qingyun", ""], ["Gursoy", "Mustafa Cenk", ""]]}, {"id": "0705.0132", "submitter": "Mustafa Cenk Gursoy", "authors": "Mustafa Cenk Gursoy", "title": "Error Probability Analysis of Peaky Signaling over Fading Channels", "comments": "Proc. of the 40th Annual Asilomar Conference on Signals, Systems, and\n  Computers, 2006", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper, the performance of signaling strategies with high\npeak-to-average power ratio is analyzed in both coherent and noncoherent fading\nchannels. Two recently proposed modulation schemes, namely on-off binary\nphase-shift keying and on-off quaternary phase-shift keying, are considered.\nFor these modulation formats, the optimal decision rules used at the detector\nare identified and analytical expressions for the error probabilities are\nobtained. Numerical techniques are employed to compute the error probabilities.\nIt is concluded that increasing the peakedness of the signals results in\nreduced error rates for a given power level and hence improve the energy\nefficiency.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2007 16:20:05 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Gursoy", "Mustafa Cenk", ""]]}, {"id": "0705.0252", "submitter": "Khoa Nguyen", "authors": "Khoa D. Nguyen, Albert Guillen i Fabregas and Lars K. Rasmussen", "title": "Power Allocation for Discrete-Input Non-Ergodic Block-Fading Channels", "comments": "6 pages, 4 figures, submitted to Information Theory Workshop 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  We consider power allocation algorithms for fixed-rate transmission over\nNakagami-m non-ergodic block-fading channels with perfect transmitter and\nreceiver channel state information and discrete input signal constellations\nunder both short- and long-term power constraints. Optimal power allocation\nschemes are shown to be direct applications of previous results in the\nliterature. We show that the SNR exponent of the optimal short-term scheme is\ngiven by the Singleton bound. We also illustrate the significant gains\navailable by employing long-term power constraints. Due to the nature of the\nexpressions involved, the complexity of optimal schemes may be prohibitive for\nsystem implementation. We propose simple sub-optimal power allocation schemes\nwhose outage probability performance is very close to the minimum outage\nprobability obtained by optimal schemes.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2007 11:36:53 GMT"}, {"version": "v2", "created": "Thu, 3 May 2007 03:03:55 GMT"}, {"version": "v3", "created": "Wed, 4 Jul 2007 13:10:52 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Nguyen", "Khoa D.", ""], ["Fabregas", "Albert Guillen i", ""], ["Rasmussen", "Lars K.", ""]]}, {"id": "0705.0253", "submitter": "Jian Li", "authors": "Mordecai Golin and Li Jian", "title": "More Efficient Algorithms and Analyses for Unequal Letter Cost\n  Prefix-Free Coding", "comments": "29 pages;9 figures;", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DS math.IT", "license": null, "abstract": "  There is a large literature devoted to the problem of finding an optimal\n(min-cost) prefix-free code with an unequal letter-cost encoding alphabet of\nsize. While there is no known polynomial time algorithm for solving it\noptimally there are many good heuristics that all provide additive errors to\noptimal. The additive error in these algorithms usually depends linearly upon\nthe largest encoding letter size.\n  This paper was motivated by the problem of finding optimal codes when the\nencoding alphabet is infinite. Because the largest letter cost is infinite, the\nprevious analyses could give infinite error bounds. We provide a new algorithm\nthat works with infinite encoding alphabets. When restricted to the finite\nalphabet case, our algorithm often provides better error bounds than the best\nprevious ones known.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2007 11:23:52 GMT"}, {"version": "v2", "created": "Thu, 3 May 2007 09:00:23 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Golin", "Mordecai", ""], ["Jian", "Li", ""]]}, {"id": "0705.0286", "submitter": "Hajime Matsui", "authors": "Hajime Matsui, Seiichi Mita", "title": "Inverse-free Berlekamp-Massey-Sakata Algorithm and Small Decoders for\n  Algebraic-Geometric Codes", "comments": "15 pages, submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  This paper proposes a novel algorithm for finding error-locators of\nalgebraic-geometric codes that can eliminate the division-calculations of\nfinite fields from the Berlekamp-Massey-Sakata algorithm. This inverse-free\nalgorithm provides full performance in correcting a certain class of errors,\ngeneric errors, which includes most errors, and can decode codes on algebraic\ncurves without the determination of unknown syndromes. Moreover, we propose\nthree different kinds of architectures that our algorithm can be applied to,\nand we represent the control operation of shift-registers and switches at each\nclock-timing with numerical simulations. We estimate the performance in\ncomparison of the total running time and the numbers of multipliers and\nshift-registers in three architectures with those of the conventional ones for\ncodes on algebraic curves.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2007 13:13:48 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Matsui", "Hajime", ""], ["Mita", "Seiichi", ""]]}, {"id": "0705.0326", "submitter": "Lei Ying", "authors": "Lei Ying and R. Srikant", "title": "Optimal Delay-Throughput Trade-offs in Mobile Ad-Hoc Networks: Hybrid\n  Random Walk and One-Dimensional Mobility Models", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": null, "abstract": "  Optimal delay-throughput trade-offs for two-dimensional i.i.d mobility models\nhave been established in [23], where we showed that the optimal trade-offs can\nbe achieved using rate-less codes when the required delay guarantees are\nsufficient large. In this paper, we extend the results to other mobility models\nincluding two-dimensional hybrid random walk model, one-dimensional i.i.d.\nmobility model and one-dimensional hybrid random walk model. We consider both\nfast mobiles and slow mobiles, and establish the optimal delay-throughput\ntrade-offs under some conditions. Joint coding-scheduling algorithms are also\nproposed to achieve the optimal trade-offs.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2007 16:43:30 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Ying", "Lei", ""], ["Srikant", "R.", ""]]}, {"id": "0705.0423", "submitter": "Farbod Kayhan", "authors": "A. Braunstein, F. Kayhan, G. Montorsi and R. Zecchina", "title": "Encoding for the Blackwell Channel with Reinforced Belief Propagation", "comments": "5 pages, 8 figures, submitted to ISIT 2007", "journal-ref": "IEEE International Symposium on Information Theory (ISIT07); 2007.\n  p. 1891-5", "doi": "10.1109/ISIT.2007.4557497", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  A key idea in coding for the broadcast channel (BC) is binning, in which the\ntransmitter encode information by selecting a codeword from an appropriate bin\n(the messages are thus the bin indexes). This selection is normally done by\nsolving an appropriate (possibly difficult) combinatorial problem. Recently it\nhas been shown that binning for the Blackwell channel --a particular BC-- can\nbe done by iterative schemes based on Survey Propagation (SP). This method uses\ndecimation for SP and suffers a complexity of O(n^2). In this paper we propose\na new variation of the Belief Propagation (BP) algorithm, named Reinforced BP\nalgorithm, that turns BP into a solver. Our simulations show that this new\nalgorithm has complexity O(n log n). Using this new algorithm together with a\nnon-linear coding scheme, we can efficiently achieve rates close to the border\nof the capacity region of the Blackwell channel.\n", "versions": [{"version": "v1", "created": "Thu, 3 May 2007 09:49:15 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Braunstein", "A.", ""], ["Kayhan", "F.", ""], ["Montorsi", "G.", ""], ["Zecchina", "R.", ""]]}, {"id": "0705.0543", "submitter": "Aditya Ramamoorthy", "authors": "Jaehong Kim, Aditya Ramamoorthy and Steven W. McLaughlin", "title": "The Design of Efficiently-Encodable Rate-Compatible LDPC Codes", "comments": "Accepted subject to minor revision to IEEE Trans. on Comm", "journal-ref": null, "doi": "10.1109/ICC.2006.254899", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  We present a new class of irregular low-density parity-check (LDPC) codes for\nmoderate block lengths (up to a few thousand bits) that are well-suited for\nrate-compatible puncturing. The proposed codes show good performance under\npuncturing over a wide range of rates and are suitable for usage in incremental\nredundancy hybrid-automatic repeat request (ARQ) systems. In addition, these\ncodes are linear-time encodable with simple shift-register circuits. For a\nblock length of 1200 bits the codes outperform optimized irregular LDPC codes\nand extended irregular repeat-accumulate (eIRA) codes for all puncturing rates\n0.6~0.9 (base code performance is almost the same) and are particularly good at\nhigh puncturing rates where good puncturing performance has been previously\ndifficult to achieve.\n", "versions": [{"version": "v1", "created": "Thu, 3 May 2007 22:17:51 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Kim", "Jaehong", ""], ["Ramamoorthy", "Aditya", ""], ["McLaughlin", "Steven W.", ""]]}, {"id": "0705.0552", "submitter": "Rajeev Raman", "authors": "Rajeev Raman, Venkatesh Raman, Srinivasa Rao Satti", "title": "Succinct Indexable Dictionaries with Applications to Encoding $k$-ary\n  Trees, Prefix Sums and Multisets", "comments": "Final version of SODA 2002 paper; supersedes Leicester Tech report\n  2002/16", "journal-ref": "ACM Transactions on Algorithms vol 3 (2007), Article 43, 25pp", "doi": "10.1145/1290672.1290680", "report-no": null, "categories": "cs.DS cs.DM cs.IT math.IT", "license": null, "abstract": "  We consider the {\\it indexable dictionary} problem, which consists of storing\na set $S \\subseteq \\{0,...,m-1\\}$ for some integer $m$, while supporting the\noperations of $\\Rank(x)$, which returns the number of elements in $S$ that are\nless than $x$ if $x \\in S$, and -1 otherwise; and $\\Select(i)$ which returns\nthe $i$-th smallest element in $S$. We give a data structure that supports both\noperations in O(1) time on the RAM model and requires ${\\cal B}(n,m) + o(n) +\nO(\\lg \\lg m)$ bits to store a set of size $n$, where ${\\cal B}(n,m) = \\ceil{\\lg\n{m \\choose n}}$ is the minimum number of bits required to store any $n$-element\nsubset from a universe of size $m$. Previous dictionaries taking this space\nonly supported (yes/no) membership queries in O(1) time. In the cell probe\nmodel we can remove the $O(\\lg \\lg m)$ additive term in the space bound,\nanswering a question raised by Fich and Miltersen, and Pagh.\n  We present extensions and applications of our indexable dictionary data\nstructure, including:\n  An information-theoretically optimal representation of a $k$-ary cardinal\ntree that supports standard operations in constant time,\n  A representation of a multiset of size $n$ from $\\{0,...,m-1\\}$ in ${\\cal\nB}(n,m+n) + o(n)$ bits that supports (appropriate generalizations of) $\\Rank$\nand $\\Select$ operations in constant time, and\n  A representation of a sequence of $n$ non-negative integers summing up to $m$\nin ${\\cal B}(n,m+n) + o(n)$ bits that supports prefix sum queries in constant\ntime.\n", "versions": [{"version": "v1", "created": "Fri, 4 May 2007 07:47:05 GMT"}], "update_date": "2011-08-10", "authors_parsed": [["Raman", "Rajeev", ""], ["Raman", "Venkatesh", ""], ["Satti", "Srinivasa Rao", ""]]}, {"id": "0705.0564", "submitter": "Caleb Lo", "authors": "Caleb K. Lo, Sriram Vishwanath and Robert W. Heath Jr", "title": "Rate Bounds for MIMO Relay Channels", "comments": "25 pages, 6 figures, submitted to Journal on Communications and\n  Networks in December 2007, revised in April 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  This paper considers the multi-input multi-output (MIMO) relay channel where\nmultiple antennas are employed by each terminal. Compared to single-input\nsingle-output (SISO) relay channels, MIMO relay channels introduce additional\ndegrees of freedom, making the design and analysis of optimal cooperative\nstrategies more complex. In this paper, a partial cooperation strategy that\ncombines transmit-side message splitting and block-Markov encoding is\npresented. Lower bounds on capacity that improve on a previously proposed\nnon-cooperative lower bound are derived for Gaussian MIMO relay channels.\n", "versions": [{"version": "v1", "created": "Fri, 4 May 2007 06:43:42 GMT"}, {"version": "v2", "created": "Tue, 18 Dec 2007 17:39:33 GMT"}, {"version": "v3", "created": "Thu, 10 Apr 2008 15:52:35 GMT"}, {"version": "v4", "created": "Fri, 2 May 2008 21:33:42 GMT"}], "update_date": "2008-05-03", "authors_parsed": [["Lo", "Caleb K.", ""], ["Vishwanath", "Sriram", ""], ["Heath", "Robert W.", "Jr"]]}, {"id": "0705.0760", "submitter": "Sujay Sanghavi", "authors": "Sujay Sanghavi", "title": "Equivalence of LP Relaxation and Max-Product for Weighted Matching in\n  General Graphs", "comments": "6 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.AI cs.LG cs.NI math.IT", "license": null, "abstract": "  Max-product belief propagation is a local, iterative algorithm to find the\nmode/MAP estimate of a probability distribution. While it has been successfully\nemployed in a wide variety of applications, there are relatively few\ntheoretical guarantees of convergence and correctness for general loopy graphs\nthat may have many short cycles. Of these, even fewer provide exact ``necessary\nand sufficient'' characterizations.\n  In this paper we investigate the problem of using max-product to find the\nmaximum weight matching in an arbitrary graph with edge weights. This is done\nby first constructing a probability distribution whose mode corresponds to the\noptimal matching, and then running max-product. Weighted matching can also be\nposed as an integer program, for which there is an LP relaxation. This\nrelaxation is not always tight. In this paper we show that \\begin{enumerate}\n\\item If the LP relaxation is tight, then max-product always converges, and\nthat too to the correct answer. \\item If the LP relaxation is loose, then\nmax-product does not converge. \\end{enumerate} This provides an exact,\ndata-dependent characterization of max-product performance, and a precise\nconnection to LP relaxation, which is a well-studied optimization technique.\nAlso, since LP relaxation is known to be tight for bipartite graphs, our\nresults generalize other recent results on using max-product to find weighted\nmatchings in bipartite graphs.\n", "versions": [{"version": "v1", "created": "Sat, 5 May 2007 18:57:47 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Sanghavi", "Sujay", ""]]}, {"id": "0705.0783", "submitter": "Stefano Buzzi", "authors": "Stefano Buzzi, and H. Vincent Poor", "title": "Non-cooperative games for spreading code optimization, power control and\n  receiver design in wireless data networks", "comments": "appeared in the Proceedings of the 13th European Wireless Conference,\n  Paris (France), April 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": null, "abstract": "  This paper focuses on the issue of energy efficiency in wireless data\nnetworks through a game theoretic approach. The case considered is that in\nwhich each user is allowed to vary its transmit power, spreading code, and\nuplink receiver in order to maximize its own utility, which is here defined as\nthe ratio of data throughput to transmit power. In particular, the case in\nwhich linear multiuser detectors are employed at the receiver is treated first,\nand, then, the more challenging case in which non-linear decision feedback\nmultiuser receivers are adopted is addressed. It is shown that, for both\nreceivers, the problem at hand of utility maximization can be regarded as a\nnon-cooperative game, and it is proved that a unique Nash equilibrium point\nexists. Simulation results show that significant performance gains can be\nobtained through both non-linear processing and spreading code optimization; in\nparticular, for systems with a number of users not larger than the processing\ngain, remarkable gains come from spreading code optimization, while, for\noverloaded systems, the largest gainscome from the use of non-linear\nprocessing. In every case, however, the non-cooperative games proposed here are\nshown to outperform competing alternatives.\n", "versions": [{"version": "v1", "created": "Sun, 6 May 2007 06:49:07 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Buzzi", "Stefano", ""], ["Poor", "H. Vincent", ""]]}, {"id": "0705.0909", "submitter": "Giacomo Bacci", "authors": "Giacomo Bacci, Marco Luise, H. Vincent Poor", "title": "Game-Theoretic Power Control in Impulse Radio UWB Wireless Networks", "comments": "Appeared in the Proceedings of the 13th European Wireless Conference,\n  Paris, France, April 1-4, 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.IT math.IT", "license": null, "abstract": "  In this paper, a game-theoretic model for studying power control for wireless\ndata networks in frequency-selective multipath environments is analyzed. The\nuplink of an impulse-radio ultrawideband system is considered. The effects of\nself-interference and multiple-access interference on the performance of Rake\nreceivers are investigated for synchronous systems. Focusing on energy\nefficiency, a noncooperative game is proposed in which users in the network are\nallowed to choose their transmit powers to maximize their own utilities, and\nthe Nash equilibrium for the proposed game is derived. It is shown that, due to\nthe frequency selective multipath, the noncooperative solution is achieved at\ndifferent signal-to-interference-plus-noise ratios, respectively of the channel\nrealization. A large-system analysis is performed to derive explicit\nexpressions for the achieved utilities. The Pareto-optimal (cooperative)\nsolution is also discussed and compared with the noncooperative approach.\n", "versions": [{"version": "v1", "created": "Mon, 7 May 2007 13:58:01 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Bacci", "Giacomo", ""], ["Luise", "Marco", ""], ["Poor", "H. Vincent", ""]]}, {"id": "0705.0932", "submitter": "Oliver Kosut", "authors": "Oliver Kosut and Lang Tong", "title": "Variable-Rate Distributed Source Coding in the Presence of Byzantine\n  Sensors", "comments": "5 pages, submitted to ISIT 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  The distributed source coding problem is considered when the sensors, or\nencoders, are under Byzantine attack; that is, an unknown number of sensors\nhave been reprogrammed by a malicious intruder to undermine the reconstruction\nat the fusion center. Three different forms of the problem are considered. The\nfirst is a variable-rate setup, in which the decoder adaptively chooses the\nrates at which the sensors transmit. An explicit characterization of the\nvariable-rate minimum achievable sum rate is stated, given by the maximum\nentropy over the set of distributions indistinguishable from the true source\ndistribution by the decoder. In addition, two forms of the fixed-rate problem\nare considered, one with deterministic coding and one with randomized coding.\nThe achievable rate regions are given for both these problems, with a larger\nregion achievable using randomized coding, though both are suboptimal compared\nto variable-rate coding.\n", "versions": [{"version": "v1", "created": "Mon, 7 May 2007 15:55:06 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Kosut", "Oliver", ""], ["Tong", "Lang", ""]]}, {"id": "0705.0936", "submitter": "Giacomo Bacci", "authors": "Giacomo Bacci, Marco Luise, H. Vincent Poor", "title": "Performance Comparison of Energy-Efficient Power Control for CDMA and\n  Multiuser UWB Networks", "comments": "To appear in the Proceedings of the 16th IST Mobile and Wireless\n  Communications Summit, Budapest, Hungary, July 1-5, 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.IT math.IT", "license": null, "abstract": "  This paper studies the performance of a wireless data network using\nenergy-efficient power control techniques when different multiple access\nschemes, namely direct-sequence code division multiple access (DS-CDMA) and\nimpulse-radio ultrawideband (IR-UWB), are considered. Due to the large\nbandwidth of the system, the multipath channel is assumed to be\nfrequency-selective. By making use of noncooperative game-theoretic models and\nlarge-system analysis tools, explicit expressions for the achieved utilities at\nthe Nash equilibrium are derived in terms of the network parameters. A measure\nof the loss of DS-CDMA with respect to IR-UWB is proposed, which proves\nsubstantial equivalence between the two schemes. Simulation results are\nprovided to validate the analysis.\n", "versions": [{"version": "v1", "created": "Mon, 7 May 2007 15:58:58 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Bacci", "Giacomo", ""], ["Luise", "Marco", ""], ["Poor", "H. Vincent", ""]]}, {"id": "0705.0999", "submitter": "Oren Somekh", "authors": "Oren Somekh, Osvaldo Simeone, H. Vincent Poor, and Shlomo Shamai\n  (Shitz)", "title": "Cellular Systems with Full-Duplex Amplify-and-Forward Relaying and\n  Cooperative Base-Stations", "comments": "To appear in the Proc. of the 2007 IEEE International Symposium on\n  Information Theory", "journal-ref": null, "doi": "10.1109/ISIT.2007.4557197", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper the benefits provided by multi-cell processing of signals\ntransmitted by mobile terminals which are received via dedicated relay\nterminals (RTs) are assessed. Unlike previous works, each RT is assumed here to\nbe capable of full-duplex operation and receives the transmission of adjacent\nrelay terminals. Focusing on intra-cell TDMA and non-fading channels, a\nsimplified uplink cellular model introduced by Wyner is considered. This\nframework facilitates analytical derivation of the per-cell sum-rate of\nmulti-cell and conventional single-cell receivers. In particular, the analysis\nis based on the observation that the signal received at the base stations can\nbe interpreted as the outcome of a two-dimensional linear time invariant\nsystem. Numerical results are provided as well in order to provide further\ninsight into the performance benefits of multi-cell processing with relaying.\n", "versions": [{"version": "v1", "created": "Mon, 7 May 2007 20:47:37 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Somekh", "Oren", "", "Shitz"], ["Simeone", "Osvaldo", "", "Shitz"], ["Poor", "H. Vincent", "", "Shitz"], ["Shamai", "Shlomo", "", "Shitz"]]}, {"id": "0705.1151", "submitter": "Mustafa Cenk Gursoy", "authors": "Junwei Zhang, Mustafa Cenk Gursoy", "title": "Achievable Rates and Optimal Resource Allocation for Imperfectly-Known\n  Fading Relay Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper, achievable rates of imperfectly-known fading relay channels\nare studied. It is assumed that communication starts with the network training\nphase in which the receivers estimate the fading coefficients of their\nrespective channels. In the data transmission phase, amplify-and-forward and\ndecode-and-forward relaying schemes are considered, and the corresponding\nachievable rate expressions are obtained. The achievable rate expressions are\nthen employed to identify the optimal resource allocation strategies.\n", "versions": [{"version": "v1", "created": "Tue, 8 May 2007 19:21:40 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Zhang", "Junwei", ""], ["Gursoy", "Mustafa Cenk", ""]]}, {"id": "0705.1159", "submitter": "Andrew Eckford", "authors": "Andrew W. Eckford", "title": "Ordering Finite-State Markov Channels by Mutual Information", "comments": "5 pages, no figures. To be presented at the 2007 IEEE International\n  Symposium on Information Theory, Nice, France, June 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In previous work, an ordering result was given for the symbolwise probability\nof error using general Markov channels, under iterative decoding of LDPC codes.\nIn this paper, the ordering result is extended to mutual information, under the\nassumption of an iid input distribution. For certain channels, in which the\ncapacity-achieving input distribution is iid, this allows ordering of the\nchannels by capacity. The complexity of analyzing general Markov channels is\nmitigated by this ordering, since it is possible to immediately determine that\na wide class of channels, with different numbers of states, has a smaller\nmutual information than a given channel.\n", "versions": [{"version": "v1", "created": "Tue, 8 May 2007 20:48:18 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Eckford", "Andrew W.", ""]]}, {"id": "0705.1183", "submitter": "Ruoheng Liu", "authors": "Ruoheng Liu and H. Vincent Poor", "title": "Multiple Antenna Secure Broadcast over Wireless Networks", "comments": "14 pages, 3 figures, to appear in the Proceedings of the First\n  International Workshop on Information Theory for Sensor Networks, Santa Fe,\n  NM, June 18 - 20, 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In wireless data networks, communication is particularly susceptible to\neavesdropping due to its broadcast nature. Security and privacy systems have\nbecome critical for wireless providers and enterprise networks. This paper\nconsiders the problem of secret communication over the Gaussian broadcast\nchannel, where a multi-antenna transmitter sends independent confidential\nmessages to two users with perfect secrecy. That is, each user would like to\nobtain its own message reliably and confidentially. First, a computable\nSato-type outer bound on the secrecy capacity region is provided for a\nmulti-antenna broadcast channel with confidential messages. Next, a dirty-paper\nsecure coding scheme and its simplified version are described. For each case,\nthe corresponding achievable rate region is derived under the perfect secrecy\nrequirement. Finally, two numerical examples demonstrate that the Sato-type\nouter bound is consistent with the boundary of the simplified dirty-paper\ncoding secrecy rate region.\n", "versions": [{"version": "v1", "created": "Tue, 8 May 2007 21:50:24 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Liu", "Ruoheng", ""], ["Poor", "H. Vincent", ""]]}, {"id": "0705.1187", "submitter": "Sergey Loyka", "authors": "Sergey Loyka, Victoria Kostina, Francois Gagnon", "title": "Symbol Error Rates of Maximum-Likelihood Detector: Convex/Concave\n  Behavior and Applications", "comments": "To appear in 2007 IEEE International Symposium on Information Theory\n  (ISIT 2007), Nice, June 2007", "journal-ref": null, "doi": "10.1109/ISIT.2007.4557176", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  Convexity/concavity properties of symbol error rates (SER) of the maximum\nlikelihood detector operating in the AWGN channel (non-fading and fading) are\nstudied. Generic conditions are identified under which the SER is a\nconvex/concave function of the SNR. Universal bounds for the SER 1st and 2nd\nderivatives are obtained, which hold for arbitrary constellations and are tight\nfor some of them. Applications of the results are discussed, which include\noptimum power allocation in spatial multiplexing systems, optimum power/time\nsharing to decrease or increase (jamming problem) error rate, and implication\nfor fading channels.\n", "versions": [{"version": "v1", "created": "Tue, 8 May 2007 23:18:16 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Loyka", "Sergey", ""], ["Kostina", "Victoria", ""], ["Gagnon", "Francois", ""]]}, {"id": "0705.1227", "submitter": "Petar Popovski", "authors": "Petar Popovski, Hiroyuki Yomo, Kentaro Nishimori, and Rocco Di Taranto", "title": "Rate Adaptation for Cognitive Radio under Interference from Primary\n  Spectrum User", "comments": "submitted to IEEE Journal on Selected Areas in Communications\n  \"Cognitive Radio: Theory and Applications\", March 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": null, "abstract": "  A cognitive radio can operate as a secondary system in a given spectrum. This\noperation should use limited power in order not to disturb the communication by\nprimary spectrum user. Under such conditions, in this paper we investigate how\nto maximize the spectral efficiency in the secondary system. A secondary\nreceiver observes a multiple access channel of two users, the secondary and the\nprimary transmitter, respectively. We show that, for spectrally-efficient\noperation, the secondary system should apply Opportunistic Interference\nCancellation (OIC). With OIC, the secondary system decodes the primary signal\nwhen such an opportunity is created by the primary rate and the power received\nfrom the primary system. For such an operation, we derive the achievable data\nrate in the secondary system. When the primary signal is decodable, we devise a\nmethod, based on superposition coding, by which the secondary system can\nachieve the maximal possible rate. Finally, we investigate the power allocation\nin the secondary system when multiple channels are used. We show that the\noptimal power allocation with OIC can be achieved through intercepted\nwater-filling instead of the conventional water-filling. The results show a\nsignificant gain for the rate achieved through an opportunistic interference\ncancellation.\n", "versions": [{"version": "v1", "created": "Wed, 9 May 2007 08:50:53 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Popovski", "Petar", ""], ["Yomo", "Hiroyuki", ""], ["Nishimori", "Kentaro", ""], ["Di Taranto", "Rocco", ""]]}, {"id": "0705.1336", "submitter": "Sergey Loyka", "authors": "Sergey Loyka, George Levin", "title": "Diversity-Multiplexing Tradeoff via Asymptotic Analysis of Large MIMO\n  Systems", "comments": "To appear in 2007 IEEE International Symposium on Information Theory\n  (ISIT 2007), Nice, June 2007", "journal-ref": null, "doi": "10.1109/ISIT.2007.4557189", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  Diversity-multiplexing tradeoff (DMT) presents a compact framework to compare\nvarious MIMO systems and channels in terms of the two main advantages they\nprovide (i.e. high data rate and/or low error rate). This tradeoff was\ncharacterized asymptotically (SNR-> infinity) for i.i.d. Rayleigh fading\nchannel by Zheng and Tse [1]. The asymptotic DMT overestimates the finite-SNR\none [2]. In this paper, using the recent results on the asymptotic (in the\nnumber of antennas) outage capacity distribution, we derive and analyze the\nfinite-SNR DMT for a broad class of channels (not necessarily Rayleigh fading).\nBased on this, we give the convergence conditions for the asymptotic DMT to be\napproached by the finite-SNR one. The multiplexing gain definition is shown to\naffect critically the convergence point: when the multiplexing gain is defined\nvia the mean (ergodic) capacity, the convergence takes place at realistic SNR\nvalues. Furthermore, in this case the diversity gain can also be used to\nestimate the outage probability with reasonable accuracy. The multiplexing gain\ndefinition via the high-SNR asymptote of the mean capacity (as in [1]) results\nin very slow convergence for moderate to large systems (as 1/ln(SNR)^2) and,\nhence, the asymptotic DMT cannot be used at realistic SNR values. For this\ndefinition, the high-SNR threshold increases exponentially in the number of\nantennas and in the multiplexing gain. For correlated keyhole channel, the\ndiversity gain is shown to decrease with correlation and power imbalance of the\nchannel. While the SNR-asymptotic DMT of Zheng and Tse does not capture this\neffect, the size-asymptotic DMT does.\n", "versions": [{"version": "v1", "created": "Wed, 9 May 2007 17:49:54 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Loyka", "Sergey", ""], ["Levin", "George", ""]]}, {"id": "0705.1340", "submitter": "Sergey Loyka", "authors": "Victoria Kostina, Sergey Loyka", "title": "On Optimum Power Allocation for the V-BLAST", "comments": "Accepted by IEEE Transactions on Communications, Apr. 2007", "journal-ref": null, "doi": "10.1109/TCOMM.2008.060517", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  A unified analytical framework for optimum power allocation in the unordered\nV-BLAST algorithm and its comparative performance analysis are presented.\nCompact closed-form approximations for the optimum power allocation are\nderived, based on average total and block error rates. The choice of the\ncriterion has little impact on the power allocation and, overall, the optimum\nstrategy is to allocate more power to lower step transmitters and less to\nhigher ones. High-SNR approximations for optimized average block and total\nerror rates are given. The SNR gain of optimization is rigorously defined and\nstudied using analytical tools, including lower and upper bounds, high and low\nSNR approximations. The gain is upper bounded by the number of transmitters,\nfor any modulation format and type of fading channel. While the average\noptimization is less complex than the instantaneous one, its performance is\nalmost as good at high SNR. A measure of robustness of the optimized algorithm\nis introduced and evaluated. The optimized algorithm is shown to be robust to\nperturbations in individual and total transmit powers. Based on the algorithm\nrobustness, a pre-set power allocation is suggested as a low-complexity\nalternative to the other optimization strategies, which exhibits only a minor\nloss in performance over the practical SNR range.\n", "versions": [{"version": "v1", "created": "Wed, 9 May 2007 18:05:44 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Kostina", "Victoria", ""], ["Loyka", "Sergey", ""]]}, {"id": "0705.1345", "submitter": "Vishwambhar Rathi", "authors": "Kapil Bhattad, Vishwambhar Rathi, Ruediger Urbanke", "title": "Degree Optimization and Stability Condition for the Min-Sum Decoder", "comments": "submitted to ITW 07", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  The min-sum (MS) algorithm is arguably the second most fundamental algorithm\nin the realm of message passing due to its optimality (for a tree code) with\nrespect to the {\\em block error} probability \\cite{Wiberg}. There also seems to\nbe a fundamental relationship of MS decoding with the linear programming\ndecoder \\cite{Koetter}. Despite its importance, its fundamental properties have\nnot nearly been studied as well as those of the sum-product (also known as BP)\nalgorithm.\n  We address two questions related to the MS rule. First, we characterize the\nstability condition under MS decoding. It turns out to be essentially the same\ncondition as under BP decoding. Second, we perform a degree distribution\noptimization. Contrary to the case of BP decoding, under MS decoding the\nthresholds of the best degree distributions for standard irregular LDPC\nensembles are significantly bounded away from the Shannon threshold. More\nprecisely, on the AWGN channel, for the best codes that we find, the gap to\ncapacity is 1dB for a rate 0.3 code and it is 0.4dB when the rate is 0.9 (the\ngap decreases monotonically as we increase the rate).\n  We also used the optimization procedure to design codes for modified MS\nalgorithm where the output of the check node is scaled by a constant\n$1/\\alpha$. For $\\alpha = 1.25$, we observed that the gap to capacity was\nlesser for the modified MS algorithm when compared with the MS algorithm.\nHowever, it was still quite large, varying from 0.75 dB to 0.2 dB for rates\nbetween 0.3 and 0.9.\n  We conclude by posing what we consider to be the most important open\nquestions related to the MS algorithm.\n", "versions": [{"version": "v1", "created": "Wed, 9 May 2007 19:19:26 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Bhattad", "Kapil", ""], ["Rathi", "Vishwambhar", ""], ["Urbanke", "Ruediger", ""]]}, {"id": "0705.1384", "submitter": "Navin Kashyap", "authors": "Navin Kashyap", "title": "Matroid Pathwidth and Code Trellis Complexity", "comments": "Submitted to SIAM Journal on Discrete Mathematics; 18 pages, 6\n  figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.IT math.IT", "license": null, "abstract": "  We relate the notion of matroid pathwidth to the minimum trellis\nstate-complexity (which we term trellis-width) of a linear code, and to the\npathwidth of a graph. By reducing from the problem of computing the pathwidth\nof a graph, we show that the problem of determining the pathwidth of a\nrepresentable matroid is NP-hard. Consequently, the problem of computing the\ntrellis-width of a linear code is also NP-hard. For a finite field $\\F$, we\nalso consider the class of $\\F$-representable matroids of pathwidth at most\n$w$, and correspondingly, the family of linear codes over $\\F$ with\ntrellis-width at most $w$. These are easily seen to be minor-closed. Since\nthese matroids (and codes) have branchwidth at most $w$, a result of Geelen and\nWhittle shows that such matroids (and the corresponding codes) are\ncharacterized by finitely many excluded minors. We provide the complete list of\nexcluded minors for $w=1$, and give a partial list for $w=2$.\n", "versions": [{"version": "v1", "created": "Thu, 10 May 2007 03:00:54 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Kashyap", "Navin", ""]]}, {"id": "0705.1612", "submitter": "Enrico Paolini", "authors": "E. Paolini, M. Chiani", "title": "A Class of LDPC Erasure Distributions with Closed-Form Threshold\n  Expression", "comments": "6 pages. To appear in Proceedings of ICC 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper, a family of low-density parity-check (LDPC) degree\ndistributions, whose decoding threshold on the binary erasure channel (BEC)\nadmits a simple closed form, is presented. These degree distributions are a\nsubset of the check regular distributions (i.e. all the check nodes have the\nsame degree), and are referred to as $p$-positive distributions. It is given\nproof that the threshold for a $p$-positive distribution is simply expressed by\n$[\\lambda'(0)\\rho'(1)]^{-1}$. Besides this closed form threshold expression,\nthe $p$-positive distributions exhibit three additional properties. First, for\ngiven code rate, check degree and maximum variable degree, they are in some\ncases characterized by a threshold which is extremely close to that of the best\nknown check regular distributions, under the same set of constraints. Second,\nthe threshold optimization problem within the $p$-positive class can be solved\nin some cases with analytic methods, without using any numerical optimization\ntool. Third, these distributions can achieve the BEC capacity. The last\nproperty is shown by proving that the well-known binomial degree distributions\nbelong to the $p$-positive family.\n", "versions": [{"version": "v1", "created": "Fri, 11 May 2007 10:11:47 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Paolini", "E.", ""], ["Chiani", "M.", ""]]}, {"id": "0705.1682", "submitter": "Giuseppe Durisi", "authors": "Giuseppe Durisi, Helmut B\\\"olcskei, Shlomo Shamai (Shitz)", "title": "Capacity of Underspread Noncoherent WSSUS Fading Channels under Peak\n  Signal Constraints", "comments": "To be presented at IEEE Int. Symp. Inf. Theory 2007, Nice, France", "journal-ref": null, "doi": "10.1109/ISIT.2007.4557219", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  We characterize the capacity of the general class of noncoherent underspread\nwide-sense stationary uncorrelated scattering (WSSUS) time-frequency-selective\nRayleigh fading channels, under peak constraints in time and frequency and in\ntime only. Capacity upper and lower bounds are found which are explicit in the\nchannel's scattering function and allow to identify the capacity-maximizing\nbandwidth for a given scattering function and a given peak-to-average power\nratio.\n", "versions": [{"version": "v1", "created": "Fri, 11 May 2007 16:01:09 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Durisi", "Giuseppe", "", "Shitz"], ["Bölcskei", "Helmut", "", "Shitz"], ["Shamai", "Shlomo", "", "Shitz"]]}, {"id": "0705.1787", "submitter": "Farhad Meshkati", "authors": "Farhad Meshkati, H. Vincent Poor and Stuart C. Schwartz", "title": "Energy-Efficient Resource Allocation in Wireless Networks: An Overview\n  of Game-Theoretic Approaches", "comments": "To appear in the IEEE Signal Processing Magazine: Special Issue on\n  Resource-Constrained Signal Processing, Communications and Networking, May\n  2007", "journal-ref": null, "doi": "10.1109/MSP.2007.361602", "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": null, "abstract": "  An overview of game-theoretic approaches to energy-efficient resource\nallocation in wireless networks is presented. Focusing on multiple-access\nnetworks, it is demonstrated that game theory can be used as an effective tool\nto study resource allocation in wireless networks with quality-of-service (QoS)\nconstraints. A family of non-cooperative (distributed) games is presented in\nwhich each user seeks to choose a strategy that maximizes its own utility while\nsatisfying its QoS requirements. The utility function considered here measures\nthe number of reliable bits that are transmitted per joule of energy consumed\nand, hence, is particulary suitable for energy-constrained networks. The\nactions available to each user in trying to maximize its own utility are at\nleast the choice of the transmit power and, depending on the situation, the\nuser may also be able to choose its transmission rate, modulation, packet size,\nmultiuser receiver, multi-antenna processing algorithm, or carrier allocation\nstrategy. The best-response strategy and Nash equilibrium for each game is\npresented. Using this game-theoretic framework, the effects of power control,\nrate control, modulation, temporal and spatial signal processing, carrier\nallocation strategy and delay QoS constraints on energy efficiency and network\ncapacity are quantified.\n", "versions": [{"version": "v1", "created": "Sun, 13 May 2007 17:22:29 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Meshkati", "Farhad", ""], ["Poor", "H. Vincent", ""], ["Schwartz", "Stuart C.", ""]]}, {"id": "0705.1788", "submitter": "Farhad Meshkati", "authors": "Farhad Meshkati, Andrea J. Goldsmith, H. Vincent Poor and Stuart C.\n  Schwartz", "title": "A Game-Theoretic Approach to Energy-Efficient Modulation in CDMA\n  Networks with Delay QoS Constraints", "comments": "To appear in the IEEE Journal on Selected Areas in Communications\n  (JSAC): Special Issue on Non-Cooperative Behavior in Networking, August 2007", "journal-ref": null, "doi": "10.1109/JSAC.2007.070802", "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": null, "abstract": "  A game-theoretic framework is used to study the effect of constellation size\non the energy efficiency of wireless networks for M-QAM modulation. A\nnon-cooperative game is proposed in which each user seeks to choose its\ntransmit power (and possibly transmit symbol rate) as well as the constellation\nsize in order to maximize its own utility while satisfying its delay\nquality-of-service (QoS) constraint. The utility function used here measures\nthe number of reliable bits transmitted per joule of energy consumed, and is\nparticularly suitable for energy-constrained networks. The best-response\nstrategies and Nash equilibrium solution for the proposed game are derived. It\nis shown that in order to maximize its utility (in bits per joule), a user must\nchoose the lowest constellation size that can accommodate the user's delay\nconstraint. This strategy is different from one that would maximize spectral\nefficiency. Using this framework, the tradeoffs among energy efficiency, delay,\nthroughput and constellation size are also studied and quantified. In addition,\nthe effect of trellis-coded modulation on energy efficiency is discussed.\n", "versions": [{"version": "v1", "created": "Sat, 12 May 2007 22:39:27 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Meshkati", "Farhad", ""], ["Goldsmith", "Andrea J.", ""], ["Poor", "H. Vincent", ""], ["Schwartz", "Stuart C.", ""]]}, {"id": "0705.1789", "submitter": "Lu\\'isa Lima", "authors": "Lu\\'isa Lima and Muriel M\\'edard and Jo\\~ao Barros", "title": "Random Linear Network Coding: A free cipher?", "comments": "5 pages, 2 figures, Accepted for the IEEE International Symposium on\n  Information Theory, Nice, France, June, 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": null, "abstract": "  We consider the level of information security provided by random linear\nnetwork coding in network scenarios in which all nodes comply with the\ncommunication protocols yet are assumed to be potential eavesdroppers (i.e.\n\"nice but curious\"). For this setup, which differs from wiretapping scenarios\nconsidered previously, we develop a natural algebraic security criterion, and\nprove several of its key properties. A preliminary analysis of the impact of\nnetwork topology on the overall network coding security, in particular for\ncomplete directed acyclic graphs, is also included.\n", "versions": [{"version": "v1", "created": "Sat, 12 May 2007 18:11:48 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Lima", "Luísa", ""], ["Médard", "Muriel", ""], ["Barros", "João", ""]]}, {"id": "0705.1919", "submitter": "Erez Sabbag", "authors": "Neri Merhav and Erez Sabbag", "title": "Optimal Watermark Embedding and Detection Strategies Under Limited\n  Detection Resources", "comments": "36 pages, 5 figures. Revised version. Submitted to IEEE Transactions\n  on Information Theory", "journal-ref": null, "doi": "10.1109/ISIT.2006.261759", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": null, "abstract": "  An information-theoretic approach is proposed to watermark embedding and\ndetection under limited detector resources. First, we consider the attack-free\nscenario under which asymptotically optimal decision regions in the\nNeyman-Pearson sense are proposed, along with the optimal embedding rule.\nLater, we explore the case of zero-mean i.i.d. Gaussian covertext distribution\nwith unknown variance under the attack-free scenario. For this case, we propose\na lower bound on the exponential decay rate of the false-negative probability\nand prove that the optimal embedding and detecting strategy is superior to the\ncustomary linear, additive embedding strategy in the exponential sense.\nFinally, these results are extended to the case of memoryless attacks and\ngeneral worst case attacks. Optimal decision regions and embedding rules are\noffered, and the worst attack channel is identified.\n", "versions": [{"version": "v1", "created": "Mon, 14 May 2007 12:00:29 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Merhav", "Neri", ""], ["Sabbag", "Erez", ""]]}, {"id": "0705.1922", "submitter": "Veniamin Morgenshtern", "authors": "Veniamin I. Morgenshtern and Helmut Boelcskei", "title": "Crystallization in large wireless networks", "comments": "30 pages, 6 figures, submitted to journal IEEE Transactions on\n  Information Theory", "journal-ref": "Information Theory, IEEE Transactions on , vol.53, no.10,\n  pp.3319-3349, Oct. 2007", "doi": "10.1109/TIT.2007.904789", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  We analyze fading interference relay networks where M single-antenna\nsource-destination terminal pairs communicate concurrently and in the same\nfrequency band through a set of K single-antenna relays using half-duplex\ntwo-hop relaying. Assuming that the relays have channel state information\n(CSI), it is shown that in the large-M limit, provided K grows fast enough as a\nfunction of M, the network \"decouples\" in the sense that the individual\nsource-destination terminal pair capacities are strictly positive. The\ncorresponding required rate of growth of K as a function of M is found to be\nsufficient to also make the individual source-destination fading links converge\nto nonfading links. We say that the network \"crystallizes\" as it breaks up into\na set of effectively isolated \"wires in the air\". A large-deviations analysis\nis performed to characterize the \"crystallization\" rate, i.e., the rate (as a\nfunction of M,K) at which the decoupled links converge to nonfading links. In\nthe course of this analysis, we develop a new technique for characterizing the\nlarge-deviations behavior of certain sums of dependent random variables. For\nthe case of no CSI at the relay level, assuming amplify-and-forward relaying,\nwe compute the per source-destination terminal pair capacity for M,K converging\nto infinity, with K/M staying fixed, using tools from large random matrix\ntheory.\n", "versions": [{"version": "v1", "created": "Mon, 14 May 2007 12:23:39 GMT"}], "update_date": "2011-07-15", "authors_parsed": [["Morgenshtern", "Veniamin I.", ""], ["Boelcskei", "Helmut", ""]]}, {"id": "0705.2009", "submitter": "Ersin Sengul", "authors": "Ersin Sengul, Hong Ju Park, Ender Ayanoglu", "title": "Bit-Interleaved Coded Multiple Beamforming with Imperfect CSIT", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  This paper addresses the performance of bit-interleaved coded multiple\nbeamforming (BICMB) [1], [2] with imperfect knowledge of beamforming vectors.\nMost studies for limited-rate channel state information at the transmitter\n(CSIT) assume that the precoding matrix has an invariance property under an\narbitrary unitary transform. In BICMB, this property does not hold. On the\nother hand, the optimum precoder and detector for BICMB are invariant under a\ndiagonal unitary transform. In order to design a limited-rate CSIT system for\nBICMB, we propose a new distortion measure optimum under this invariance. Based\non this new distortion measure, we introduce a new set of centroids and employ\nthe generalized Lloyd algorithm for codebook design. We provide simulation\nresults demonstrating the performance improvement achieved with the proposed\ndistortion measure and the codebook design for various receivers with linear\ndetectors. We show that although these receivers have the same performance for\nperfect CSIT, their performance varies under imperfect CSIT.\n", "versions": [{"version": "v1", "created": "Mon, 14 May 2007 19:33:20 GMT"}, {"version": "v2", "created": "Thu, 8 May 2008 08:38:20 GMT"}], "update_date": "2008-05-08", "authors_parsed": [["Sengul", "Ersin", ""], ["Park", "Hong Ju", ""], ["Ayanoglu", "Ender", ""]]}, {"id": "0705.2270", "submitter": "Wei Dai", "authors": "Wei Dai, Brian Rider and Youjian Liu", "title": "Multi-Access MIMO Systems with Finite Rate Channel State Feedback", "comments": "10 pages. In Proc. Allerton Conf. on Commun., Control, and Computing,\n  2005", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  This paper characterizes the effect of finite rate channel state feedback on\nthe sum rate of a multi-access multiple-input multiple-output (MIMO) system. We\npropose to control the users jointly, specifically, we first choose the users\njointly and then select the corresponding beamforming vectors jointly. To\nquantify the sum rate, this paper introduces the composite Grassmann manifold\nand the composite Grassmann matrix. By characterizing the distortion rate\nfunction on the composite Grassmann manifold and calculating the logdet\nfunction of a random composite Grassmann matrix, a good sum rate approximation\nis derived. According to the distortion rate function on the composite\nGrassmann manifold, the loss due to finite beamforming decreases exponentially\nas the feedback bits on beamforming increases.\n", "versions": [{"version": "v1", "created": "Wed, 16 May 2007 02:09:48 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Dai", "Wei", ""], ["Rider", "Brian", ""], ["Liu", "Youjian", ""]]}, {"id": "0705.2272", "submitter": "Wei Dai", "authors": "Wei Dai, Youjian Liu and Brian Rider", "title": "Quantization Bounds on Grassmann Manifolds of Arbitrary Dimensions and\n  MIMO Communications with Feedback", "comments": "In IEEE Global Telecommunications Conference (GLOBECOM), 2005", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  This paper considers the quantization problem on the Grassmann manifold with\ndimension n and p. The unique contribution is the derivation of a closed-form\nformula for the volume of a metric ball in the Grassmann manifold when the\nradius is sufficiently small. This volume formula holds for Grassmann manifolds\nwith arbitrary dimension n and p, while previous results are only valid for\neither p=1 or a fixed p with asymptotically large n. Based on the volume\nformula, the Gilbert-Varshamov and Hamming bounds for sphere packings are\nobtained. Assuming a uniformly distributed source and a distortion metric based\non the squared chordal distance, tight lower and upper bounds are established\nfor the distortion rate tradeoff. Simulation results match the derived results.\nAs an application of the derived quantization bounds, the information rate of a\nMultiple-Input Multiple-Output (MIMO) system with finite-rate channel-state\nfeedback is accurately quantified for arbitrary finite number of antennas,\nwhile previous results are only valid for either Multiple-Input Single-Output\n(MISO) systems or those with asymptotically large number of transmit antennas\nbut fixed number of receive antennas.\n", "versions": [{"version": "v1", "created": "Wed, 16 May 2007 02:23:38 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Dai", "Wei", ""], ["Liu", "Youjian", ""], ["Rider", "Brian", ""]]}, {"id": "0705.2273", "submitter": "Wei Dai", "authors": "Wei Dai, Youjian Liu, Brian Rider and Vincent K.N. Lau", "title": "On the Information Rate of MIMO Systems with Finite Rate Channel State\n  Feedback and Power On/Off Strategy", "comments": "In Proc. IEEE International Symposium on Information Theory (ISIT),\n  2005", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  This paper quantifies the information rate of multiple-input multiple-output\n(MIMO) systems with finite rate channel state feedback and power on/off\nstrategy. In power on/off strategy, a beamforming vector (beam) is either\nturned on (denoted by on-beam) with a constant power or turned off. We prove\nthat the ratio of the optimal number of on-beams and the number of antennas\nconverges to a constant for a given signal-to-noise ratio (SNR) when the number\nof transmit and receive antennas approaches infinity simultaneously and when\nbeamforming is perfect. Based on this result, a near optimal strategy, i.e.,\npower on/off strategy with a constant number of on-beams, is discussed. For\nsuch a strategy, we propose the power efficiency factor to quantify the effect\nof imperfect beamforming. A formula is proposed to compute the maximum power\nefficiency factor achievable given a feedback rate. The information rate of the\noverall MIMO system can be approximated by combining the asymptotic results and\nthe formula for power efficiency factor. Simulations show that this\napproximation is accurate for all SNR regimes.\n", "versions": [{"version": "v1", "created": "Wed, 16 May 2007 02:32:37 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Dai", "Wei", ""], ["Liu", "Youjian", ""], ["Rider", "Brian", ""], ["Lau", "Vincent K. N.", ""]]}, {"id": "0705.2274", "submitter": "Wei Dai", "authors": "Wei Dai, Youjian (Eugene) Liu and Brian Rider", "title": "How Many Users should be Turned On in a Multi-Antenna Broadcast Channel?", "comments": "In Conf. on Info. Sciences and Systems (CISS), 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  This paper considers broadcast channels with L antennas at the base station\nand m single-antenna users, where each user has perfect channel knowledge and\nthe base station obtains channel information through a finite rate feedback.\nThe key observation of this paper is that the optimal number of on-users (users\nturned on), say s, is a function of signal-to-noise ratio (SNR) and other\nsystem parameters. Towards this observation, we use asymptotic analysis to\nguide the design of feedback and transmission strategies. As L, m and the\nfeedback rates approach infinity linearly, we derive the asymptotic optimal\nfeedback strategy and a realistic criterion to decide which users should be\nturned on. Define the corresponding asymptotic throughput per antenna as the\nspatial efficiency. It is a function of the number of on-users s, and\ntherefore, s should be appropriately chosen. Based on the above asymptotic\nresults, we also develop a scheme for a system with finite many antennas and\nusers. Compared with other works where s is presumed constant, our scheme\nachieves a significant gain by choosing the appropriate s. Furthermore, our\nanalysis and scheme is valid for heterogeneous systems where different users\nmay have different path loss coefficients and feedback rates.\n", "versions": [{"version": "v1", "created": "Wed, 16 May 2007 02:48:00 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Dai", "Wei", "", "Eugene"], ["Youjian", "", "", "Eugene"], ["Liu", "", ""], ["Rider", "Brian", ""]]}, {"id": "0705.2278", "submitter": "Wei Dai", "authors": "Wei Dai, Brian Rider and Youjian Liu", "title": "Unequal dimensional small balls and quantization on Grassmann Manifolds", "comments": "Wei_Dai_Conference_Paper : Proc. IEEE International Symposium on\n  Information Theory (ISIT), 2007", "journal-ref": null, "doi": "10.1109/ISIT.2007.4557483", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  The Grassmann manifold G_{n,p}(L) is the set of all p-dimensional planes\n(through the origin) in the n-dimensional Euclidean space L^{n}, where L is\neither R or C. This paper considers an unequal dimensional quantization in\nwhich a source in G_{n,p}(L) is quantized through a code in G_{n,q}(L), where p\nand q are not necessarily the same. It is different from most works in\nliterature where p\\equiv q. The analysis for unequal dimensional quantization\nis based on the volume of a metric ball in G_{n,p}(L) whose center is in\nG_{n,q}(L). Our chief result is a closed-form formula for the volume of a\nmetric ball when the radius is sufficiently small. This volume formula holds\nfor Grassmann manifolds with arbitrary n, p, q and L, while previous results\npertained only to some special cases. Based on this volume formula, several\nbounds are derived for the rate distortion tradeoff assuming the quantization\nrate is sufficiently high. The lower and upper bounds on the distortion rate\nfunction are asymptotically identical, and so precisely quantify the asymptotic\nrate distortion tradeoff. We also show that random codes are asymptotically\noptimal in the sense that they achieve the minimum achievable distortion with\nprobability one as n and the code rate approach infinity linearly. Finally, we\ndiscuss some applications of the derived results to communication theory. A\ngeometric interpretation in the Grassmann manifold is developed for capacity\ncalculation of additive white Gaussian noise channel. Further, the derived\ndistortion rate function is beneficial to characterizing the effect of\nbeamforming matrix selection in multi-antenna communications.\n", "versions": [{"version": "v1", "created": "Wed, 16 May 2007 04:31:48 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Dai", "Wei", ""], ["Rider", "Brian", ""], ["Liu", "Youjian", ""]]}, {"id": "0705.2435", "submitter": "Luay Azzam Mr.", "authors": "Luay Azzam and Ender Ayanoglu", "title": "Reduced Complexity Sphere Decoding for Square QAM via a New Lattice\n  Representation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  Sphere decoding (SD) is a low complexity maximum likelihood (ML) detection\nalgorithm, which has been adapted for different linear channels in digital\ncommunications. The complexity of the SD has been shown to be exponential in\nsome cases, and polynomial in others and under certain assumptions. The sphere\nradius and the number of nodes visited throughout the tree traversal search are\nthe decisive factors for the complexity of the algorithm. The radius problem\nhas been addressed and treated widely in the literature. In this paper, we\npropose a new structure for SD, which drastically reduces the overall\ncomplexity. The complexity is measured in terms of the floating point\noperations per second (FLOPS) and the number of nodes visited throughout the\nalgorithm tree search. This reduction in the complexity is due to the ability\nof decoding the real and imaginary parts of each jointly detected symbol\nindependently of each other, making use of the new lattice representation. We\nfurther show by simulations that the new approach achieves 80% reduction in the\noverall complexity compared to the conventional SD for a 2x2 system, and almost\n50% reduction for the 4x4 and 6x6 cases, thus relaxing the requirements for\nhardware implementation.\n", "versions": [{"version": "v1", "created": "Wed, 16 May 2007 20:54:34 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Azzam", "Luay", ""], ["Ayanoglu", "Ender", ""]]}, {"id": "0705.2535", "submitter": "Oded Kafri", "authors": "Oded Kafri", "title": "Informatics Carnot Machine", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  Based on Planck's blackbody equation it is argued that a single mode light\npulse, with a large number of photons, carries one entropy unit. Similarly, an\nempty radiation mode carries no entropy. In this case, the calculated entropy\nthat a coded sequence of light pulses is carrying is simply the Gibbs mixing\nentropy, which is identical to the logical Shannon information. This approach\nis supported by a demonstration that information transmission and\namplification, by a sequence of light pulses in an optical fiber, is a classic\nCarnot machine comprising of two isothermals and two adiabatic. Therefore it is\nconcluded that entropy under certain conditions is information.\n", "versions": [{"version": "v1", "created": "Thu, 17 May 2007 14:45:08 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Kafri", "Oded", ""]]}, {"id": "0705.2847", "submitter": "Gautham Hariharan", "authors": "Vasanthan Raghavan, Gautham Hariharan and Akbar Sayeed", "title": "Capacity of Sparse Multipath Channels in the Ultra-Wideband Regime", "comments": "submitted to IEEE Journal on Selected Topics in Signal Processing,\n  special issue on Fundamental Performance Limits of Ultra-Wideband Systems,\n  Dec. 2006, revised Apr. 2007", "journal-ref": null, "doi": "10.1109/JSTSP.2007.906666", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  This paper studies the ergodic capacity of time- and frequency-selective\nmultipath fading channels in the ultrawideband (UWB) regime when training\nsignals are used for channel estimation at the receiver. Motivated by recent\nmeasurement results on UWB channels, we propose a model for sparse multipath\nchannels. A key implication of sparsity is that the independent degrees of\nfreedom (DoF) in the channel scale sub-linearly with the signal space dimension\n(product of signaling duration and bandwidth). Sparsity is captured by the\nnumber of resolvable paths in delay and Doppler. Our analysis is based on a\ntraining and communication scheme that employs signaling over orthogonal\nshort-time Fourier (STF) basis functions. STF signaling naturally relates\nsparsity in delay-Doppler to coherence in time-frequency. We study the impact\nof multipath sparsity on two fundamental metrics of spectral efficiency in the\nwideband/low-SNR limit introduced by Verdu: first- and second-order optimality\nconditions. Recent results by Zheng et. al. have underscored the large gap in\nspectral efficiency between coherent and non-coherent extremes and the\nimportance of channel learning in bridging the gap. Building on these results,\nour results lead to the following implications of multipath sparsity: 1) The\ncoherence requirements are shared in both time and frequency, thereby\nsignificantly relaxing the required scaling in coherence time with SNR; 2)\nSparse multipath channels are asymptotically coherent -- for a given but large\nbandwidth, the channel can be learned perfectly and the coherence requirements\nfor first- and second-order optimality met through sufficiently large signaling\nduration; and 3) The requirement of peaky signals in attaining capacity is\neliminated or relaxed in sparse environments.\n", "versions": [{"version": "v1", "created": "Sun, 20 May 2007 03:06:40 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Raghavan", "Vasanthan", ""], ["Hariharan", "Gautham", ""], ["Sayeed", "Akbar", ""]]}, {"id": "0705.2848", "submitter": "Gautham Hariharan", "authors": "Gautham Hariharan and Akbar Sayeed", "title": "Non-Coherent Capacity and Reliability of Sparse Multipath Channels in\n  the Wideband Regime", "comments": "in the proceedings of the 2nd Information Theory and Applications\n  (ITA) Workshop, San Diego, Jan. 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In contrast to the prevalent assumption of rich multipath in information\ntheoretic analysis of wireless channels, physical channels exhibit sparse\nmultipath, especially at large bandwidths. We propose a model for sparse\nmultipath fading channels and present results on the impact of sparsity on\nnon-coherent capacity and reliability in the wideband regime. A key implication\nof sparsity is that the statistically independent degrees of freedom in the\nchannel, that represent the delay-Doppler diversity afforded by multipath,\nscale at a sub-linear rate with the signal space dimension (time-bandwidth\nproduct). Our analysis is based on a training-based communication scheme that\nuses short-time Fourier (STF) signaling waveforms. Sparsity in delay-Doppler\nmanifests itself as time-frequency coherence in the STF domain. From a capacity\nperspective, sparse channels are asymptotically coherent: the gap between\ncoherent and non-coherent extremes vanishes in the limit of large signal space\ndimension without the need for peaky signaling. From a reliability viewpoint,\nthere is a fundamental tradeoff between channel diversity and learnability that\ncan be optimized to maximize the error exponent at any rate by appropriately\nchoosing the signaling duration as a function of bandwidth.\n", "versions": [{"version": "v1", "created": "Sun, 20 May 2007 03:26:36 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Hariharan", "Gautham", ""], ["Sayeed", "Akbar", ""]]}, {"id": "0705.2854", "submitter": "Asaf Cohen", "authors": "Asaf Cohen, Tsachy Weissman and Neri Merhav", "title": "Scanning and Sequential Decision Making for Multi-Dimensional Data -\n  Part II: the Noisy Case", "comments": "The second part of a two-part paper. 49 pages, 6 figures. Submitted\n  to IEEE Trans. Inform. Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CV math.IT", "license": null, "abstract": "  We consider the problem of sequential decision making on random fields\ncorrupted by noise. In this scenario, the decision maker observes a noisy\nversion of the data, yet judged with respect to the clean data. In particular,\nwe first consider the problem of sequentially scanning and filtering noisy\nrandom fields. In this case, the sequential filter is given the freedom to\nchoose the path over which it traverses the random field (e.g., noisy image or\nvideo sequence), thus it is natural to ask what is the best achievable\nperformance and how sensitive this performance is to the choice of the scan. We\nformally define the problem of scanning and filtering, derive a bound on the\nbest achievable performance and quantify the excess loss occurring when\nnon-optimal scanners are used, compared to optimal scanning and filtering.\n  We then discuss the problem of sequential scanning and prediction of noisy\nrandom fields. This setting is a natural model for applications such as\nrestoration and coding of noisy images. We formally define the problem of\nscanning and prediction of a noisy multidimensional array and relate the\noptimal performance to the clean scandictability defined by Merhav and\nWeissman. Moreover, bounds on the excess loss due to sub-optimal scans are\nderived, and a universal prediction algorithm is suggested.\n  This paper is the second part of a two-part paper. The first paper dealt with\nsequential decision making on noiseless data arrays, namely, when the decision\nmaker is judged with respect to the same data array it observes.\n", "versions": [{"version": "v1", "created": "Sun, 20 May 2007 09:14:06 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Cohen", "Asaf", ""], ["Weissman", "Tsachy", ""], ["Merhav", "Neri", ""]]}, {"id": "0705.3013", "submitter": "Stefano Buzzi", "authors": "Stefano Buzzi, H. Vincent Poor, and Daniela Saturnino", "title": "A stochastic non-cooperative game for energy efficiency in wireless data\n  networks", "comments": "To appear in the Proceedings of the 2007 Tyrrhenian International\n  Workshop on Digital Communication, Naples, Italy, September 9 - 12, 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": null, "abstract": "  In this paper the issue of energy efficiency in CDMA wireless data networks\nis addressed through a game theoretic approach. Building on a recent paper by\nthe first two authors, wherein a non-cooperative game for spreading-code\noptimization, power control, and receiver design has been proposed to maximize\nthe ratio of data throughput to transmit power for each active user, a\nstochastic algorithm is here described to perform adaptive implementation of\nthe said non-cooperative game. The proposed solution is based on a combination\nof RLS-type and LMS-type adaptations, and makes use of readily available\nmeasurements. Simulation results show that its performance approaches with\nsatisfactory accuracy that of the non-adaptive game, which requires a much\nlarger amount of prior information.\n", "versions": [{"version": "v1", "created": "Mon, 21 May 2007 16:38:31 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Buzzi", "Stefano", ""], ["Poor", "H. Vincent", ""], ["Saturnino", "Daniela", ""]]}, {"id": "0705.3025", "submitter": "Majed Haddad", "authors": "Majed Haddad, Aawatif Menouni Hayar and Merouane Debbah", "title": "Spectral Efficiency of Spectrum Pooling Systems", "comments": "24 pages, 8 figures", "journal-ref": "IET Special Issue on Cognitive Spectrum Access, Vol. 2, No. 6, pp.\n  733-741, July 2008", "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this contribution, we investigate the idea of using cognitive radio to\nreuse locally unused spectrum to increase the total system capacity. We\nconsider a multiband/wideband system in which the primary and cognitive users\nwish to communicate to different receivers, subject to mutual interference and\nassume that each user knows only his channel and the unused spectrum through\nadequate sensing. The basic idea under the proposed scheme is based on the\nnotion of spectrum pooling. The idea is quite simple: a cognitive radio will\nlisten to the channel and, if sensed idle, will transmit during the voids. It\nturns out that, although its simplicity, the proposed scheme showed very\ninteresting features with respect to the spectral efficiency and the maximum\nnumber of possible pairwise cognitive communications. We impose the constraint\nthat users successively transmit over available bands through selfish water\nfilling. For the first time, our study has quantified the asymptotic (with\nrespect to the band) achievable gain of using spectrum pooling in terms of\nspectral efficiency compared to classical radio systems. We then derive the\ntotal spectral efficiency as well as the maximum number of possible pairwise\ncommunications of such a spectrum pooling system.\n", "versions": [{"version": "v1", "created": "Mon, 21 May 2007 17:26:08 GMT"}, {"version": "v2", "created": "Thu, 9 Oct 2008 15:45:18 GMT"}, {"version": "v3", "created": "Fri, 2 Apr 2010 11:00:17 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Haddad", "Majed", ""], ["Hayar", "Aawatif Menouni", ""], ["Debbah", "Merouane", ""]]}, {"id": "0705.3058", "submitter": "Brooke Shrader", "authors": "Brooke Shrader and Anthony Ephremides", "title": "On the Shannon capacity and queueing stability of random access\n  multicast", "comments": "27 pages, 3 figures. Revisions to sections I, III, VII and App. A, B", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  We study and compare the Shannon capacity region and the stable throughput\nregion for a random access system in which source nodes multicast their\nmessages to multiple destination nodes. Under an erasure channel model which\naccounts for interference and allows for multipacket reception, we first\ncharacterize the Shannon capacity region. We then consider a queueing-theoretic\nformulation and characterize the stable throughput region for two different\ntransmission policies: a retransmission policy and random linear coding. Our\nresults indicate that for large blocklengths, the random linear coding policy\nprovides a higher stable throughput than the retransmission policy.\nFurthermore, our results provide an example of a transmission policy for which\nthe Shannon capacity region strictly outer bounds the stable throughput region,\nwhich contradicts an unproven conjecture that the Shannon capacity and stable\nthroughput coincide for random access systems.\n", "versions": [{"version": "v1", "created": "Mon, 21 May 2007 21:20:52 GMT"}, {"version": "v2", "created": "Thu, 20 Sep 2007 00:24:17 GMT"}], "update_date": "2007-09-20", "authors_parsed": [["Shrader", "Brooke", ""], ["Ephremides", "Anthony", ""]]}, {"id": "0705.3099", "submitter": "Chris Ng", "authors": "Chris T. K. Ng and Deniz Gunduz and Andrea Goldsmith and Elza Erkip", "title": "Distortion Minimization in Gaussian Layered Broadcast Coding with\n  Successive Refinement", "comments": "Accepted for publication in IEEE Transactions on Information Theory", "journal-ref": "IEEE Trans. Inf. Theory, vol. 55, no. 11, pp. 5074-5086, Nov. 2009", "doi": "10.1109/TIT.2009.2030455", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A transmitter without channel state information (CSI) wishes to send a\ndelay-limited Gaussian source over a slowly fading channel. The source is coded\nin superimposed layers, with each layer successively refining the description\nin the previous one. The receiver decodes the layers that are supported by the\nchannel realization and reconstructs the source up to a distortion. The\nexpected distortion is minimized by optimally allocating the transmit power\namong the source layers. For two source layers, the allocation is optimal when\npower is first assigned to the higher layer up to a power ceiling that depends\nonly on the channel fading distribution; all remaining power, if any, is\nallocated to the lower layer. For convex distortion cost functions with convex\nconstraints, the minimization is formulated as a convex optimization problem.\nIn the limit of a continuum of infinite layers, the minimum expected distortion\nis given by the solution to a set of linear differential equations in terms of\nthe density of the fading distribution. As the bandwidth ratio b (channel uses\nper source symbol) tends to zero, the power distribution that minimizes\nexpected distortion converges to the one that maximizes expected capacity.\nWhile expected distortion can be improved by acquiring CSI at the transmitter\n(CSIT) or by increasing diversity from the realization of independent fading\npaths, at high SNR the performance benefit from diversity exceeds that from\nCSIT, especially when b is large.\n", "versions": [{"version": "v1", "created": "Tue, 22 May 2007 07:07:33 GMT"}, {"version": "v2", "created": "Wed, 17 Jun 2009 10:27:03 GMT"}], "update_date": "2009-10-22", "authors_parsed": [["Ng", "Chris T. K.", ""], ["Gunduz", "Deniz", ""], ["Goldsmith", "Andrea", ""], ["Erkip", "Elza", ""]]}, {"id": "0705.3261", "submitter": "Yijia Fan", "authors": "Yijia Fan, Chao Wang, John Thompson, H. Vincent Poor", "title": "Recovering Multiplexing Loss Through Successive Relaying Using\n  Repetition Coding", "comments": "To appear in the IEEE Transactions on Wireless Communications", "journal-ref": null, "doi": "10.1109/TWC.2007.060339", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper, a transmission protocol is studied for a two relay wireless\nnetwork in which simple repetition coding is applied at the relays.\nInformation-theoretic achievable rates for this transmission scheme are given,\nand a space-time V-BLAST signalling and detection method that can approach them\nis developed. It is shown through the diversity multiplexing tradeoff analysis\nthat this transmission scheme can recover the multiplexing loss of the\nhalf-duplex relay network, while retaining some diversity gain. This scheme is\nalso compared with conventional transmission protocols that exploit only the\ndiversity of the network at the cost of a multiplexing loss. It is shown that\nthe new transmission protocol offers significant performance advantages over\nconventional protocols, especially when the interference between the two relays\nis sufficiently strong.\n", "versions": [{"version": "v1", "created": "Tue, 22 May 2007 22:26:41 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Fan", "Yijia", ""], ["Wang", "Chao", ""], ["Thompson", "John", ""], ["Poor", "H. Vincent", ""]]}, {"id": "0705.3344", "submitter": "Marco Lops", "authors": "Ezio Biglieri, Marco Lops", "title": "Multiuser detection in a dynamic environment Part I: User identification\n  and data detection", "comments": "To be published on IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2007.903115", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In random-access communication systems, the number of active users varies\nwith time, and has considerable bearing on receiver's performance. Thus,\ntechniques aimed at identifying not only the information transmitted, but also\nthat number, play a central role in those systems. An example of application of\nthese techniques can be found in multiuser detection (MUD). In typical MUD\nanalyses, receivers are based on the assumption that the number of active users\nis constant and known at the receiver, and coincides with the maximum number of\nusers entitled to access the system. This assumption is often overly\npessimistic, since many users might be inactive at any given time, and\ndetection under the assumption of a number of users larger than the real one\nmay impair performance.\n  The main goal of this paper is to introduce a general approach to the problem\nof identifying active users and estimating their parameters and data in a\nrandom-access system where users are continuously entering and leaving the\nsystem. The tool whose use we advocate is Random-Set Theory: applying this, we\nderive optimum receivers in an environment where the set of transmitters\ncomprises an unknown number of elements. In addition, we can derive\nBayesian-filter equations which describe the evolution with time of the a\nposteriori probability density of the unknown user parameters, and use this\ndensity to derive optimum detectors. In this paper we restrict ourselves to\ninterferer identification and data detection, while in a companion paper we\nshall examine the more complex problem of estimating users' parameters.\n", "versions": [{"version": "v1", "created": "Wed, 23 May 2007 11:31:41 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Biglieri", "Ezio", ""], ["Lops", "Marco", ""]]}, {"id": "0705.3555", "submitter": "Albert Guill\\'en i F\\`abregas", "authors": "Albert Guillen i Fabregas and Giuseppe Caire", "title": "Multidimensional Coded Modulation in Block-Fading Channnels", "comments": "to appear IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  We study the problem of constructing coded modulation schemes over\nmultidimensional signal sets in Nakagami-$m$ block-fading channels. In\nparticular, we consider the optimal diversity reliability exponent of the error\nprobability when the multidimensional constellation is obtained as the rotation\nof classical complex-plane signal constellations. We show that multidimensional\nrotations of full dimension achieve the optimal diversity reliability exponent,\nalso achieved by Gaussian constellations. Multidimensional rotations of full\ndimension induce a large decoding complexity, and in some cases it might be\nbeneficial to use multiple rotations of smaller dimension. We also study the\ndiversity reliability exponent in this case, which yields the optimal\nrate-diversity-complexity tradeoff in block-fading channels with discrete\ninputs.\n", "versions": [{"version": "v1", "created": "Thu, 24 May 2007 11:06:23 GMT"}, {"version": "v2", "created": "Mon, 26 Nov 2007 15:07:52 GMT"}], "update_date": "2007-11-26", "authors_parsed": [["Fabregas", "Albert Guillen i", ""], ["Caire", "Giuseppe", ""]]}, {"id": "0705.3644", "submitter": "Chenguang Lu", "authors": "Chenguang Lu", "title": "Subjective Information Measure and Rate Fidelity Theory", "comments": "5 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.HC math.IT", "license": null, "abstract": "  Using fish-covering model, this paper intuitively explains how to extend\nHartley's information formula to the generalized information formula step by\nstep for measuring subjective information: metrical information (such as\nconveyed by thermometers), sensory information (such as conveyed by color\nvision), and semantic information (such as conveyed by weather forecasts). The\npivotal step is to differentiate condition probability and logical condition\nprobability of a message. The paper illustrates the rationality of the formula,\ndiscusses the coherence of the generalized information formula and Popper's\nknowledge evolution theory. For optimizing data compression, the paper\ndiscusses rate-of-limiting-errors and its similarity to complexity-distortion\nbased on Kolmogorov's complexity theory, and improves the rate-distortion\ntheory into the rate-fidelity theory by replacing Shannon's distortion with\nsubjective mutual information. It is proved that both the rate-distortion\nfunction and the rate-fidelity function are equivalent to a\nrate-of-limiting-errors function with a group of fuzzy sets as limiting\ncondition, and can be expressed by a formula of generalized mutual information\nfor lossy coding, or by a formula of generalized entropy for lossless coding.\nBy analyzing the rate-fidelity function related to visual discrimination and\ndigitized bits of pixels of images, the paper concludes that subjective\ninformation is less than or equal to objective (Shannon's) information; there\nis an optimal matching point at which two kinds of information are equal; the\nmatching information increases with visual discrimination (defined by confusing\nprobability) rising; for given visual discrimination, too high resolution of\nimages or too much objective information is wasteful.\n", "versions": [{"version": "v1", "created": "Thu, 24 May 2007 19:33:43 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Lu", "Chenguang", ""]]}, {"id": "0705.3677", "submitter": "Cemal Akcaba", "authors": "Cemal Ak\\c{c}aba, Patrick Kuppinger and Helmut B\\\"olcskei", "title": "Distributed Transmit Diversity in Relay Networks", "comments": "5 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  We analyze fading relay networks, where a single-antenna source-destination\nterminal pair communicates through a set of half-duplex single-antenna relays\nusing a two-hop protocol with linear processing at the relay level. A family of\nrelaying schemes is presented which achieves the entire optimal\ndiversity-multiplexing (DM) tradeoff curve. As a byproduct of our analysis, it\nfollows that delay diversity and phase-rolling at the relay level are optimal\nwith respect to the entire DM-tradeoff curve, provided the delays and the\nmodulation frequencies, respectively, are chosen appropriately.\n", "versions": [{"version": "v1", "created": "Thu, 24 May 2007 23:07:56 GMT"}], "update_date": "2016-08-14", "authors_parsed": [["Akçaba", "Cemal", ""], ["Kuppinger", "Patrick", ""], ["Bölcskei", "Helmut", ""]]}, {"id": "0705.3895", "submitter": "Apoorva Patel", "authors": "Apoorva D. Patel", "title": "Towards Understanding the Origin of Genetic Languages", "comments": "(v1) 33 pages, contributed chapter to \"Quantum Aspects of Life\",\n  edited by D. Abbott, P. Davies and A. Pati, (v2) published version with some\n  editing", "journal-ref": null, "doi": "10.1142/9781848162556_0010", "report-no": null, "categories": "q-bio.GN cs.IT math.IT physics.bio-ph quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Molecular biology is a nanotechnology that works--it has worked for billions\nof years and in an amazing variety of circumstances. At its core is a system\nfor acquiring, processing and communicating information that is universal, from\nviruses and bacteria to human beings. Advances in genetics and experience in\ndesigning computers have taken us to a stage where we can understand the\noptimisation principles at the root of this system, from the availability of\nbasic building blocks to the execution of tasks. The languages of DNA and\nproteins are argued to be the optimal solutions to the information processing\ntasks they carry out. The analysis also suggests simpler predecessors to these\nlanguages, and provides fascinating clues about their origin. Obviously, a\ncomprehensive unraveling of the puzzle of life would have a lot to say about\nwhat we may design or convert ourselves into.\n", "versions": [{"version": "v1", "created": "Sat, 26 May 2007 13:01:20 GMT"}, {"version": "v2", "created": "Tue, 28 Oct 2008 11:37:41 GMT"}], "update_date": "2016-12-21", "authors_parsed": [["Patel", "Apoorva D.", ""]]}, {"id": "0705.3990", "submitter": "Tadashi Wadyama", "authors": "Tadashi Wadayama", "title": "Interior Point Decoding for Linear Vector Channels", "comments": "18 pages, 17 figures, The paper has been submitted to IEEE\n  Transaction on Information Theory", "journal-ref": null, "doi": "10.1088/1742-6596/95/1/012009", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper, a novel decoding algorithm for low-density parity-check (LDPC)\ncodes based on convex optimization is presented. The decoding algorithm, called\ninterior point decoding, is designed for linear vector channels. The linear\nvector channels include many practically important channels such as inter\nsymbol interference channels and partial response channels. It is shown that\nthe maximum likelihood decoding (MLD) rule for a linear vector channel can be\nrelaxed to a convex optimization problem, which is called a relaxed MLD\nproblem. The proposed decoding algorithm is based on a numerical optimization\ntechnique so called interior point method with barrier function. Approximate\nvariations of the gradient descent and the Newton methods are used to solve the\nconvex optimization problem. In a decoding process of the proposed algorithm, a\nsearch point always lies in the fundamental polytope defined based on a\nlow-density parity-check matrix. Compared with a convectional joint message\npassing decoder, the proposed decoding algorithm achieves better BER\nperformance with less complexity in the case of partial response channels in\nmany cases.\n", "versions": [{"version": "v1", "created": "Mon, 28 May 2007 01:14:19 GMT"}, {"version": "v2", "created": "Tue, 8 Apr 2008 04:11:29 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Wadayama", "Tadashi", ""]]}, {"id": "0705.3992", "submitter": "Tadashi Wadyama", "authors": "Tadashi Wadayama", "title": "Average Stopping Set Weight Distribution of Redundant Random Matrix\n  Ensembles", "comments": "14 pages, 7 figures, Conference version to appear at the 2007 IEEE\n  International Symposium on Information Theory, Nice, France, June 2007", "journal-ref": null, "doi": "10.1109/ISIT.2007.4557663", "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper, redundant random matrix ensembles (abbreviated as redundant\nrandom ensembles) are defined and their stopping set (SS) weight distributions\nare analyzed. A redundant random ensemble consists of a set of binary matrices\nwith linearly dependent rows. These linearly dependent rows (redundant rows)\nsignificantly reduce the number of stopping sets of small size. An upper and\nlower bound on the average SS weight distribution of the redundant random\nensembles are shown. From these bounds, the trade-off between the number of\nredundant rows (corresponding to decoding complexity of BP on BEC) and the\ncritical exponent of the asymptotic growth rate of SS weight distribution\n(corresponding to decoding performance) can be derived. It is shown that, in\nsome cases, a dense matrix with linearly dependent rows yields asymptotically\n(i.e., in the regime of small erasure probability) better performance than\nregular LDPC matrices with comparable parameters.\n", "versions": [{"version": "v1", "created": "Mon, 28 May 2007 01:55:36 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Wadayama", "Tadashi", ""]]}, {"id": "0705.3995", "submitter": "Tadashi Wadyama", "authors": "Tadashi Wadayama", "title": "On Undetected Error Probability of Binary Matrix Ensembles", "comments": "9 pages, a part of the paper was submitted to ISIT 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": null, "abstract": "  In this paper, an analysis of the undetected error probability of ensembles\nof binary matrices is presented. The ensemble called the Bernoulli ensemble\nwhose members are considered as matrices generated from i.i.d. Bernoulli source\nis mainly considered here. The main contributions of this work are (i)\nderivation of the error exponent of the average undetected error probability\nand (ii) closed form expressions for the variance of the undetected error\nprobability. It is shown that the behavior of the exponent for a sparse\nensemble is somewhat different from that for a dense ensemble. Furthermore, as\na byproduct of the proof of the variance formula, simple covariance formula of\nthe weight distribution is derived.\n", "versions": [{"version": "v1", "created": "Mon, 28 May 2007 02:44:27 GMT"}, {"version": "v2", "created": "Tue, 8 Apr 2008 02:36:53 GMT"}], "update_date": "2008-04-08", "authors_parsed": [["Wadayama", "Tadashi", ""]]}, {"id": "0705.4045", "submitter": "Thomas Eccardt", "authors": "Thomas M. Eccardt", "title": "The use of the logarithm of the variate in the calculation of\n  differential entropy among certain related statistical distributions", "comments": "9 pages, one table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper demonstrates that basic statistics (mean, variance) of the\nlogarithm of the variate itself can be used in the calculation of differential\nentropy among random variables known to be multiples and powers of a common\nunderlying variate. For the same set of distributions, the variance of the\ndifferential self-information is shown also to be a function of statistics of\nthe logarithmic variate. Then entropy and its \"variance\" can be estimated using\nonly statistics of the logarithmic variate plus constants, without reference to\nthe traditional parameters of the variate.\n", "versions": [{"version": "v1", "created": "Mon, 28 May 2007 13:45:56 GMT"}, {"version": "v2", "created": "Wed, 10 Dec 2008 18:11:39 GMT"}, {"version": "v3", "created": "Mon, 26 Jan 2009 03:36:42 GMT"}], "update_date": "2009-01-26", "authors_parsed": [["Eccardt", "Thomas M.", ""]]}, {"id": "0705.4134", "submitter": "Michael Vielhaber", "authors": "Michael Vielhaber and Monica del Pilar Canales", "title": "The Battery-Discharge-Model: A Class of Stochastic Finite Automata to\n  Simulate Multidimensional Continued Fraction Expansion", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CC cs.CR math.IT", "license": null, "abstract": "  We define an infinite stochastic state machine, the Battery-Discharge-Model\n(BDM), which simulates the behaviour of linear and jump complexity of the\ncontinued fraction expansion of multidimensional formal power series, a\nrelevant security measure in the cryptanalysis of stream ciphers.\n  We also obtain finite approximations to the infinite BDM, where polynomially\nmany states suffice to approximate with an exponentially small error the\nprobabilities and averages for linear and jump complexity of M-multisequences\nof length n over the finite field F_q, for any M, n, q.\n", "versions": [{"version": "v1", "created": "Tue, 29 May 2007 02:50:42 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Vielhaber", "Michael", ""], ["Canales", "Monica del Pilar", ""]]}, {"id": "0705.4138", "submitter": "Michael Vielhaber", "authors": "Michael Vielhaber and Monica del Pilar Canales", "title": "The Asymptotic Normalized Linear Complexity of Multisequences", "comments": "19 pages, 2 figures, submitted to J. Complexity", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CC cs.CR math.IT", "license": null, "abstract": "  We show that the asymptotic linear complexity of a multisequence a in\nF_q^\\infty that is I := liminf L_a(n)/n and S := limsup L_a(n)/n satisfy the\ninequalities M/(M+1) <= S <= 1 and M(1-S) <= I <= 1-S/M, if all M sequences\nhave nonzero discrepancy infinitely often, and all pairs (I,S) satisfying these\nconditions are met by 2^{\\aleph_0} multisequences a.\n  This answers an Open Problem by Dai, Imamura, and Yang.\n  Keywords: Linear complexity, multisequence, Battery Discharge Model,\nisometry.\n", "versions": [{"version": "v1", "created": "Tue, 29 May 2007 03:41:21 GMT"}], "update_date": "2007-07-13", "authors_parsed": [["Vielhaber", "Michael", ""], ["Canales", "Monica del Pilar", ""]]}, {"id": "0705.4658", "submitter": "Marius Zimand", "authors": "Marius Zimand", "title": "Two sources are better than one for increasing the Kolmogorov complexity\n  of infinite sequences", "comments": "Theorem 4.15 replaced with a weaker version; several other minor\n  changes", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CC math.IT", "license": null, "abstract": "  The randomness rate of an infinite binary sequence is characterized by the\nsequence of ratios between the Kolmogorov complexity and the length of the\ninitial segments of the sequence. It is known that there is no uniform\neffective procedure that transforms one input sequence into another sequence\nwith higher randomness rate. By contrast, we display such a uniform effective\nprocedure having as input two independent sequences with positive but\narbitrarily small constant randomness rate. Moreover the transformation is a\ntruth-table reduction and the output has randomness rate arbitrarily close to\n1.\n", "versions": [{"version": "v1", "created": "Thu, 31 May 2007 17:38:04 GMT"}, {"version": "v2", "created": "Tue, 11 Dec 2007 14:12:28 GMT"}], "update_date": "2007-12-11", "authors_parsed": [["Zimand", "Marius", ""]]}]