[{"id": "1105.0558", "submitter": "Rustam Tagiew", "authors": "Rustam Tagiew", "title": "If more than Analytical Modeling is Needed to Predict Real Agents'\n  Strategic Interaction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the research on the interdisciplinary research\ninfrastructure for understanding human reasoning in game-theoretic terms.\nStrategic reasoning is considered to impact human decision making in social,\neconomical and competitive interactions. The provided introduction explains and\nconnects concepts from AI, game theory and psychology. First result is a\nconcept of interdisciplinary game description language as a part of the focused\ninterdisciplinary research infrastructure. The need of this domain-specific\nlanguage is motivated and is aimed to accelerate the current developments. As\nsecond result, the paper provides a summary of ongoing research and its\nsignificance.\n", "versions": [{"version": "v1", "created": "Tue, 3 May 2011 11:43:36 GMT"}], "update_date": "2011-05-04", "authors_parsed": [["Tagiew", "Rustam", ""]]}, {"id": "1105.0707", "submitter": "Rajesh Chitnis", "authors": "Rajesh Chitnis, MohammadTaghi Hajiaghayi, Vahid Liaghat", "title": "Parameterized Complexity of Problems in Coalitional Resource Games", "comments": "This is the full version of a paper that will appear in the\n  proceedings of AAAI 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coalition formation is a key topic in multi-agent systems. Coalitions enable\nagents to achieve goals that they may not have been able to achieve on their\nown. Previous work has shown problems in coalitional games to be\ncomputationally hard. Wooldridge and Dunne (Artificial Intelligence 2006)\nstudied the classical computational complexity of several natural decision\nproblems in Coalitional Resource Games (CRG) - games in which each agent is\nendowed with a set of resources and coalitions can bring about a set of goals\nif they are collectively endowed with the necessary amount of resources. The\ninput of coalitional resource games bundles together several elements, e.g.,\nthe agent set Ag, the goal set G, the resource set R, etc. Shrot, Aumann and\nKraus (AAMAS 2009) examine coalition formation problems in the CRG model using\nthe theory of Parameterized Complexity. Their refined analysis shows that not\nall parts of input act equal - some instances of the problem are indeed\ntractable while others still remain intractable.\n  We answer an important question left open by Shrot, Aumann and Kraus by\nshowing that the SC Problem (checking whether a Coalition is Successful) is\nW[1]-hard when parameterized by the size of the coalition. Then via a single\ntheme of reduction from SC, we are able to show that various problems related\nto resources, resource bounds and resource conflicts introduced by Wooldridge\net al are 1. W[1]-hard or co-W[1]-hard when parameterized by the size of the\ncoalition. 2. para-NP-hard or co-para-NP-hard when parameterized by |R|. 3. FPT\nwhen parameterized by either |G| or |Ag|+|R|.\n", "versions": [{"version": "v1", "created": "Tue, 3 May 2011 23:03:52 GMT"}], "update_date": "2011-05-05", "authors_parsed": [["Chitnis", "Rajesh", ""], ["Hajiaghayi", "MohammadTaghi", ""], ["Liaghat", "Vahid", ""]]}, {"id": "1105.0819", "submitter": "Pierpaolo Vivo", "authors": "Simone Pigolotti, Sebastian Bernhardsson, Jeppe Juul, Gorm Galster,\n  Pierpaolo Vivo", "title": "Equilibrium strategy and population-size effects in lowest unique bid\n  auctions", "comments": "6 pag. - 7 figs - added Supplementary Material. Changed affiliations.\n  Published version", "journal-ref": "Phys. Rev. Lett. 108, 088701 (2012)", "doi": "10.1103/PhysRevLett.108.088701", "report-no": null, "categories": "cs.GT physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In lowest unique bid auctions, $N$ players bid for an item. The winner is\nwhoever places the \\emph{lowest} bid, provided that it is also unique. We use a\ngrand canonical approach to derive an analytical expression for the equilibrium\ndistribution of strategies. We then study the properties of the solution as a\nfunction of the mean number of players, and compare them with a large dataset\nof internet auctions. The theory agrees with the data with striking accuracy\nfor small population size $N$, while for larger $N$ a qualitatively different\ndistribution is observed. We interpret this result as the emergence of two\ndifferent regimes, one in which adaptation is feasible and one in which it is\nnot. Our results question the actual possibility of a large population to adapt\nand find the optimal strategy when participating in a collective game.\n", "versions": [{"version": "v1", "created": "Sat, 30 Apr 2011 10:09:03 GMT"}, {"version": "v2", "created": "Fri, 9 Dec 2011 12:15:39 GMT"}, {"version": "v3", "created": "Sat, 25 Feb 2012 15:03:56 GMT"}], "update_date": "2015-05-28", "authors_parsed": [["Pigolotti", "Simone", ""], ["Bernhardsson", "Sebastian", ""], ["Juul", "Jeppe", ""], ["Galster", "Gorm", ""], ["Vivo", "Pierpaolo", ""]]}, {"id": "1105.1824", "submitter": "Haris Aziz", "authors": "Haris Aziz and Paul Harrenstein and Evangelia Pyrga", "title": "Individual-based stability in hedonic games depending on the best or\n  worst players", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider coalition formation games in which each player has preferences\nover the other players and his preferences over coalitions are based on the\nbest player ($\\mathcal{B}$-/B-hedonic games) or the worst player\n($\\mathcal{W}$/W-hedonic games) in the coalition. We show that for\n$\\mathcal{B}$-hedonic games, an individually stable partition is guaranteed to\nexist and can be computed efficiently. Similarly, there exists a\npolynomial-time algorithm which returns a Nash stable partition (if one exists)\nfor $\\mathcal{B}$-hedonic games with strict preferences. Both $\\mathcal{W}$-\nand W-hedonic games are equivalent if individual rationality is assumed. It is\nalso shown that for B- or $\\mathcal{W}$-hedonic games, checking whether a Nash\nstable partition or an individually stable partition exists is NP-complete even\nin some cases for strict preferences. We identify a key source of\nintractability in compact coalition formation games in which preferences over\nplayers are extended to preferences over coalitions.\n", "versions": [{"version": "v1", "created": "Mon, 9 May 2011 23:51:47 GMT"}, {"version": "v2", "created": "Sat, 3 Dec 2011 08:20:21 GMT"}], "update_date": "2011-12-06", "authors_parsed": [["Aziz", "Haris", ""], ["Harrenstein", "Paul", ""], ["Pyrga", "Evangelia", ""]]}, {"id": "1105.2225", "submitter": "Oskar Skibski", "authors": "Oskar Skibski", "title": "Steady Marginality: A Uniform Approach to Shapley Value for Games with\n  Externalities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Shapley value is one of the most important solution concepts in\ncooperative game theory. In coalitional games without externalities, it allows\nto compute a unique payoff division that meets certain desirable fairness\naxioms. However, in many realistic applications where externalities are\npresent, Shapley's axioms fail to indicate such a unique division.\nConsequently, there are many extensions of Shapley value to the environment\nwith externalities proposed in the literature built upon additional axioms. Two\nimportant such extensions are \"externality-free\" value by Pham Do and Norde and\nvalue that \"absorbed all externalities\" by McQuillin. They are good reference\npoints in a space of potential payoff divisions for coalitional games with\nexternalities as they limit the space at two opposite extremes. In a recent,\nimportant publication, De Clippel and Serrano presented a marginality-based\naxiomatization of the value by Pham Do Norde. In this paper, we propose a dual\napproach to marginality which allows us to derive the value of McQuillin. Thus,\nwe close the picture outlined by De Clippel and Serrano.\n", "versions": [{"version": "v1", "created": "Wed, 11 May 2011 15:48:21 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Skibski", "Oskar", ""]]}, {"id": "1105.2243", "submitter": "Fran\\c{c}ois M\\'eriaux", "authors": "Fran\\c{c}ois M\\'eriaux, Samson Lasaulce, Michel Kieffer", "title": "More about Base Station Location Games", "comments": "ValueTools '11: 6th International Conference on Performance\n  Evaluation Methodologies and Tools, May 2011, Paris, France", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the problem of locating base stations in a certain area\nwhich is highly populated by mobile stations; each mobile station is assumed to\nselect the closest base station. Base stations are modeled by players who\nchoose their best location for maximizing their uplink throughput. The approach\nof this paper is to make some simplifying assumptions in order to get\ninterpretable analytical results and insights to the problem under study.\nSpecifically, a relatively complete Nash equilibrium (NE) analysis is conducted\n(existence, uniqueness, determination, and efficiency). Then, assuming that the\nbase station location can be adjusted dynamically, the best-response dynamics\nand reinforcement learning algorithm are applied, discussed, and illustrated\nthrough numerical results.\n", "versions": [{"version": "v1", "created": "Wed, 11 May 2011 16:34:21 GMT"}], "update_date": "2011-05-12", "authors_parsed": [["Mériaux", "François", ""], ["Lasaulce", "Samson", ""], ["Kieffer", "Michel", ""]]}, {"id": "1105.2432", "submitter": "Krzysztof R. Apt", "authors": "Krzysztof R. Apt, Guido Schaefer", "title": "Selfishness Level of Strategic Games", "comments": "34 pages", "journal-ref": "Journal of AI Research (JAIR) 49 (2014), pp. 207-240,\n  doi:10.1613/jair.4164", "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new measure of the discrepancy in strategic games between the\nsocial welfare in a Nash equilibrium and in a social optimum, that we call\nselfishness level. It is the smallest fraction of the social welfare that needs\nto be offered to each player to achieve that a social optimum is realized in a\npure Nash equilibrium. The selfishness level is unrelated to the price of\nstability and the price of anarchy and is invariant under positive linear\ntransformations of the payoff functions. Also, it naturally applies to other\nsolution concepts and other forms of games.\n  We study the selfishness level of several well-known strategic games. This\nallows us to quantify the implicit tension within a game between players'\nindividual interests and the impact of their decisions on the society as a\nwhole. Our analyses reveal that the selfishness level often provides a deeper\nunderstanding of the characteristics of the underlying game that influence the\nplayers' willingness to cooperate.\n  In particular, the selfishness level of finite ordinal potential games is\nfinite, while that of weakly acyclic games can be infinite. We derive explicit\nbounds on the selfishness level of fair cost sharing games and linear\ncongestion games, which depend on specific parameters of the underlying game\nbut are independent of the number of players. Further, we show that the\nselfishness level of the $n$-players Prisoner's Dilemma is $c/(b(n-1)-c)$,\nwhere $b$ and $c$ are the benefit and cost for cooperation, respectively, that\nof the $n$-players public goods game is $(1-\\frac{c}{n})/(c-1)$, where $c$ is\nthe public good multiplier, and that of the Traveler's Dilemma game is\n$\\frac{1}{2}(b-1)$, where $b$ is the bonus. Finally, the selfishness level of\nCournot competition (an example of an infinite ordinal potential game, Tragedy\nof the Commons, and Bertrand competition is infinite.\n", "versions": [{"version": "v1", "created": "Thu, 12 May 2011 11:38:21 GMT"}, {"version": "v2", "created": "Thu, 9 Feb 2012 13:41:19 GMT"}, {"version": "v3", "created": "Fri, 1 Jun 2012 09:51:43 GMT"}, {"version": "v4", "created": "Thu, 29 Nov 2012 13:17:41 GMT"}, {"version": "v5", "created": "Mon, 8 Apr 2013 14:34:21 GMT"}, {"version": "v6", "created": "Thu, 5 Dec 2013 12:51:17 GMT"}, {"version": "v7", "created": "Thu, 3 Apr 2014 14:28:03 GMT"}], "update_date": "2014-04-04", "authors_parsed": [["Apt", "Krzysztof R.", ""], ["Schaefer", "Guido", ""]]}, {"id": "1105.2470", "submitter": "Bertrand Georgeot", "authors": "Bertrand Georgeot and Olivier Giraud", "title": "The game of go as a complex network", "comments": "6 pages, 9 figures, final version", "journal-ref": "Europhysics Letters 97, 68002 (2012)", "doi": "10.1209/0295-5075/97/68002", "report-no": null, "categories": "cs.GT cond-mat.stat-mech cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the game of go from a complex network perspective. We construct a\ndirected network using a suitable definition of tactical moves including local\npatterns, and study this network for different datasets of professional\ntournaments and amateur games. The move distribution follows Zipf's law and the\nnetwork is scale free, with statistical peculiarities different from other real\ndirected networks, such as e. g. the World Wide Web. These specificities\nreflect in the outcome of ranking algorithms applied to it. The fine study of\nthe eigenvalues and eigenvectors of matrices used by the ranking algorithms\nsingles out certain strategic situations. Our results should pave the way to a\nbetter modelization of board games and other types of human strategic scheming.\n", "versions": [{"version": "v1", "created": "Thu, 12 May 2011 13:36:09 GMT"}, {"version": "v2", "created": "Wed, 18 Apr 2012 11:03:07 GMT"}], "update_date": "2012-04-20", "authors_parsed": [["Georgeot", "Bertrand", ""], ["Giraud", "Olivier", ""]]}, {"id": "1105.5032", "submitter": "Piotr Faliszewski", "authors": "Piotr Faliszewski and Edith Hemaspaandra and Lane A. Hemaspaandra", "title": "The Complexity of Manipulative Attacks in Nearly Single-Peaked\n  Electorates", "comments": "35 pages, also appears as URCS-TR-2011-968", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many electoral bribery, control, and manipulation problems (which we will\nrefer to in general as \"manipulative actions\" problems) are NP-hard in the\ngeneral case. It has recently been noted that many of these problems fall into\npolynomial time if the electorate is single-peaked (i.e., is polarized along\nsome axis/issue). However, real-world electorates are not truly single-peaked.\nThere are usually some mavericks, and so real-world electorates tend to merely\nbe nearly single-peaked. This paper studies the complexity of\nmanipulative-action algorithms for elections over nearly single-peaked\nelectorates, for various notions of nearness and various election systems. We\nprovide instances where even one maverick jumps the manipulative-action\ncomplexity up to $\\np$-hardness, but we also provide many instances where a\nreasonable number of mavericks can be tolerated without increasing the\nmanipulative-action complexity.\n", "versions": [{"version": "v1", "created": "Wed, 25 May 2011 14:12:06 GMT"}, {"version": "v2", "created": "Fri, 6 Jul 2012 13:59:22 GMT"}], "update_date": "2012-07-09", "authors_parsed": [["Faliszewski", "Piotr", ""], ["Hemaspaandra", "Edith", ""], ["Hemaspaandra", "Lane A.", ""]]}, {"id": "1105.5255", "submitter": "Amitabh Trehan", "authors": "Shay Kutten, Ron Lavi, Amitabh Trehan", "title": "Composition Games for Distributed Systems: the EU Grant games", "comments": "Accepted at AAAI 2013: Twenty-Seventh Conference on Artificial\n  Intelligence, Bellevue, Washington, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CY cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze ways by which people decompose into groups in distributed systems.\nWe are interested in systems in which an agent can increase its utility by\nconnecting to other agents, but must also pay a cost that increases with the\nsize of the sys- tem. The right balance is achieved by the right size group of\nagents. We formulate and analyze three intuitive and realistic games and show\nhow simple changes in the protocol can dras- tically improve the price of\nanarchy of these games. In partic- ular, we identify two important properties\nfor a low price of anarchy: agreement in joining the system, and the possibil-\nity of appealing a rejection from a system. We show that the latter property is\nespecially important if there are some pre- existing constraints regarding who\nmay collaborate (or com- municate) with whom.\n", "versions": [{"version": "v1", "created": "Thu, 26 May 2011 10:49:50 GMT"}, {"version": "v2", "created": "Mon, 4 Jun 2012 12:19:47 GMT"}, {"version": "v3", "created": "Mon, 20 May 2013 13:55:18 GMT"}], "update_date": "2013-05-21", "authors_parsed": [["Kutten", "Shay", ""], ["Lavi", "Ron", ""], ["Trehan", "Amitabh", ""]]}, {"id": "1105.5353", "submitter": "Zhaohui Wei", "authors": "Zhaohui Wei and Shengyu Zhang", "title": "On characterizing quantum correlated equilibria", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum game theory lays a foundation for understanding the interaction of\npeople using quantum computers with conflicting interests. Recently Zhang\nproposed a simple yet rich model to study quantum strategic games, and\naddressed some quantitative questions for general games of growing sizes\n\\cite{Zha10}. However, one fundamental question that the paper did not consider\nis the characterization of quantum correlated equilibria (QCE). In this paper,\nwe answer this question by giving a sufficient and necessary condition for an\narbitrary state $\\rho$ being a QCE. In addition, when the condition fails to\nhold for some player $i$, we give an explicit POVM for that player to achieve a\nstrictly positive gain. Finally, we give some upper bounds for the maximum gain\nby playing quantum strategies over classical ones, and the bounds are tight for\nsome games.\n", "versions": [{"version": "v1", "created": "Thu, 26 May 2011 17:09:38 GMT"}], "update_date": "2011-05-27", "authors_parsed": [["Wei", "Zhaohui", ""], ["Zhang", "Shengyu", ""]]}, {"id": "1105.5983", "submitter": "Reshef Meir", "authors": "Michal Feldman, Reshef Meir and Moshe Tennenholtz", "title": "Stability Scores: Measuring Coalitional Stability", "comments": "Full version, including proofs, of a paper published in the\n  proceedings of AAMAS 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a measure for the level of stability against coalitional\ndeviations, called \\emph{stability scores}, which generalizes widely used\nnotions of stability in non-cooperative games. We use the proposed measure to\ncompare various Nash equilibria in congestion games, and to quantify the effect\nof game parameters on coalitional stability. For our main results, we apply\nstability scores to analyze and compare the Generalized Second Price (GSP) and\nVickrey-Clarke-Groves (VCG) ad auctions. We show that while a central result of\nthe ad auctions literature is that the GSP and VCG auctions implement the same\noutcome in one of the equilibria of GSP, the GSP outcome is far more stable.\nFinally, a modified version of VCG is introduced, which is group\nstrategy-proof, and thereby achieves the highest possible stability score.\n", "versions": [{"version": "v1", "created": "Mon, 30 May 2011 13:16:15 GMT"}, {"version": "v2", "created": "Thu, 9 Feb 2012 15:09:20 GMT"}], "update_date": "2012-02-10", "authors_parsed": [["Feldman", "Michal", ""], ["Meir", "Reshef", ""], ["Tennenholtz", "Moshe", ""]]}]