[{"id": "1602.00101", "submitter": "Anupam Chattopadhyay", "authors": "Anupam Chattopadhyay and Anubhab Baksi", "title": "Reversible Logic Circuit Complexity Analysis via Functional\n  Decomposition", "comments": "4 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reversible computation is gaining increasing relevance in the context of\nseveral post-CMOS technologies, the most prominent of those being Quantum\ncomputing. One of the key theoretical problem pertaining to reversible logic\nsynthesis is the upper bound of the gate count. Compared to the known bounds,\nthe results obtained by optimal synthesis methods are significantly less. In\nthis paper, we connect this problem with the multiplicative complexity analysis\nof classical Boolean functions. We explore the possibility of relaxing the\nancilla and if that approach makes the upper bound tighter. Our results are\nnegative. The ancilla-free synthesis methods by using transformations and by\nstarting from an Exclusive Sum-of-Product (ESOP) formulation remain,\ntheoretically, the synthesis methods for achieving least gate count for the\ncases where the number of variables $n$ is $< 8$ and otherwise, respectively.\n", "versions": [{"version": "v1", "created": "Sat, 30 Jan 2016 10:19:59 GMT"}, {"version": "v2", "created": "Mon, 21 Mar 2016 07:36:01 GMT"}], "update_date": "2016-03-22", "authors_parsed": [["Chattopadhyay", "Anupam", ""], ["Baksi", "Anubhab", ""]]}, {"id": "1602.01084", "submitter": "Andrew Adamatzky", "authors": "Alex J. L. Morgan, David A. Barrow, Andrew Adamatzky, Martin M.\n  Hanczyc", "title": "Simple fluidic digital half-adder", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A fluidic one-bit half-adder is made of five channels which intersect at a\njunction. Two channels are inputs, two channels are outputs and one channel is\nthe drain. The channels direct fluid from input fragments to output fragments\nand the streams of fluid interact at the junctions. Binary signals are\nrepresented by water droplets introduced in the input channels: presence of a\ndroplet in an input or output segments symbolises logical {\\sc True}, absence\n--- {\\sc False}. The droplets travel along channels by following a path of\nleast resistance unless deflected at the junction. We demonstrate the function\nof the half-adder in both computer modelling and laboratory experiments, and\npropose a design of a one-bit full adder based on simulation.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2016 20:59:28 GMT"}], "update_date": "2016-02-03", "authors_parsed": [["Morgan", "Alex J. L.", ""], ["Barrow", "David A.", ""], ["Adamatzky", "Andrew", ""], ["Hanczyc", "Martin M.", ""]]}, {"id": "1602.01600", "submitter": "David Doty", "authors": "David Doty and Andrew Winslow", "title": "Design of Geometric Molecular Bonds", "comments": "Accepted to appear in IEEE Transactions on Molecular, Biological, and\n  Multi-Scale Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CG cs.ET math.IT q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An example of a nonspecific molecular bond is the affinity of any positive\ncharge for any negative charge (like-unlike), or of nonpolar material for\nitself when in aqueous solution (like-like). This contrasts specific bonds such\nas the affinity of the DNA base A for T, but not for C, G, or another A. Recent\nexperimental breakthroughs in DNA nanotechnology demonstrate that a particular\nnonspecific like-like bond (\"blunt-end DNA stacking\" that occurs between the\nends of any pair of DNA double-helices) can be used to create specific\n\"macrobonds\" by careful geometric arrangement of many nonspecific blunt ends,\nmotivating the need for sets of macrobonds that are orthogonal: two macrobonds\nnot intended to bind should have relatively low binding strength, even when\nmisaligned.\n  To address this need, we introduce geometric orthogonal codes that abstractly\nmodel the engineered DNA macrobonds as two-dimensional binary codewords. While\nmotivated by completely different applications, geometric orthogonal codes\nshare similar features to the optical orthogonal codes studied by Chung,\nSalehi, and Wei. The main technical difference is the importance of 2D geometry\nin defining codeword orthogonality.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2016 09:07:20 GMT"}, {"version": "v2", "created": "Thu, 21 Apr 2016 19:55:33 GMT"}, {"version": "v3", "created": "Mon, 1 Aug 2016 16:40:47 GMT"}, {"version": "v4", "created": "Sun, 12 Feb 2017 18:23:31 GMT"}], "update_date": "2017-02-14", "authors_parsed": [["Doty", "David", ""], ["Winslow", "Andrew", ""]]}, {"id": "1602.01947", "submitter": "Tukaram Dongale", "authors": "T. D. Dongale, K. V. Khot, S. V. Mohite, N. K. Desai, S. S. Shinde, A.\n  V. Moholkar, K. Y. Rajpure, P. N. Bhosale, P. S. Patil, P. K. Gaikwad, R. K.\n  Kamat", "title": "Investigating Reliability Aspects of Memristor based RRAM with Reference\n  to Write Voltage and Frequency", "comments": "Pages-11, figures-6", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In this paper, we report the effect of write voltage and frequency on\nmemristor based Resistive Random Access Memory (RRAM). The above said\nparameters have been investigated on the linear drift model of memristor. With\na variation of write voltage from 0.2V to 1.2V and a subsequent frequency\nmodulation from 1, 2, 4, 10, 100 and 200 Hz the corresponding effects on memory\nwindow, Low Resistance State (LRS) and High Resistance State (HRS) have been\nreported. Thus the lifetime ({\\tau}) reliability analysis of memristor based\nRRAM is carried out using above results. It is found that, the HRS is\nindependent of write voltage, whereas LRS shows dependency on write voltage and\nfrequency. The simulation results showcase that the memristor possess higher\nmemory window and lifetime ({\\tau}) in the higher voltage with lower frequency\nregion, which has been attributed to the fewer data losses in the memory\narchitecture.\n", "versions": [{"version": "v1", "created": "Fri, 5 Feb 2016 08:00:13 GMT"}], "update_date": "2016-02-12", "authors_parsed": [["Dongale", "T. D.", ""], ["Khot", "K. V.", ""], ["Mohite", "S. V.", ""], ["Desai", "N. K.", ""], ["Shinde", "S. S.", ""], ["Moholkar", "A. V.", ""], ["Rajpure", "K. Y.", ""], ["Bhosale", "P. N.", ""], ["Patil", "P. S.", ""], ["Gaikwad", "P. K.", ""], ["Kamat", "R. K.", ""]]}, {"id": "1602.02249", "submitter": "Pritam Chougule", "authors": "P.P. Chougule, B. Sen, R. Mukherjee, V.C. Karade, P.S. Patil, T.D.\n  Dongale, and R.K. Kamat", "title": "A Processing In-Memory Realization Using QCA: Proposal and\n  Implementation", "comments": "4 pages, 3 figures, 3 tables, 1 equation", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Processing in Memory (PIM) is a computing paradigm that promises enormous\ngain in processing speed by eradicating latencies in the typical von Neumann\narchitecture. It has gained popularity owing to its throughput by embedding\nstorage and computation of data in a single unit. We portray implementation of\nAkers array architecture endowed with PIM computation using Quantum-dot\nCellular Automata (QCA). We present the proof of concept of PIM with its\nrealization in the QCA designer paradigm. We illustrate implementation of Ex-OR\ngate with the help of QCA based Akers Array and put forth many interesting\npotential possibilities.\n", "versions": [{"version": "v1", "created": "Sat, 6 Feb 2016 13:00:04 GMT"}], "update_date": "2016-02-09", "authors_parsed": [["Chougule", "P. P.", ""], ["Sen", "B.", ""], ["Mukherjee", "R.", ""], ["Karade", "V. C.", ""], ["Patil", "P. S.", ""], ["Dongale", "T. D.", ""], ["Kamat", "R. K.", ""]]}, {"id": "1602.02627", "submitter": "Dmitri Maslov", "authors": "Dmitri Maslov", "title": "Optimal and asymptotically optimal NCT reversible circuits by the gate\n  types", "comments": "14 pages", "journal-ref": "Quantum Information & Computation, 16(13&14):1096-1112 (2016)", "doi": "10.26421/QIC16.13-14", "report-no": null, "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report optimal and asymptotically optimal reversible circuits composed of\nNOT, CNOT, and Toffoli (NCT) gates, keeping the count by the subsets of the\ngate types used. This study fine tunes the circuit complexity figures for the\nrealization of reversible functions via reversible NCT circuits. An important\nconsequence is a result on the limitation of the use of the $T$-count quantum\ncircuit metric popular in applications.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2016 16:11:29 GMT"}, {"version": "v2", "created": "Tue, 16 Feb 2016 17:29:02 GMT"}, {"version": "v3", "created": "Mon, 22 Aug 2016 17:18:33 GMT"}, {"version": "v4", "created": "Wed, 28 Dec 2016 20:10:59 GMT"}], "update_date": "2018-07-25", "authors_parsed": [["Maslov", "Dmitri", ""]]}, {"id": "1602.02638", "submitter": "Laszlo Kish", "authors": "Laszlo B. Kish, Claes-G. Granqvist, Sunil P. Khatri, Ferdinand Peper", "title": "Response to \"Comment on 'Zero and negative energy dissipation at\n  information-theoretic erasure'\"", "comments": "Journal of Computational Electronics (Springer), in press (currently\n  web-published)", "journal-ref": null, "doi": "10.1007/s10825-015-0788-8", "report-no": null, "categories": "cs.ET", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We prove that statistical information theoretic quantities, such as\ninformation entropy, cannot generally be interrelated with the lower limit of\nenergy dissipation during information erasure. We also point out that, in\ndeterministic and error-free computers, the information entropy of memories\ndoes not change during erasure because its value is always zero. On the other\nhand, for information-theoretic erasure - i.e., \"thermalization\" /\nrandomization of the memory - the originally zero information entropy (with\ndeterministic data in the memory) changes after erasure to its maximum value, 1\nbit / memory bit, while the energy dissipation is still positive, even at\nparameters for which the thermodynamic entropy within the memory cell does not\nchange. Information entropy does not convert to thermodynamic entropy and to\nthe related energy dissipation; they are quantities of different physical\nnature. Possible specific observations (if any) indicating convertibility are\nat most fortuitous and due to the disregard of additional processes that are\npresent.\n", "versions": [{"version": "v1", "created": "Fri, 5 Feb 2016 15:32:17 GMT"}], "update_date": "2016-02-09", "authors_parsed": [["Kish", "Laszlo B.", ""], ["Granqvist", "Claes-G.", ""], ["Khatri", "Sunil P.", ""], ["Peper", "Ferdinand", ""]]}, {"id": "1602.02744", "submitter": "Emanuel Gluskin", "authors": "Emanuel Gluskin", "title": "The physical and circuit-theoretic significance of the Memristor : Full\n  version", "comments": "23 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is observed that the inductive and capacitive features of the memristor\nreflect (and are a quintessence of) such features of any resistor. The very\npresence of the voltage and current state variables, associated by their\nelectrodynamics sense with electrical and magnetic fields, in the resistive\ncharacteristic v = f(i), forces any resister to accumulate some magnetic and\nelectrostatic fields and energies around itself, i.e. L and C elements are\nalways present. From the circuit-theoretic point of view, the role of the\nmemristor is seen, first of all, in the elimination of the use of a unique\nv(i). This makes circuits with hysteresis characteristics relevant, and also\nsuggests that the concept of memristor should influence the basic problem of\ndefinition of nonlinearity. Since the memristor mainly originates from the\nresistor, it was found necessary to overview some unusual cases of resistive\ncircuits. The present opinion is that the framework of basic circuit theory and\nits connection with applications should be logically expanded in order to\nnaturally include the new element.\n", "versions": [{"version": "v1", "created": "Sun, 7 Feb 2016 11:52:56 GMT"}, {"version": "v2", "created": "Wed, 10 Feb 2016 16:37:43 GMT"}], "update_date": "2016-02-11", "authors_parsed": [["Gluskin", "Emanuel", ""]]}, {"id": "1602.03494", "submitter": "Tukaram Dongale", "authors": "G. S. Patil, S. R. Ghatage, P. K. Gaikwad, R. K. Kamat, T. D. Dongale", "title": "Time and Frequency Domain Investigation of Selected Memristor based\n  Analog Circuits", "comments": "11 Pages, 9 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In this paper, we investigate few memristor-based analog circuits namely the\nphase shift oscillator, integrator, and differentiator which have been explored\nnumerously using the traditional lumped components. We use LTspice-IV platform\nfor simulation of the above-said circuits. The investigation resorts to the\nnonlinear dopant drift model of memristor and the window function portrayed in\nthe literature for nonlinearity realization. The results of our investigations\ndepict good agreement with the conventional lumped component based phase shift\noscillator, integrator, and differentiator circuits. The results are evident to\nshowcase the potential of the memristor as a promising candidate for the next\ngeneration analog circuits.\n", "versions": [{"version": "v1", "created": "Sat, 6 Feb 2016 12:49:28 GMT"}, {"version": "v2", "created": "Thu, 30 Mar 2017 12:58:44 GMT"}], "update_date": "2017-03-31", "authors_parsed": [["Patil", "G. S.", ""], ["Ghatage", "S. R.", ""], ["Gaikwad", "P. K.", ""], ["Kamat", "R. K.", ""], ["Dongale", "T. D.", ""]]}, {"id": "1602.04806", "submitter": "Tukaram Dongale", "authors": "T. D. Dongale, P. K. Gaikwad, R. K. Kamat", "title": "State Space Analysis of Memristor Based Series and Parallel RLCM\n  Circuits", "comments": "9 pages, 4 figures and 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET nlin.CD", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The present paper investigates state space analysis of memristor based series\nand parallel RLCM circuits. The stability analysis is carried out with the help\nof eigenvalues formulation method, pole-zero plot and transient response of\nsystem. The state space analysis is successfully applied and eigenvalues of the\ntwo circuits are calculated. It is found that the, system follows negative real\npart of eigenvalues. The result clearly shows that addition of memristor in\ncircuits will not alter the stability of system. It is found that systems poles\nlocated at left hand side of the S plane, which indicates stable performance of\nsystem. It clearly evident that eigenvalues has negative real part hence two\nsystems are internally stable.\n", "versions": [{"version": "v1", "created": "Sat, 13 Feb 2016 12:21:38 GMT"}], "update_date": "2016-02-19", "authors_parsed": [["Dongale", "T. D.", ""], ["Gaikwad", "P. K.", ""], ["Kamat", "R. K.", ""]]}, {"id": "1602.04967", "submitter": "Tim Boykett", "authors": "Tim Boykett, Jarkko Kari, Ville Salo", "title": "Strongly Universal Reversible Gate Sets", "comments": "Submitted to Rev Comp 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well-known that the Toffoli gate and the negation gate together yield a\nuniversal gate set, in the sense that every permutation of $\\{0,1\\}^n$ can be\nimplemented as a composition of these gates. Since every bit operation that\ndoes not use all of the bits performs an even permutation, we need to use at\nleast one auxiliary bit to perform every permutation, and it is known that one\nbit is indeed enough. Without auxiliary bits, all even permutations can be\nimplemented. We generalize these results to non-binary logic: If $A$ is a\nfinite set of odd cardinality then a finite gate set can generate all\npermutations of $A^n$ for all $n$, without any auxiliary symbols. If the\ncardinality of $A$ is even then, by the same argument as above, only even\npermutations of $A^n$ can be implemented for large $n$, and we show that indeed\nall even permutations can be obtained from a finite universal gate set. We also\nconsider the conservative case, that is, those permutations of $A^n$ that\npreserve the weight of the input word. The weight is the vector that records\nhow many times each symbol occurs in the word. It turns out that no finite\nconservative gate set can, for all $n$, implement all conservative even\npermutations of $A^n$ without auxiliary bits. But we provide a finite gate set\nthat can implement all those conservative permutations that are even within\neach weight class of $A^n$.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 09:57:00 GMT"}, {"version": "v2", "created": "Sun, 6 Mar 2016 17:24:11 GMT"}], "update_date": "2016-03-08", "authors_parsed": [["Boykett", "Tim", ""], ["Kari", "Jarkko", ""], ["Salo", "Ville", ""]]}, {"id": "1602.06787", "submitter": "Sajad Haghzad", "authors": "Sajad Haghzad Klidbary (IEEE), Saeed Bagheri Shouraki, and Iman\n  Esmaili Pain Afrakoti", "title": "Fast IDS Computing System Method and its Memristor Crossbar-based\n  Hardware Implementation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Active Learning Method (ALM) is one of the powerful tools in soft computing\nthat is inspired by human brain capabilities in processing complicated\ninformation. ALM, which is in essence an adaptive fuzzy learning method, models\na Multi-Input Single-Output (MISO) system with several Single-Input\nSingle-Output (SISO) subsystems. Ink Drop Spread (IDS) operator, which is the\nmain processing engine of this method, extracts useful features from the data\nwithout complicated computations and provides stability and convergence as\nwell. Despite great performance of ALM in applications such as classification,\nclustering, and modelling, an efficient hardware implementation has remained a\nchallenging problem. Large amount of memory required to store the information\nof IDS planes as well as the high computational cost of the IDS computing\nsystem are two main barriers to ALM becoming more popular. In this paper, a\nnovel learning method is proposed based on the idea of IDS, but with a novel\napproach that eliminates the computational cost of IDS operator. Unlike\ntraditional approaches, our proposed method finds functions to describe the IDS\nplane that eliminates the need for large amount of memory to a great extent.\nNarrow Path and Spread, which are two main features used in the inference\nengine of ALM, are then extracted from IDS planes with minimum amount of memory\nusage and power consumption. Our proposed algorithm is fully compatible with\nmemristor-crossbar implementation that leads to a significant decrease in the\nnumber of required memristors (from O(n^2) to O(3n)). Simpler algorithm and\nhigher speed make our algorithm suitable for applications where real-time\nprocess, low-cost and small implementation are paramount. Applications in\nclustering and function approximation are provided, which reveals the effective\nperformance of our proposed algorithm.\n", "versions": [{"version": "v1", "created": "Mon, 22 Feb 2016 14:26:42 GMT"}], "update_date": "2016-02-24", "authors_parsed": [["Klidbary", "Sajad Haghzad", "", "IEEE"], ["Shouraki", "Saeed Bagheri", ""], ["Afrakoti", "Iman Esmaili Pain", ""]]}, {"id": "1602.08799", "submitter": "Wang Kang", "authors": "Wang Kang, Chentian Zheng, Yangqi Huang, Xichao Zhang, Yan Zhou,\n  Weifeng Lv and Weisheng Zhao", "title": "Complementary Skyrmion Racetrack Memory with Voltage Manipulation", "comments": "3 pages, 4 figures", "journal-ref": "IEEE Electron Device Letters 37(7), 924 (2016)", "doi": "10.1109/LED.2016.2574916", "report-no": null, "categories": "cond-mat.mes-hall cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Magnetic skyrmion holds promise as information carriers in the\nnext-generation memory and logic devices, owing to the topological stability,\nsmall size and extremely low current needed to drive it. One of the most\npotential applications of skyrmion is to design racetrack memory (RM), named\nSk-RM, instead of utilizing domain wall (DW). However, current studies face\nsome key design challenges, e.g., skyrmion manipulation, data representation\nand synchronization etc. To address these challenges, we propose here a\ncomplementary Sk-RM structure with voltage manipulation. Functionality and\nperformance of the proposed design are investigated with micromagnetic\nsimulations.\n", "versions": [{"version": "v1", "created": "Mon, 29 Feb 2016 02:27:47 GMT"}], "update_date": "2017-02-21", "authors_parsed": [["Kang", "Wang", ""], ["Zheng", "Chentian", ""], ["Huang", "Yangqi", ""], ["Zhang", "Xichao", ""], ["Zhou", "Yan", ""], ["Lv", "Weifeng", ""], ["Zhao", "Weisheng", ""]]}, {"id": "1602.09070", "submitter": "Filippo Simini", "authors": "Filippo Simini", "title": "Nanoscale artificial intelligence: creating artificial neural networks\n  using autocatalytic reactions", "comments": "15 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A general methodology is proposed to engineer a system of interacting\ncomponents (particles) which is able to self-regulate their concentrations in\norder to produce any prescribed output in response to a particular input. The\nmethodology is based on the mathematical equivalence between artificial neurons\nin neural networks and species in autocatalytic reactions, and it specifies the\nrelationship between the artificial neural network's parameters and the rate\ncoefficients of the reactions between particle species. Such systems are\ncharacterised by a high degree of robustness as they are able to reach the\ndesired output despite disturbances and perturbations of the concentrations of\nthe various species.\n", "versions": [{"version": "v1", "created": "Mon, 29 Feb 2016 17:56:06 GMT"}], "update_date": "2016-03-01", "authors_parsed": [["Simini", "Filippo", ""]]}]