[{"id": "1401.0629", "submitter": "Thomas Niebler", "authors": "Stephan Doerfel and Daniel Zoller and Philipp Singer and Thomas\n  Niebler and Andreas Hotho and Markus Strohmaier", "title": "Of course we share! Testing Assumptions about Social Tagging Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social tagging systems have established themselves as an important part in\ntoday's web and have attracted the interest from our research community in a\nvariety of investigations. The overall vision of our community is that simply\nthrough interactions with the system, i.e., through tagging and sharing of\nresources, users would contribute to building useful semantic structures as\nwell as resource indexes using uncontrolled vocabulary not only due to the\neasy-to-use mechanics. Henceforth, a variety of assumptions about social\ntagging systems have emerged, yet testing them has been difficult due to the\nabsence of suitable data. In this work we thoroughly investigate three\navailable assumptions - e.g., is a tagging system really social? - by examining\nlive log data gathered from the real-world public social tagging system\nBibSonomy. Our empirical results indicate that while some of these assumptions\nhold to a certain extent, other assumptions need to be reflected and viewed in\na very critical light. Our observations have implications for the design of\nfuture search and other algorithms to better reflect the actual user behavior.\n", "versions": [{"version": "v1", "created": "Fri, 3 Jan 2014 11:59:34 GMT"}, {"version": "v2", "created": "Thu, 27 Mar 2014 13:03:32 GMT"}, {"version": "v3", "created": "Fri, 28 Mar 2014 09:41:21 GMT"}], "update_date": "2014-03-31", "authors_parsed": [["Doerfel", "Stephan", ""], ["Zoller", "Daniel", ""], ["Singer", "Philipp", ""], ["Niebler", "Thomas", ""], ["Hotho", "Andreas", ""], ["Strohmaier", "Markus", ""]]}, {"id": "1401.0922", "submitter": "Amir Akhavan", "authors": "Azam Majooni, Mona Masood, Amir Akhavan", "title": "A survey on the importance of visualization and social collaboration in\n  academic digital libraries", "comments": "14 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  From more than half a century ago indexing scientific articles has been\nstudied intensively to provide a more efficient data retrieval and to conserve\nresearchers invaluable time. In the last two decades with the emergence of the\nWorld Wide Web and the rapid growth in the number of scientific documents\nonline many academic databases and search engines were launched with almost\nsimilar structure in order to reduce the difficulty in finding, relating and\nsorting of the existing scientific documents published online. The dramatic\nincrease of the scientific documents in the last few years makes it necessary\nthat the retrieved information by the search engines be analyzed and more\norganized and interpretable representation be displayed to the users.\nInformation visualization is a great way for exploration of large and complex\ndata sets, therefore it can be a natural candidate for the purpose of\ngenerating more comprehensible search results for the citation and academic\ndatabases. In this survey the usage pattern of the participants and their\ndemands and ideas for the existence of other beneficial methods for literature\nreview has been questioned and the results are quantitatively analyzed.\n", "versions": [{"version": "v1", "created": "Sun, 5 Jan 2014 18:22:49 GMT"}], "update_date": "2014-01-07", "authors_parsed": [["Majooni", "Azam", ""], ["Masood", "Mona", ""], ["Akhavan", "Amir", ""]]}, {"id": "1401.1861", "submitter": "Peter Breuer", "authors": "Peter T. Breuer and Jonathan P. Bowen", "title": "Empirical Patterns in Google Scholar Citation Counts", "comments": "6 pages, 8 figures, submitted to Cyberpatterns 2014", "journal-ref": "Proc. CyberPatterns 2014, co-located with SOSE 2014, pp. 398-403,\n  Apr. 2014, IEEE Comp. Soc", "doi": "10.1109/SOSE.2014.55", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scholarly impact may be metricized using an author's total number of\ncitations as a stand-in for real worth, but this measure varies in\napplicability between disciplines. The detail of the number of citations per\npublication is nowadays mapped in much more detail on the Web, exposing certain\nempirical patterns. This paper explores those patterns, using the citation data\nfrom Google Scholar for a number of authors.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jan 2014 23:49:44 GMT"}], "update_date": "2018-09-06", "authors_parsed": [["Breuer", "Peter T.", ""], ["Bowen", "Jonathan P.", ""]]}, {"id": "1401.2134", "submitter": "Alberto Pepe", "authors": "Alyssa Goodman, Alberto Pepe, Alexander W. Blocker, Christine L.\n  Borgman, Kyle Cranmer, Merc\\`e Crosas, Rosanne Di Stefano, Yolanda Gil, Paul\n  Groth, Margaret Hedstrom, David W. Hogg, Vinay Kashyap, Ashish Mahabal, Aneta\n  Siemiginowska, Aleksandra Slavkovic", "title": "10 Simple Rules for the Care and Feeding of Scientific Data", "comments": "Accepted in PLOS Computational Biology. This paper was written\n  collaboratively, on the web, in the open, using Authorea. The living version\n  of this article, which includes sources and history, is available at\n  http://www.authorea.com/3410/", "journal-ref": null, "doi": "10.1371/journal.pcbi.1003542", "report-no": null, "categories": "cs.DL astro-ph.IM cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article offers a short guide to the steps scientists can take to ensure\nthat their data and associated analyses continue to be of value and to be\nrecognized. In just the past few years, hundreds of scholarly papers and\nreports have been written on questions of data sharing, data provenance,\nresearch reproducibility, licensing, attribution, privacy, and more, but our\ngoal here is not to review that literature. Instead, we present a short guide\nintended for researchers who want to know why it is important to \"care for and\nfeed\" data, with some practical advice on how to do that.\n", "versions": [{"version": "v1", "created": "Thu, 9 Jan 2014 19:38:17 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Goodman", "Alyssa", ""], ["Pepe", "Alberto", ""], ["Blocker", "Alexander W.", ""], ["Borgman", "Christine L.", ""], ["Cranmer", "Kyle", ""], ["Crosas", "Mercè", ""], ["Di Stefano", "Rosanne", ""], ["Gil", "Yolanda", ""], ["Groth", "Paul", ""], ["Hedstrom", "Margaret", ""], ["Hogg", "David W.", ""], ["Kashyap", "Vinay", ""], ["Mahabal", "Ashish", ""], ["Siemiginowska", "Aneta", ""], ["Slavkovic", "Aleksandra", ""]]}, {"id": "1401.2254", "submitter": "Lutz Bornmann Dr.", "authors": "Richard Williams and Lutz Bornmann", "title": "Sampling Issues in Bibliometric Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.DL physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bibliometricians face several issues when drawing and analyzing samples of\ncitation records for their research. Drawing samples that are too small may\nmake it difficult or impossible for studies to achieve their goals, while\ndrawing samples that are too large may drain resources that could be better\nused for other purposes. This paper considers three common situations and\noffers advice for dealing with each. First, an entire population of records is\navailable for an institution. We argue that, even though all records have been\ncollected, the use of inferential statistics, significance testing, and\nconfidence intervals is both common and desirable. Second, because of limited\nresources or other factors, a sample of records needs to be drawn. We\ndemonstrate how power analyses can be used to determine in advance how large\nthe sample needs to be to achieve the study's goals. Third, the sample size may\nalready be determined, either because the data have already been collected or\nbecause resources are limited. We show how power analyses can again be used to\ndetermine how large effects need to be in order to find effects that are\nstatistically significant. Such information can then help bibliometricians to\ndevelop reasonable expectations as to what their analysis can accomplish. While\nwe focus on issues of interest to bibliometricians, our recommendations and\nprocedures can easily be adapted for other fields of study.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2014 08:37:20 GMT"}, {"version": "v2", "created": "Tue, 17 Nov 2015 07:51:27 GMT"}], "update_date": "2015-11-18", "authors_parsed": [["Williams", "Richard", ""], ["Bornmann", "Lutz", ""]]}, {"id": "1401.2610", "submitter": "Andrea Ballatore", "authors": "Andrea Ballatore, David C. Wilson, Michela Bertolotto", "title": "A Survey of Volunteered Open Geo-Knowledge Bases in the Semantic Web", "comments": null, "journal-ref": "in Quality Issues in the Management of Web Information, ISRL 50,\n  pp. 93-120, Springer, 2013", "doi": "10.1007/978-3-642-37688-7_5", "report-no": null, "categories": "cs.DL cs.CY cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the past decade, rapid advances in web technologies, coupled with\ninnovative models of spatial data collection and consumption, have generated a\nrobust growth in geo-referenced information, resulting in spatial information\noverload. Increasing 'geographic intelligence' in traditional text-based\ninformation retrieval has become a prominent approach to respond to this issue\nand to fulfill users' spatial information needs. Numerous efforts in the\nSemantic Geospatial Web, Volunteered Geographic Information (VGI), and the\nLinking Open Data initiative have converged in a constellation of open\nknowledge bases, freely available online. In this article, we survey these open\nknowledge bases, focusing on their geospatial dimension. Particular attention\nis devoted to the crucial issue of the quality of geo-knowledge bases, as well\nas of crowdsourced data. A new knowledge base, the OpenStreetMap Semantic\nNetwork, is outlined as our contribution to this area. Research directions in\ninformation integration and Geographic Information Retrieval (GIR) are then\nreviewed, with a critical discussion of their current limitations and future\nprospects.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jan 2014 12:04:48 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Ballatore", "Andrea", ""], ["Wilson", "David C.", ""], ["Bertolotto", "Michela", ""]]}, {"id": "1401.2778", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff, Floortje Alkemade, Gaston Heimeriks, and Rinke\n  Hoekstra", "title": "Patents as Instruments for Exploring Innovation Dynamics: Geographic and\n  Technological Perspectives on \"Photovoltaic Cells\"", "comments": "accepted for publication in Scientometrics on September 10, 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dynamics of innovation are nonlinear and complex: geographical,\ntechnological, and economic selection environments can be expected to interact.\nCan patents provide an analytical lens to this process in terms of different\nattributes such as inventor addresses, classification codes, backward and\nforward citations, etc.? Two recently developed patent maps with interactive\noverlay techniques--Google Maps and maps based on citation relations among\nInternational Patent Classifications (IPC)--are elaborated into dynamic\nversions that allow for online animations and comparisons by using split\nscreens. Various forms of animation are explored. The recently developed\nCooperative Patent Classifications (CPC) of the U.S. Patent and Trade Office\n(USPTO) and the European Patent Office (EPO) provide new options for a precise\ndelineation of samples in both USPTO data and the Worldwide Patent Statistics\nDatabase (PatStat) of EPO. Among the \"technologies for the mitigation of\nclimate change\" (class Y02), we zoom in on nine material technologies for\nphotovoltaic cells; and focus on one of them (CuInSe2) as a lead case. The\nlongitudinal development of Rao-Stirling diversity in the IPC-based maps\nprovides a heuristics for studying technological generations during the period\nunder study (1975-2012). The sequencing of generations prevails in USPTO data\nmore than in PatStat data because PatStat aggregates patent information from\ncountries in different stages of technological development, whereas one can\nexpect USPTO patents to be competitive at the technological edge.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2014 10:43:40 GMT"}, {"version": "v2", "created": "Wed, 10 Sep 2014 14:47:39 GMT"}], "update_date": "2014-09-11", "authors_parsed": [["Leydesdorff", "Loet", ""], ["Alkemade", "Floortje", ""], ["Heimeriks", "Gaston", ""], ["Hoekstra", "Rinke", ""]]}, {"id": "1401.2866", "submitter": "Lutz Bornmann Dr.", "authors": "Lutz Bornmann, Moritz Stefaner, Felix de Moya Anegon, Ruediger Mutz", "title": "What is the effect of country-specific characteristics on the research\n  performance of scientific institutions? Using multi-level statistical models\n  to rank and map universities and research-focused institutions worldwide", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bornmann, Stefaner, de Moya Anegon, and Mutz (in press) have introduced a web\napplication (www.excellencemapping.net) which is linked to both academic\nranking lists published hitherto (e.g. the Academic Ranking of World\nUniversities) as well as spatial visualization approaches. The web application\nvisualizes institutional performance within specific subject areas as ranking\nlists and on custom tile-based maps. The new, substantially enhanced version of\nthe web application and the multilevel logistic regression on which it is based\nare described in this paper. Scopus data were used which have been collected\nfor the SCImago Institutions Ranking. Only those universities and\nresearch-focused institutions are considered that have published at least 500\narticles, reviews and conference papers in the period 2006 to 2010 in a certain\nScopus subject area. In the enhanced version, the effect of single covariates\n(such as the per capita GDP of a country in which an institution is located) on\ntwo performance metrics (best paper rate and best journal rate) is examined and\nvisualized. A covariate-adjusted ranking and mapping of the institutions is\nproduced in which the single covariates are held constant. The results on the\nperformance of institutions can then be interpreted as if the institutions all\nhad the same value (reference point) for the covariate in question. For\nexample, those institutions can be identified worldwide showing a very good\nperformance despite a bad financial situation in the corresponding country.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2014 15:12:54 GMT"}, {"version": "v2", "created": "Thu, 6 Mar 2014 13:05:10 GMT"}, {"version": "v3", "created": "Wed, 16 Apr 2014 19:36:16 GMT"}], "update_date": "2014-04-17", "authors_parsed": [["Bornmann", "Lutz", ""], ["Stefaner", "Moritz", ""], ["Anegon", "Felix de Moya", ""], ["Mutz", "Ruediger", ""]]}, {"id": "1401.4069", "submitter": "Marcel Ausloos", "authors": "Marcel Ausloos", "title": "Binary Scientific Star Coauthors Core Size", "comments": "30 pages, 8 Tables, 1 Appendix, 40 references, to be published in\n  Scientometrics", "journal-ref": "Scientometrics (2014) 99: 331-351", "doi": "10.1007/s11192-014-1230-x", "report-no": null, "categories": "physics.soc-ph cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is examined whether the relationship $ J \\propto A/r^{\\alpha}$, and the\nsubsequent coauthor core notion (Ausloos 2013), between the number ($J$) of\njoint publications (JP) by a \"main scientist\" (LI) with her/his coauthors (CAs)\ncan be extended to a team-like system. This is done by considering that each\ncoauthor can be so strongly tied to the LI that they are forming {\\it binary\nscientific star} (BSS) systems with respect to their other collaborators.\nMoreover, publications in peer review journals and in \"proceedings\", both often\nthought to be of \"different quality\", are separetely distinguished. The role of\na time interval for measuring $J$ and $\\alpha$ is also examined. New indirect\nmeasures are also introduced.\n  For making the point, two LI cases with numerous CAs are studied. It is found\nthat only a few BSS need to be usefully examined. The exponent $\\alpha$ turns\nout to be \"second scientist\" weakly dependent, but still \"size\" and\n\"publication type\" dependent, according to the number of CAs or JP. The CA core\nvalue is found to be (CA or JP) size and publication type dependent, but\nremains in an understandable range. Somewhat unexpectedly, no special\nqualitative difference on the binary scientific star CA core value is found\nbetween publications in peer review journals and in proceedings.\n  In conclusion, some remark is made on partner cooperation in BSS teams. It is\nsuggested that such measures can serve as criteria for distinguishing the role\nof scientists in a team.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2014 15:37:54 GMT"}], "update_date": "2014-04-14", "authors_parsed": [["Ausloos", "Marcel", ""]]}, {"id": "1401.4307", "submitter": "Khalid Belhajjame", "authors": "Khalid Belhajjame and Jun Zhao and Daniel Garijo and Kristina Hettne\n  and Raul Palma and \\'Oscar Corcho and Jos\\'e-Manuel G\\'omez-P\\'erez and Sean\n  Bechhofer and Graham Klyne and Carole Goble", "title": "The Research Object Suite of Ontologies: Sharing and Exchanging Research\n  Data and Methods on the Open Web", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Research in life sciences is increasingly being conducted in a digital and\nonline environment. In particular, life scientists have been pioneers in\nembracing new computational tools to conduct their investigations. To support\nthe sharing of digital objects produced during such research investigations, we\nhave witnessed in the last few years the emergence of specialized repositories,\ne.g., DataVerse and FigShare. Such repositories provide users with the means to\nshare and publish datasets that were used or generated in research\ninvestigations. While these repositories have proven their usefulness,\ninterpreting and reusing evidence for most research results is a challenging\ntask. Additional contextual descriptions are needed to understand how those\nresults were generated and/or the circumstances under which they were\nconcluded. Because of this, scientists are calling for models that go beyond\nthe publication of datasets to systematically capture the life cycle of\nscientific investigations and provide a single entry point to access the\ninformation about the hypothesis investigated, the datasets used, the\nexperiments carried out, the results of the experiments, the people involved in\nthe research, etc. In this paper we present the Research Object (RO) suite of\nontologies, which provide a structured container to encapsulate research data\nand methods along with essential metadata descriptions. Research Objects are\nportable units that enable the sharing, preservation, interpretation and reuse\nof research investigation results. The ontologies we present have been designed\nin the light of requirements that we gathered from life scientists. They have\nbeen built upon existing popular vocabularies to facilitate interoperability.\nFurthermore, we have developed tools to support the creation and sharing of\nResearch Objects, thereby promoting and facilitating their adoption.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jan 2014 11:07:52 GMT"}, {"version": "v2", "created": "Mon, 3 Feb 2014 10:27:19 GMT"}], "update_date": "2014-02-04", "authors_parsed": [["Belhajjame", "Khalid", ""], ["Zhao", "Jun", ""], ["Garijo", "Daniel", ""], ["Hettne", "Kristina", ""], ["Palma", "Raul", ""], ["Corcho", "Óscar", ""], ["Gómez-Pérez", "José-Manuel", ""], ["Bechhofer", "Sean", ""], ["Klyne", "Graham", ""], ["Goble", "Carole", ""]]}, {"id": "1401.4321", "submitter": "Rodrigo Costas", "authors": "Rodrigo Costas, Zohreh Zahedi, Paul Wouters", "title": "Do altmetrics correlate with citations? Extensive comparison of\n  altmetric indicators with citations from a multidisciplinary perspective", "comments": null, "journal-ref": null, "doi": "10.1002/asi.23309", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An extensive analysis of the presence of different altmetric indicators\nprovided by Altmetric.com across scientific fields is presented, particularly\nfocusing on their relationship with citations. Our results confirm that the\npresence and density of social media altmetric counts are still very low and\nnot very frequent among scientific publications, with 15%-24% of the\npublications presenting some altmetric activity and concentrating in the most\nrecent publications, although their presence is increasing over time.\nPublications from the social sciences, humanities and the medical and life\nsciences show the highest presence of altmetrics, indicating their potential\nvalue and interest for these fields. The analysis of the relationships between\naltmetrics and citations confirms previous claims of positive correlations but\nrelatively weak, thus supporting the idea that altmetrics do not reflect the\nsame concept of impact as citations. Also, altmetric counts do not always\npresent a better filtering of highly cited publications than journal citation\nscores. Altmetrics scores (particularly mentions in blogs) are able to identify\nhighly cited publications with higher levels of precision than journal citation\nscores (JCS), but they have a lower level of recall. The value of altmetrics as\na complementary tool of citation analysis is highlighted, although more\nresearch is suggested to disentangle the potential meaning and value of\naltmetric indicators for research evaluation.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jan 2014 12:35:08 GMT"}], "update_date": "2014-08-04", "authors_parsed": [["Costas", "Rodrigo", ""], ["Zahedi", "Zohreh", ""], ["Wouters", "Paul", ""]]}, {"id": "1401.4516", "submitter": "Yanqing Wang", "authors": "Yanqing Wang, Yu Jiang, Xiaolei Wang, Siyu Zhang, Yaowen Liang", "title": "Solving reviewer assignment problem in software peer review: An approach\n  based on preference matrix and asymmetric TSP model", "comments": "11 pages, 1 figure, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimized reviewer assignment can effectively utilize limited intellectual\nresources and significantly assure review quality in various scenarios such as\npaper selection in conference or journal, proposal selection in funding\nagencies and so on. However, little research on reviewer assignment of software\npeer review has been found. In this study, an optimization approach is proposed\nbased on students' preference matrix and the model of asymmetric traveling\nsalesman problem (ATSP). Due to the most critical role of rule matrix in this\napproach, we conduct a questionnaire to obtain students' preference matrices\nand convert them to rule matrices. With the help of software ILOG CPLEX, the\napproach is accomplished by controlling the exit criterion of ATSP model. The\ncomparative study shows that the assignment strategies with both reviewers'\npreference matrix and authors' preference matrix get better performance than\nthe random assignment. Especially, it is found that the performance is just a\nlittle better than that of random assignment when the reviewers' and authors'\npreference matrices are merged. In other words, the majority of students have a\nstrong wish of harmonious development even though high-level students are not\nwilling to do that.\n", "versions": [{"version": "v1", "created": "Sat, 18 Jan 2014 04:46:36 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Wang", "Yanqing", ""], ["Jiang", "Yu", ""], ["Wang", "Xiaolei", ""], ["Zhang", "Siyu", ""], ["Liang", "Yaowen", ""]]}, {"id": "1401.4533", "submitter": "Wolfgang Stock", "authors": "Agnes Mainka, Sarah Hartmann, Wolfgang G. Stock, and Isabella Peters", "title": "Government and Social Media: A Case Study of 31 Informational World\n  Cities", "comments": "In Proceedings of the 47th Hawaii International Conference on System\n  Sciences (pp. 1715-1724). IEEE Computer Society, 2014", "journal-ref": null, "doi": "10.1109/HICSS.2014.219", "report-no": null, "categories": "cs.CY cs.DL cs.SI physics.soc-ph", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Social media platforms are increasingly being used by governments to foster\nuser interaction. Particularly in cities with enhanced ICT infrastructures\n(i.e., Informational World Cities) and high internet penetration rates, social\nmedia platforms are valuable tools for reaching high numbers of citizens. This\nempirical investigation of 31 Informational World Cities will provide an\noverview of social media services used for governmental purposes, of their\npopularity among governments, and of their usage intensity in broadcasting\ninformation online.\n", "versions": [{"version": "v1", "created": "Sat, 18 Jan 2014 11:45:44 GMT"}, {"version": "v2", "created": "Fri, 28 Feb 2014 11:46:49 GMT"}], "update_date": "2014-03-03", "authors_parsed": [["Mainka", "Agnes", ""], ["Hartmann", "Sarah", ""], ["Stock", "Wolfgang G.", ""], ["Peters", "Isabella", ""]]}, {"id": "1401.4676", "submitter": "Enys Mones", "authors": "Enys Mones, P\\'eter Pollner and Tam\\'as Vicsek", "title": "Universal hierarchical behavior of citation networks", "comments": null, "journal-ref": null, "doi": "10.1088/1742-5468/2014/05/P05023", "report-no": null, "categories": "physics.soc-ph cs.DL cs.SI physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many of the essential features of the evolution of scientific research are\nimprinted in the structure of citation networks. Connections in these networks\nimply information about the transfer of knowledge among papers, or in other\nwords, edges describe the impact of papers on other publications. This inherent\nmeaning of the edges infers that citation networks can exhibit hierarchical\nfeatures, that is typical of networks based on decision-making. In this paper,\nwe investigate the hierarchical structure of citation networks consisting of\npapers in the same field. We find that the majority of the networks follow a\nuniversal trend towards a highly hierarchical state, and i) the various fields\ndisplay differences only concerning their phase in life (distance from the\n\"birth\" of a field) or ii) the characteristic time according to which they are\napproaching the stationary state. We also show by a simple argument that the\nalterations in the behavior are related to and can be understood by the degree\nof specialization corresponding to the fields. Our results suggest that during\nthe accumulation of knowledge in a given field, some papers are gradually\nbecoming relatively more influential than most of the other papers.\n", "versions": [{"version": "v1", "created": "Sun, 19 Jan 2014 14:54:15 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Mones", "Enys", ""], ["Pollner", "Péter", ""], ["Vicsek", "Tamás", ""]]}, {"id": "1401.5675", "submitter": "Sandor Soos", "authors": "S\\'andor So\\'os (Dept. Science Policy and Scientometrics, Library and\n  Information Centre of the Hungarian Academy of Sciences, MTA)", "title": "How science maps reveal knowledge transfer: new measurement for a\n  historical case", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modelling actors of science via science (overlay) maps has recently become a\npopular practice in Interdisciplinarity Research (IDR). The benefits of this\ntoolkit have also been recognized for other areas of scientometrics, such as\nthe study of science dynamics. In this paper we propose novel methods of\nmeasuring knowledge diffusion/integration based on previous applications of the\noverlay methodology. New indices called Mean Overlay Distance and Overlay\nDiversity Ratio, respectively, are being drawn from previous uses of the\nStirling index as the main proxy for knowledge diversification. We demonstrate\nthe added value of this proposal via a case study addressing the development of\na rather complex discourse in biology, usually referred to as the Species\nProblem. The selected topic is known for a history connecting various research\nfields and traditions, being, therefore, both an ideal and challenging case for\nthe study of knowledge diffusion.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jan 2014 14:09:15 GMT"}], "update_date": "2014-01-23", "authors_parsed": [["Soós", "Sándor", "", "Dept. Science Policy and Scientometrics, Library and\n  Information Centre of the Hungarian Academy of Sciences, MTA"]]}, {"id": "1401.5775", "submitter": "Tobias Kuhn", "authors": "Tobias Kuhn, Michel Dumontier", "title": "Trusty URIs: Verifiable, Immutable, and Permanent Digital Artifacts for\n  Linked Data", "comments": "Small error corrected in the text (table data was correct) on page\n  13: \"All average values are below 0.8s (0.03s for batch mode). Using Java in\n  batch mode even requires only 1ms per file.\"", "journal-ref": "Proceedings of The Semantic Web: Trends and Challenges, 11th\n  International Conference, ESWC 2014, Springer", "doi": "10.1007/978-3-319-07443-6_27", "report-no": null, "categories": "cs.CR cs.DL cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  To make digital resources on the web verifiable, immutable, and permanent, we\npropose a technique to include cryptographic hash values in URIs. We call them\ntrusty URIs and we show how they can be used for approaches like\nnanopublications to make not only specific resources but their entire reference\ntrees verifiable. Digital artifacts can be identified not only on the byte\nlevel but on more abstract levels such as RDF graphs, which means that\nresources keep their hash values even when presented in a different format. Our\napproach sticks to the core principles of the web, namely openness and\ndecentralized architecture, is fully compatible with existing standards and\nprotocols, and can therefore be used right away. Evaluation of our reference\nimplementations shows that these desired properties are indeed accomplished by\nour approach, and that it remains practical even for very large files.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jan 2014 14:23:43 GMT"}, {"version": "v2", "created": "Fri, 7 Mar 2014 09:29:16 GMT"}, {"version": "v3", "created": "Wed, 28 May 2014 14:50:55 GMT"}], "update_date": "2014-05-29", "authors_parsed": [["Kuhn", "Tobias", ""], ["Dumontier", "Michel", ""]]}, {"id": "1401.5986", "submitter": "Lutz Bornmann Dr.", "authors": "Lutz Bornmann", "title": "How are excellent (highly cited) papers defined in bibliometrics? A\n  quantitative analysis of the literature", "comments": "Accepted for publication in Research Evaluation", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the subject of research excellence has received increasing attention (in\nscience policy) over the last few decades, increasing numbers of bibliometric\nstudies have been published dealing with excellent papers. However, many\ndifferent methods have been used in these studies to identify excellent papers.\nThe present quantitative analysis of the literature has been carried out in\norder to acquire an overview of these methods and an indication of an \"average\"\nor \"most frequent\" bibliometric practice. The search in the Web of Science\nyielded 321 papers dealing with \"highly cited\", \"most cited\", \"top cited\" and\n\"most frequently cited\". Of the 321 papers, 16 could not be used in this study.\nIn around 80% of the papers analyzed in this study, a quantitative definition\nhas been provided with which to identify excellent papers. With definitions\nwhich relate to an absolute number, either a certain number of top cited papers\n(58%) or papers with a minimum number of citations are selected (17%). Around\n23% worked with percentile rank classes. Over these papers, there is an\narithmetic average of the top 7.6% (arithmetic average) or of the top 3%\n(median). The top 1% is used most frequently in the papers, followed by the top\n10%. With the thresholds presented in this study, in future, it will be\npossible to identify excellent papers based on an \"average\" or \"most frequent\"\npractice among bibliometricians.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jan 2014 12:07:55 GMT"}], "update_date": "2014-01-24", "authors_parsed": [["Bornmann", "Lutz", ""]]}, {"id": "1401.6157", "submitter": "Christian Schulz", "authors": "Christian Schulz, Amin Mazloumian, Alexander M Petersen, Orion Penner,\n  Dirk Helbing", "title": "Exploiting citation networks for large-scale author name disambiguation", "comments": "14 pages, 5 figures", "journal-ref": "EPJ Data Science 2014, 3:11", "doi": "10.1140/epjds/s13688-014-0011-3", "report-no": null, "categories": "cs.DL cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a novel algorithm and validation method for disambiguating author\nnames in very large bibliographic data sets and apply it to the full Web of\nScience (WoS) citation index. Our algorithm relies only upon the author and\ncitation graphs available for the whole period covered by the WoS. A pair-wise\npublication similarity metric, which is based on common co-authors,\nself-citations, shared references and citations, is established to perform a\ntwo-step agglomerative clustering that first connects individual papers and\nthen merges similar clusters. This parameterized model is optimized using an\nh-index based recall measure, favoring the correct assignment of well-cited\npublications, and a name-initials-based precision using WoS metadata and\ncross-referenced Google Scholar profiles. Despite the use of limited metadata,\nwe reach a recall of 87% and a precision of 88% with a preference for\nresearchers with high h-index values. 47 million articles of WoS can be\ndisambiguated on a single machine in less than a day. We develop an h-index\ndistribution model, confirming that the prediction is in excellent agreement\nwith the empirical data, and yielding insight into the utility of the h-index\nin real academic ranking scenarios.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2014 20:42:11 GMT"}, {"version": "v2", "created": "Wed, 10 Dec 2014 01:20:41 GMT"}], "update_date": "2014-12-11", "authors_parsed": [["Schulz", "Christian", ""], ["Mazloumian", "Amin", ""], ["Petersen", "Alexander M", ""], ["Penner", "Orion", ""], ["Helbing", "Dirk", ""]]}, {"id": "1401.6951", "submitter": "Asim Ghosh", "authors": "Asim Ghosh, Nachiketa Chattopadhyay, Bikas K. Chakrabarti", "title": "Inequality in Societies, Academic Institutions and Science Journals:\n  Gini and k-indices", "comments": "5 pages, 3 figures", "journal-ref": "Physica A 410 (2014) 30-34", "doi": "10.1016/j.physa.2014.05.026", "report-no": null, "categories": "physics.soc-ph cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social inequality is traditionally measured by the Gini-index ($g$). The\n$g$-index takes values from $0$ to $1$ where $g=0$ represents complete equality\nand $g=1$ represents complete inequality. Most of the estimates of the income\nor wealth data indicate the $g$ value to be widely dispersed across the\ncountries of the world: \\textit{g} values typically range from $0.30$ to $0.65$\nat a particular time (year). We estimated similarly the Gini-index for the\ncitations earned by the yearly publications of various academic institutions\nand the science journals. The ISI web of science data suggests remarkably\nstrong inequality and universality ($g=0.70\\pm0.07$) across all the\nuniversities and institutions of the world, while for the journals we find\n$g=0.65\\pm0.15$ for any typical year. We define a new inequality measure,\nnamely the $k$-index, saying that the cumulative income or citations of ($1-k$)\nfraction of people or papers exceed those earned by the fraction ($k$) of the\npeople or publications respectively. We find, while the $k$-index value for\nincome ranges from $0.60$ to $0.75$ for income distributions across the world,\nit has a value around $0.75\\pm0.05$ for different universities and institutions\nacross the world and around $0.77\\pm0.10$ for the science journals. Apart from\nabove indices, we also analyze the same institution and journal citation data\nby measuring Pietra index and median index.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jan 2014 18:26:12 GMT"}, {"version": "v2", "created": "Tue, 28 Jan 2014 18:09:18 GMT"}, {"version": "v3", "created": "Tue, 6 May 2014 08:39:07 GMT"}, {"version": "v4", "created": "Thu, 8 May 2014 19:18:13 GMT"}, {"version": "v5", "created": "Mon, 26 May 2014 15:12:44 GMT"}], "update_date": "2014-05-27", "authors_parsed": [["Ghosh", "Asim", ""], ["Chattopadhyay", "Nachiketa", ""], ["Chakrabarti", "Bikas K.", ""]]}, {"id": "1401.7239", "submitter": "Laura Sheble", "authors": "Laura Sheble and Annie T. Chen", "title": "Contexts of diffusion: Adoption of research synthesis in Social Work and\n  Women's Studies", "comments": "To appear in proceedings of the 2014 International Conference on\n  Social Computing, Behavioral-Cultural Modeling, and Prediction (SBP2014)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Texts reveal the subjects of interest in research fields, and the values,\nbeliefs, and practices of researchers. In this study, texts are examined\nthrough bibliometric mapping and topic modeling to provide a birds eye view of\nthe social dynamics associated with the diffusion of research synthesis methods\nin the contexts of Social Work and Women's Studies. Research synthesis texts\nare especially revealing because the methods, which include meta-analysis and\nsystematic review, are reliant on the availability of past research and data,\nsometimes idealized as objective, egalitarian approaches to research\nevaluation, fundamentally tied to past research practices, and performed with\nthe goal informing future research and practice. This study highlights the\nco-influence of past and subsequent research within research fields;\nillustrates dynamics of the diffusion process; and provides insight into the\ncultural contexts of research in Social Work and Women's Studies. This study\nsuggests the potential to further develop bibliometric mapping and topic\nmodeling techniques to inform research problem selection and resource\nallocation.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jan 2014 15:57:01 GMT"}], "update_date": "2014-01-29", "authors_parsed": [["Sheble", "Laura", ""], ["Chen", "Annie T.", ""]]}, {"id": "1401.7547", "submitter": "Sadi Seker E", "authors": "Mehmet Lutfi Arslan, Sadi Evren Seker", "title": "Web Based Reputation Index of Turkish Universities", "comments": null, "journal-ref": "International Journal of E-Education E-Business E-Management and\n  E-Learning (IJEEEE), Issn : 2010-3654, vol.4, is.3, pp.197-203, 2014", "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper attempts to develop an online reputation index of Turkish\nuniversities through their online impact and effectiveness. Using 16 different\nweb based parameters and employing normalization process of the results, we\nhave ranked websites of Turkish universities in terms of their web presence.\nThis index is first attempt to determine the tools of reputation of Turkish\nacademic websites and would be a basis for further studies to examine the\nrelation between reputation and the online effectiveness of the universities.\n", "versions": [{"version": "v1", "created": "Sat, 25 Jan 2014 23:33:08 GMT"}], "update_date": "2014-01-30", "authors_parsed": [["Arslan", "Mehmet Lutfi", ""], ["Seker", "Sadi Evren", ""]]}]